{"topics":[{"id":"53dde9bd6368723dfc610100","topic_id":"5161dd617f123bd25900013d","body":"\"@Someoneoro\":/dis/the-time-wasting-thread/post/53dde97c6368726437110100#post_53dde97c6368726437110100\r\n\r\natleast his music is decent SOMETIMES.","author":"5154c5237f123bcd580002fc"},{"id":"53dde9c66368725cd7200000","topic_id":"5161dd617f123bd25900013d","body":"Princess Cadance is best pony.","author":"50b70eeb7f123b1a02000097"},{"id":"53ddea1d6368726414110100","topic_id":"5161dd617f123bd25900013d","body":"\"@Randomosaur\":/dis/the-time-wasting-thread/post/53dde9c66368725cd7200000#post_53dde9c66368725cd7200000\r\nNO\r\n\r\nTOM IS BEST PONY","author":"372056626361644cf4a70c00"},{"id":"53ddea336368721303b10100","topic_id":"5161dd617f123bd25900013d","body":"\"@Randomosaur\":/dis/the-time-wasting-thread/post/53dde9c66368725cd7200000#post_53dde9c66368725cd7200000\r\n\r\nkendrick is best pony.","author":"5154c5237f123bcd580002fc"},{"id":"53ddeada6368724b48330000","topic_id":"5161dd617f123bd25900013d","body":"I know no one really cares about linux, but holy shit they're finally getting their shit together.\r\n\r\nWhat I mean by this is that for years the mentality of the linux community has been RTFM or \"read the fucking manual\" in order to use linux; which is incredibly stupid in that if you have a non-consumer friendly operating system it's going to bomb hard.\r\n\r\nThe last couple of months people are finally getting it through their thick ass skulls that their making shit not consumer friendly is why few people use linux.\r\n\r\nAn example of what I mean by this is that playing league of legends on linux used to be a pain in the ass, but I kind of derped while doing something and screwed up the file so I had to reinstall it; it worked out of the box.  Last time I installed the game it took hours; when I just reinstalled it all I had to do was install it.\r\n\r\nApparently the store problem has been fixed too, but I'm too tired to read it and will bother with it later.","author":"38b55cdf63616403d7560600"},{"id":"53ddebae6368725ce8300100","topic_id":"5161dd617f123bd25900013d","body":"remember those times when we used XD unironically?","author":"5154c5237f123bcd580002fc"},{"id":"53ddec2663687246830d0100","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/53ddeada6368724b48330000#post_53ddeada6368724b48330000\r\nHow is linux? Still a pain?\r\n\r\n\r\nAlso question for ya'll. I never played CoD but many of the criticisms leveled at them I find to be suspicious and misleading based on what I do know about the games.\r\nI jus head Extra Credits say the games incentivize killing anyone with a turban... A few questions: aren't Russians and Koreans more often bad guys than Muslims?\r\nDo you ever get rewarded for killing noncombatants? If not the. Saying you kill \"anyone with a turban\" is a tad misleading right?\r\n\r\nCall them jingoistic, call them dumb, call them bad. You'll get no argument from me, but this is just propaganda.","author":"4fe16df67f123b13e400003f"},{"id":"53ddf0676368726a40790100","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/53ddec2663687246830d0100#post_53ddec2663687246830d0100\r\n[bq=\"Whatevs\"]\"@uc9\":/dis/the-time-wasting-thread/post/53ddeada6368724b48330000#post_53ddeada6368724b48330000\r\nHow is linux? Still a pain?[/bq]\r\nStill a pain, but less of a \"Oh my god!  It's like a barb wire dildo!\" and more of a \"Stop doing stupid shit like asking your average consumer to know SQL to be able to use your programs!\"\r\n\r\nThat is the main problem with Linux is that while it's a good operating system it smells of group think in that you have one brilliant person do something dumb and everyone else follows in line.\r\n\r\nLinus may be a smart man, but he can make dumb mistakes cause he's human and not the messiah.  What I mean by this is that Linus, the person who invented linux, is anti-closed source software and thinks it's immoral for software to be closed source, but the problem with this mentality is that 100% open source software 100% of the time does not work in the business world.  The problem with the linux community is they obviously do not have any background into business or economics or anything of the sort.  Linus is dumb towards understanding business models and economic models of success, but rather than someone go \"oh hey Linus doesn't have a degree in business; maybe we should take what he says with a grain of salt\" everyone just falls in line.\r\n\r\n\r\nMy experience on the linux forums in a nutshell:\r\n\"Dude; your program sucks cause it assumes the user has a background in programming\"\r\n\"My program works\"\r\n\"Yeah; but only if the person has gone to college to get a degree in programming\"\r\n\"But people will go out and learn linux to use it\"\r\n\"Dude, do you even know anything about the business world?  If a product is too complicated to use then the company's sales will shit itself to death\"\r\n\"That's not true; people will use a product if it's good enough\"\r\n\"There's a acronym for what I'm getting at; it's called 'K.I.S.S.' or 'keep it simple; stupid' in that the more exponentially difficult it is to use a program the less likely people are to use it and this is why so few people use linux is that it's far more difficult than Windows or Macs\"\r\n\"But the Mac operating system is less popular than Windows\"\r\n\"But Macs are the most bought company computers; there's a reason why they're doing so well financially.  If Linux was far easier to use it would be the most popular operating system.  It is your destiny; search your feelings; you know it to be true.\"\r\n\"NOOOOOOOOOOOOOOOOOOO-\"\r\n\r\n\r\nI can't wait until SteamOS is out of beta and officially released, cause you can have whatever opinions on valve but you have to admit Gaben sure fucking knows how to run a successful business.","author":"38b55cdf63616403d7560600"},{"id":"53ddf0906368725e11c20100","topic_id":"5161dd617f123bd25900013d","body":"Is Canada a good place to live?","author":"50b70eeb7f123b1a02000097"},{"id":"53ddf16a6368722eed000000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/53ddf0676368726a40790100#post_53ddf0676368726a40790100\r\nTruthfully I know little of valve but they care about convenience as evidenced by Steam, for the most part.","author":"4fe16df67f123b13e400003f"},{"id":"53ddf2e263687210d7f70000","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/53ddf16a6368722eed000000#post_53ddf16a6368722eed000000\r\nBingo; the sole thing linux is missing is convenience to which valve can provide.  I can pretty much play almost all windows games in Linux; it's just not easy to do for your average consumer and requires a fair bit of computer knowledge cause the people who made the programs didn't have consumers in mind.\r\n\r\nLinux + valve = match made in heaven.\r\n\r\nJust wait for the official release though; it's still in beta.  Beta is for bug finding; aka that part where there's a open product that they want to hear what problems people are having but 95% of the people complain that the finished product isn't done not understanding what a beta is.\r\n\r\nIf you aren't familiar with linux or programming I would heavily suggest waiting until it officially gets released.\r\n\r\nSteamOS is to come out next year; I'm pretty sure people can wait ~four months.","author":"38b55cdf63616403d7560600"},{"id":"53ddf4256368723496780000","topic_id":"5161dd617f123bd25900013d","body":"So I leave to go to bed and wake up to Madness as squiggy almost gets pushed to show people his dick. \r\n\r\nBy the power of the ancient internet gods, what is happen!?","author":"50c204917f123b31440000a5"},{"id":"53ddf474636872653e4f0000","topic_id":"5161dd617f123bd25900013d","body":"someone posted a thread wanting to kill himself and ALL of /mu/ is trying to convince him to not doit.","author":"5154c5237f123bcd580002fc"},{"id":"53ddf50e636872750b3e0000","topic_id":"5161dd617f123bd25900013d","body":"\"@twistedmetalero\":/dis/the-time-wasting-thread/post/53ddf474636872653e4f0000#post_53ddf474636872653e4f0000\r\nOh my god! I hope he doesn't do it. \r\n","author":"50c204917f123b31440000a5"},{"id":"53ddf66b636872191d560000","topic_id":"5161dd617f123bd25900013d","body":"\"@Number1pegasus\":/dis/the-time-wasting-thread/post/53ddf50e636872750b3e0000#post_53ddf50e636872750b3e0000\r\n\r\nwelp, he didint doit, he is gonna see till tomorrow if he wants to keep going.","author":"5154c5237f123bcd580002fc"},{"id":"53ddf7196368720e2b4e0000","topic_id":"5161dd617f123bd25900013d","body":"Okay I was just coming in to see what the hell was going on, and now I seriously regret that. I don't know what I feel about that suicide guy, wow must suck for him to publicly announce committing suicide, in all honesty people usually don't do that. Unless they have some reason to attract attention to themselves, I should know. I used to be suicidal years ago.\r\n\r\nHuh, well back to watching House MD, seriously though, why is there no better House MLP fanart or fanfics? I thought that there would be a few, the show was great, 8 seasons and a lot of things to appreciate.\r\n\r\n\r\nAlso I'm pushing ahead with the fanfic idea for ponies to meet with humans who give them technology, science, mathematics, english, and good old religion. What could possibly go wrong long term wise? Really what can possibly go wrong? ","author":"5046d66d7f123b38980018c6"},{"id":"53de82196368726c89040000","topic_id":"5161dd617f123bd25900013d","body":"\"@Evident Disaster\":/dis/the-time-wasting-thread/post/53ddf7196368720e2b4e0000#post_53ddf7196368720e2b4e0000\r\nMaybe you should make a thread for your fanfiction. (Maybe give it a shameless plug somewhere if you really want people to post)\r\n\r\nAlso, You're the only one here who actually talks about Ponies here.","author":"5062d6f17f123b3e16001184"},{"id":"53de82bd6368724597f90000","topic_id":"5161dd617f123bd25900013d","body":"Better not park on bicycle lanes in Lithuania\r\n\r\n!http://pics.kuvaton.com/kuvei/vilnius_bicycle_lane_parking_solution.jpg!","author":"5007bbdf7f123b112f00023a"},{"id":"53de831a636872061a2a0000","topic_id":"5161dd617f123bd25900013d","body":"\"@PaskaNaakka\":/dis/the-time-wasting-thread/post/53de82bd6368724597f90000#post_53de82bd6368724597f90000\r\nHe deserved it.","author":"4fde4618945b700aa0002fff"},{"id":"53de850f6368724bfa740100","topic_id":"5161dd617f123bd25900013d","body":"\"@PaskaNaakka\":/dis/the-time-wasting-thread/post/53de82bd6368724597f90000#post_53de82bd6368724597f90000\r\nHere is what they do in Russia.\r\n!https://i.chzbgr.com/maxW500/6891134208/h59091BF8/!","author":"4fde5cee945b700a970060fc"},{"id":"53de855763687237d82a0000","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/53de850f6368724bfa740100#post_53de850f6368724bfa740100\r\nJesus Christ!! O_O","author":"5056c9e87f123b37f6012a34"},{"id":"53de867663687260b31f0000","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/53de850f6368724bfa740100#post_53de850f6368724bfa740100\r\nThey're weird, Yes, We Know that.\r\n\r\nI'm adding \"Continue Black RX\" To my options of Rider shows to do next.","author":"5062d6f17f123b3e16001184"},{"id":"53de87776368725d55300000","topic_id":"5161dd617f123bd25900013d","body":"So guys. Themes.","author":"4fde4618945b700aa0002fff"},{"id":"53de87e86368725f323b0000","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/53de87776368725d55300000#post_53de87776368725d55300000\r\nWorstfeatureeveriwantthesmilingponysheadonaspikerightnoasblaghblgrglblgralbg","author":"5007bbdf7f123b112f00023a"},{"id":"53de880e6368725e5b320000","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/53de87776368725d55300000#post_53de87776368725d55300000\r\nI'm not sure about the dark theme, I always use the default.","author":"5062d6f17f123b3e16001184"}]}