{"topics":[{"id":"533a2b316368722bda3a0200","topic_id":"5161dd617f123bd25900013d","body":". . . . . . . Shit here comes WWIII\r\n\r\nYeah putin again; well turns out he's eyeing Belarus, Finland and so forth.  I highly doubt finland is just going to let russia do what they did to crimea to them.  Contrary to what people seem to think Finland isn't a pushover; most of their armed forces is on reserve so Putin's probably looking at their active military going, \"yolo\" and forgetting that they have what 350k in reserve?  Also belarus has I believe somewhere around 60k and 300k in reserve.  That's going to definitely be a war if russia tries to do what they did to crimea.","author":"38b55cdf63616403d7560600"},{"id":"533a2e50636872180b8b0100","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/533a2b316368722bda3a0200#post_533a2b316368722bda3a0200\r\n\r\nWWIII?\r\n\r\nWell, time to listen music of the 50s","author":"31bee2686368722a0df23600"},{"id":"533a30786368721ccf420200","topic_id":"5161dd617f123bd25900013d","body":"\"@Gizoid101\":/dis/the-time-wasting-thread/post/533a2e50636872180b8b0100#post_533a2e50636872180b8b0100\r\nAlready ahead of you,\r\n\"I don't want to set the world on fire; I just want to set a flame in your heart\"\r\n\r\nBut in all seriousness what the hell is putin thinking?  The countries he's eyeing has close to a million troops combined(including reserves) and russia has 1.5 million active troops.\r\n\r\nI think putin's been playing too much call of duty lately.","author":"38b55cdf63616403d7560600"},{"id":"533a31256368723d023f0000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/533a30786368721ccf420200#post_533a30786368721ccf420200\r\n\r\nAn old tactic were if you act confident it lowers the moral of the other enemy. You march with lesser numbers but still confident it can drive the enemy to think you're hiding something and that gets them nervous.\r\n\r\nAnd that in and on itself is stupid since you are cornering you're enemy and it's known that when an animal gets cornered, is when they are at their most dangerous.\r\n\r\nIf anything, he should Re-read \"The Art of War\".","author":"4fdfbf92945b7075d50036e4"},{"id":"533a3150636872180bd60200","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/533a30786368721ccf420200#post_533a30786368721ccf420200\r\n\r\nbut in call of duty the russians lose everytime.","author":"5154c5237f123bcd580002fc"},{"id":"533a31dd6368723d02ab0000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/533a2b316368722bda3a0200#post_533a2b316368722bda3a0200\r\n\"Bring out the music\":https://www.youtube.com/watch?v=bWaWU6Amg2c","author":"4fde5cee945b700a970060fc"},{"id":"533a33306368721ccf6a0300","topic_id":"5161dd617f123bd25900013d","body":"\"@QuasarNova\":/dis/the-time-wasting-thread/post/533a31256368723d023f0000#post_533a31256368723d023f0000\r\nHe really needs to re-read the art of war cause this is just straight up stupidity.  You don't bully someone that can fight back.\r\n\"@twistedmetalero\":/dis/the-time-wasting-thread/post/533a3150636872180bd60200#post_533a3150636872180bd60200\r\nHonestly I don't know much about call of duty's story.","author":"38b55cdf63616403d7560600"},{"id":"533a34036368720566a30200","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/533a2b316368722bda3a0200#post_533a2b316368722bda3a0200\r\n[bq=\"uc9\"]. . . . . . . Shit here comes WWIII\r\n\r\nYeah putin again; well turns out he's eyeing Belarus, Finland and so forth.  I highly doubt finland is just going to let russia do what they did to crimea to them.  Contrary to what people seem to think Finland isn't a pushover; most of their armed forces is on reserve so Putin's probably looking at their active military going, \"yolo\" and forgetting that they have what 350k in reserve?  Also belarus has I believe somewhere around 60k and 300k in reserve.  That's going to definitely be a war if russia tries to do what they did to crimea.[/bq]\r\n\r\nWhat else is new? These are former Russian Empire states. And if he wants to rebuild it, those are his tickets.\r\n\r\nAnd Russia has totally gone at it again and again for Finland. It's no new story.","author":"4fe4bf947f123b175b000001"},{"id":"533a34ec6368720501fa0000","topic_id":"5161dd617f123bd25900013d","body":"\"@AaronMk\":/dis/the-time-wasting-thread/post/533a34036368720566a30200#post_533a34036368720566a30200\r\nHurry for Neo-Stalinism or Neo-Tsardom!","author":"4fde5cee945b700a970060fc"},{"id":"533a35166368721cb7470000","topic_id":"5161dd617f123bd25900013d","body":"what timezone are you in uc9?","author":"4fe16df67f123b13e400003f"},{"id":"533a35d16368721cb7910000","topic_id":"5161dd617f123bd25900013d","body":"And it's one, two, three, what are we fighting for?\r\ndon't ask me I don't give a fuck, Russia is the next stop \r\nAnd it's five, six, seven, open up the pearly gates\r\nain't no time to wonder why, whoopee! we're all gonna die!","author":"31bee2686368722a0df23600"},{"id":"533a366263687241df320000","topic_id":"5161dd617f123bd25900013d","body":"\"@AaronMk\":/dis/the-time-wasting-thread/post/533a34036368720566a30200#post_533a34036368720566a30200\r\nI'm not going to lie; I would laugh my ass off if Putin tried to take on Sweden.  Anyone that knows military history knows why it would be funny to see russia *try* to take on sweden.\r\n\"@Whatevs\":/dis/the-time-wasting-thread/post/533a35166368721cb7470000#post_533a35166368721cb7470000\r\nCentral time zone.\r\nMy sleep schedule is normally 4am to 12pm or 6am to 2pm.  I really do not like sunlight at all.  The only way you'll ever get me to come out during the day is either if it's cloudy and dark or you say the words, \"I have a swimming pool\" otherwise nuh-uh.  Me in direct sunlight = long sleeve overshirt, pants, scarf, sunglasses and a hat to cover everything or umbrella.","author":"38b55cdf63616403d7560600"},{"id":"533a36ae6368726896ed0100","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/533a366263687241df320000#post_533a366263687241df320000\r\n\r\nThere's a vampire joke here. But hopefuly, we're all aboce that... I hope...","author":"4fdfbf92945b7075d50036e4"},{"id":"533a38e9636872552d0c0100","topic_id":"5161dd617f123bd25900013d","body":"\"@QuasarNova\":/dis/the-time-wasting-thread/post/533a36ae6368726896ed0100#post_533a36ae6368726896ed0100\r\nAs long as no one calls Blade or Abraham Lincoln.","author":"38b55cdf63616403d7560600"},{"id":"533a39f16368726896190300","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/533a366263687241df320000#post_533a366263687241df320000\r\n[bq=\"uc9\"]\"@AaronMk\":/dis/the-time-wasting-thread/post/533a34036368720566a30200#post_533a34036368720566a30200\r\nI'm not going to lie; I would laugh my ass off if Putin tried to take on Sweden.  Anyone that knows military history knows why it would be funny to see russia *try* to take on sweden.[/bq]\r\n\r\nSay wot.","author":"4fe4bf947f123b175b000001"},{"id":"533a3aef6368721a8a0b0300","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/533a38e9636872552d0c0100#post_533a38e9636872552d0c0100\r\n\r\n¬¬...\r\n\r\nAre you a familiar?","author":"31bee2686368722a0df23600"},{"id":"533a3b8e6368722b87da0200","topic_id":"5161dd617f123bd25900013d","body":"\"@AaronMk\":/dis/the-time-wasting-thread/post/533a39f16368726896190300#post_533a39f16368726896190300\r\nBasically Sweden is secretly badass and you don't ever fuck with them *EVER*.  If Russia invaded Sweden then Russia's military would get turned to red paste and would take years for them to find all the russian soldier body parts.\r\n\r\nA Russia vs Sweden war would go like this:\r\nRussian soldiers, \"You're dead Sweden!\"\r\n(Sweden sends them a train full of all the russian soldier body parts back to them with a note on the front saying, \"good luck\")","author":"38b55cdf63616403d7560600"},{"id":"533a3ce96368726117200000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/533a3b8e6368722b87da0200#post_533a3b8e6368722b87da0200\r\nI doubt that, Sweden can't keep riots under control and the men are simpy","author":"4fe16df67f123b13e400003f"},{"id":"533a3d226368726124410000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/533a3b8e6368722b87da0200#post_533a3b8e6368722b87da0200\r\n\r\nI haven't found anything to suggest what you're saying is correct. If anything in the most recent conflicts things ended at the re-establishment of the Status Quo with no hard damages wrought, or Russia won. For the most part, Russia was the one to rip Finland from Sweden, and on before then chip away at what influence they had picked up during The Troubles in the Baltic region.\r\n\r\nThere is no fine example I can find of \"Russians being turned to paste\" by the Swedes. If this was the case, I would expect a greater range of territorial or political losses on the Russians by Sweden. Instead all I get is a bunch of Tsars/Tsarinas declaring them a minor nuisance as they wrangle with choking the Ottoman Empire to death.\r\n\r\nOr just straight up taking over all of Finland and forcing Romanovs onto the Swedish throne as heir apparents.","author":"4fe4bf947f123b175b000001"},{"id":"533a3d2b6368726ff52a0200","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/533a3b8e6368722b87da0200#post_533a3b8e6368722b87da0200\r\nBut in the same way. If Sweden invades Russia, the Russian with ship back bodies of Swedish troops in cold cases.\r\n\r\nPoltava.","author":"4fde5cee945b700a970060fc"},{"id":"533a402f63687264a9980100","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/533a3ce96368726117200000#post_533a3ce96368726117200000\r\nThe swedish military has detailed lists of all possible war scenarios against any possible military with the ability to attack and detailed listings of what to do in each scenario.  They even have listing of all structural weak points on bridges and so forth.\r\n\r\nWant to use a bridge to get to a city?  Good luck swimming.  Want to use a mountain pass?  Sure hope your soldiers can breath rubble.  Want to use a tunnel that is the only way to get through the mountain for your vehicles?  Sure hope your soldiers aren't claustrophobic cause they'll be there for a very long time.\r\n\r\nThe only viable option to get large quantities of troops into sweden to conquer them would be to airdrop them, cause otherwise you'd be getting blown up every twenty feet stepping on landmines/IEDs, traps, bouncing betties, claymores, having bridges blown out under you, getting tunnel entrances blown close while you're in it, support beams for buildings blown while you're in them and so forth.\r\n\r\nIt would be less of a war and russian soldiers having to stop every five feet to disarm a bomb so that the entire bridge won't collapse under them.  You know how the war in afghanistan primarily consists of IEDs blowing up people and the occasional firefight?  Now imagine bombs and landmines everywhere on every surface imaginable.","author":"38b55cdf63616403d7560600"},{"id":"533a410b6368721708fe0000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/533a402f63687264a9980100#post_533a402f63687264a9980100\r\n\r\nAll nation's militaries have a list of contingency plans involving the predicted or possibly invasion plans by a potential rival. That does not more them invincible, since any plan could still be broken with time or simply accommodating for any possible move they could make to stop or slow you.\r\n\r\nBridge down? Send in the heli corp and move men and gear to establish a position to allow engineers to rebuild the bridge, or simply make a spear-head against enemy positions. Replace armor support with air support while the same heli corp moves your tanks around.\r\n\r\nOr you know what? Go around the river. Engineer corps exist for a reason, and that reason is to set up a bridge over whatever they may hit in their way. It's to be expected.","author":"4fe4bf947f123b175b000001"},{"id":"533a446a6368722faa620200","topic_id":"5161dd617f123bd25900013d","body":"\"@AaronMk\":/dis/the-time-wasting-thread/post/533a410b6368721708fe0000#post_533a410b6368721708fe0000\r\nProblem 1)If a entire bridge is at the bottom of a river how do you plan to fix that.\r\nProblem 2)If all access points are rigged to blow up how do you plan on getting across via land if the areas that are close enough for you to cross have minefields on the other side?\r\nProblem 3)If the explosives were already laid before you arrived then how would air support disarm the explosives?  Do you plan on shooting them off?\r\nProblem 4)Tunnels would be death traps\r\n\r\nThrowing numbers at them hoping they get through doesn't work if they all get blown up anyhow.  That's like telling a battalion of soldiers, \"hey there's a minefield in front of us so I figured the best course of action is we all run through and a couple of you should make it to the other side\".\r\n\r\nI don't normally say this, but you're the worst armchair general cause throwing numbers at enemies doesn't work if the enemy has more bombs under your feet than sand at a beach.\r\n\r\nIf I was in a military and I saw my buddy walk forwards and get blown up by a mine, then I saw my next buddy walk forwards and get blown up by another mine, then I saw another buddy walk forwards and get blown up by yet another mine I don't think I would walk that way.","author":"38b55cdf63616403d7560600"},{"id":"533a45f26368720c7bde0000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/533a446a6368722faa620200#post_533a446a6368722faa620200\r\n\r\nWhen I conquer the world. I shall appoint you as one of my conscelours, at the risk of eventual betrayal. Same as Whatevs and maybe some others.","author":"4fdfbf92945b7075d50036e4"},{"id":"533a46986368723f61190000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/533a446a6368722faa620200#post_533a446a6368722faa620200\r\nAgain, Sweden can't keep riots under control so I think they've lost their grit.\r\nThey can hold various choke points, sure, but through use of guerilla tactics Russia could break their fighting spirit.\r\nThey just can't charge in expecting to take the country.","author":"4fe16df67f123b13e400003f"}]}