{"topics":[{"id":"533a5a9963687207b88d0300","topic_id":"5161dd617f123bd25900013d","body":"\"@trashboat\":/dis/the-time-wasting-thread/post/533a597b6368726036b90000#post_533a597b6368726036b90000\r\nCrud; even I would have wanted to join in if you had to actually go to the location.\r\n\r\n(outside of porn store)\r\n\"Pikachu!  Use tail whip!  Slam!  Endure!  Discharge!\"","author":"38b55cdf63616403d7560600"},{"id":"533a5d906368721a0bdb0000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/533a5a9963687207b88d0300#post_533a5a9963687207b88d0300\r\n\r\nI would use my Metapod... If you know what I mean...","author":"31bee2686368722a0df23600"},{"id":"533a5e4a63687261deef0200","topic_id":"5161dd617f123bd25900013d","body":"\"@Gizoid101\":/dis/the-time-wasting-thread/post/533a5d906368721a0bdb0000#post_533a5d906368721a0bdb0000\r\nPinser use cut!","author":"38b55cdf63616403d7560600"},{"id":"533a5fbb63687275ba350000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/533a5e4a63687261deef0200#post_533a5e4a63687261deef0200\r\nMetapod!\r\n\r\nUse Harder and String Shot!","author":"31bee2686368722a0df23600"},{"id":"533a69f96368721097850100","topic_id":"5161dd617f123bd25900013d","body":"\"@Gizoid101\":/dis/the-time-wasting-thread/post/533a5fbb63687275ba350000#post_533a5fbb63687275ba350000\r\nAnybody ever sit down and think to themselves, \"I have the most powerful computational system in my skull that is more powerful than all the computers on earth combined and I'm using it to come up with dirty jokes by equating it to video game character attack moves\"?\r\n\r\nAlso the fact that when you really think about it the human mind is a artificial construct that defines itself as real through senses, but in reality our minds lie about what is actually real versus what isn't all the time, is hard wired to falsely perceive things, falsely comprehend things and that we rarely are aware of this fact, if ever, but we spend most of our time looking up pictures of cats on the internet.\r\n\r\nAnyone ever think about that?  I mean if our \"self\" is a artificial construct based on our own perception and our perception and memories can lie to \"us\" then wouldn't that mean that fundamentally our \"self\" in of itself is just a lie our self told it's self due to warped perceptions of ourselves and the outside to justify it's own identity as it's self?","author":"38b55cdf63616403d7560600"},{"id":"533a7aae63687202d4b00200","topic_id":"5161dd617f123bd25900013d","body":"Putin, stop looking at finland like that. You're making us feel pretty uncomfortable.","author":"5007bbdf7f123b112f00023a"},{"id":"533a7b3d6368720f95300000","topic_id":"5161dd617f123bd25900013d","body":"\"@PaskaNaakka\":/dis/the-time-wasting-thread/post/533a7aae63687202d4b00200#post_533a7aae63687202d4b00200\r\nOh you fins","author":"4fe16df67f123b13e400003f"},{"id":"533a89ec63687212433e0000","topic_id":"5161dd617f123bd25900013d","body":"If you had superpowers in the Marvel Universe;\r\n\r\nWhat would your powers be?\r\nGood or evil?\r\nIf good, do you work with SHIELD like Black Widow or alone like Iron Man?\r\nIf evil, do you go around wrecking havoc like Abomination or try to conquer the world like Dr Doom?\r\nOr maybe something in between, like Deadpool?","author":"4fe1b9f47f123b13df002976"},{"id":"533a8d9b63687231a6c90000","topic_id":"5161dd617f123bd25900013d","body":"\"@HJSDGCE\":/dis/the-time-wasting-thread/post/533a89ec63687212433e0000#post_533a89ec63687212433e0000\r\nChaotic neutral.\r\n\r\nSo I was watching the old Sailor Moon cartoon and the dub was pretty fine, but then all of a sudden it went to pure crap (especially the main character).\r\nWhat the hell?\r\nNo, not April Fools","author":"4fe16df67f123b13e400003f"},{"id":"533a93f2636872383d2d0300","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/533a8d9b63687231a6c90000#post_533a8d9b63687231a6c90000\r\n>Watching the Sailor moon dub\r\n\r\n>Not watching the Glorious Japanese Dub with subs\r\n\r\nThere's your problem right there,\r\n\r\nSeriously though, In the first half, The voice acting is okay, But the editing is atrocious, And Based On what I've heard, It's Vice versa for the second half","author":"5062d6f17f123b3e16001184"},{"id":"533a9661636872453cf20000","topic_id":"5161dd617f123bd25900013d","body":"\"@trashboat\":/dis/the-time-wasting-thread/post/533a93f2636872383d2d0300#post_533a93f2636872383d2d0300\r\nI guess I will have to go Japanese. It is seriously night and day though.","author":"4fe16df67f123b13e400003f"},{"id":"533ada67636872749e420200","topic_id":"5161dd617f123bd25900013d","body":"You dont know te real definition of friendship, until you and 3 other guys destroy alexander the asshole at once in civ 5","author":"5154c5237f123bcd580002fc"},{"id":"533ae1f7636872768b540000","topic_id":"5161dd617f123bd25900013d","body":"T-minus NOLA.","author":"4fe4bf947f123b175b000001"},{"id":"533ae2836368725e221f0100","topic_id":"5161dd617f123bd25900013d","body":"So much Cage on the site. I have seen paradise.","author":"4fdfbf92945b7075d50036e4"},{"id":"533afc7a63687261c2120200","topic_id":"5161dd617f123bd25900013d","body":"\"@QuasarNova\":/dis/the-time-wasting-thread/post/533ae2836368725e221f0100#post_533ae2836368725e221f0100\r\nI kinda never want this to end.","author":"4f41ee04945b701c41002af7"},{"id":"533b01ed6368720c71310100","topic_id":"5161dd617f123bd25900013d","body":"i think im starting to hate the show once again.","author":"5154c5237f123bcd580002fc"},{"id":"533b1e3c63687221004b0100","topic_id":"5161dd617f123bd25900013d","body":"Huffingtonpost made a really good article on the long term effects of 3d printing, technological advancement and so forth;\r\nhttp://www.huffingtonpost.com/jeremy-rifkin/collaborative-commons-zero-marginal-cost-society_b_5064767.html\r\nObviously it's biased, but it does raise a good point though; one of the main driving forces behind any economy is to cut costs of production, but what's going to happen with the introduction of 3d printing where the cost of production is going to continuously go down?  Basically in fifty years time when technology has reached the point where you can download a car literally will current economic principles go the way of the dinosaurs?\r\n\r\nTl:dr; thanks to 3d printing in fifty years time if everything costs close to $0 would there really be a need for money?","author":"38b55cdf63616403d7560600"},{"id":"533b1fa26368722100d90100","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/533b1e3c63687221004b0100#post_533b1e3c63687221004b0100\r\n\r\nwould that be bad? i mean wont we go back to trading and there is like billions of people complaining about money is god n stuff.\r\n\r\n\r\nliterally this thread made me learn more about politics than anything ever.","author":"5154c5237f123bcd580002fc"},{"id":"533b21e4636872561f030000","topic_id":"5161dd617f123bd25900013d","body":"\"@twistedmetalero\":/dis/the-time-wasting-thread/post/533b1fa26368722100d90100#post_533b1fa26368722100d90100\r\nI don't think it would be bad; it was just a interesting thought.\r\n\r\nThey're already starting 3d printing houses, cars and such.  The main problem with 3d printing is that it's not cheap enough *yet*.  If you're printing individual products it's cheaper than production, but it's going to be another ten years until factory assembly lines are obsolete.\r\n\r\nAlso the comments on the news article is funny when you read them cause they all fall into two categories, \"Captilism is god cause 'MURRICA!\" or \"Nuh-uh technology only changes in ways I dictate that they're allowed to change\".  Also the american chamber of commerce right now is in a absolute meltdown panic over 3d printing.\r\n\r\nIt's kind of fun to watch though.","author":"38b55cdf63616403d7560600"},{"id":"533b269763687247b3050200","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/533b21e4636872561f030000#post_533b21e4636872561f030000\r\nAs someone with a degree in metal working, I must say I don't think 3D printing is the answer for everything. You can't \"print\" metal. Sure you can melt it down to liquid and add each layer but here's the problem: the part will be _much_ weaker than if you were to machine it from a solid piece or cast it from molten metal. Why? Each layer of metal will not bond well with the other layer, even if each layer is applied rapidly before the last layer has time to cool the joint where the layers meet will be very weak, just like a weld joint. Did you know that even though welds are strong enough to keep parts together (most of the time) they are about 80% weaker than the rest of the structure and are the starting place for cracks to form? They are the weak part of any metal structure even if they are heavily reinforced. Now imagine the entire piece being like that. Sorry but 3D printing for anything requiring significant strength just makes no sense to me.","author":"5010fa077f123b1e4f00104e"},{"id":"533b285a6368720da5e90100","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/533b1e3c63687221004b0100#post_533b1e3c63687221004b0100\r\nThe Huffington post knows nothing of economics. How do I know? They're Keynesian.","author":"4fe16df67f123b13e400003f"},{"id":"533b28b66368725651ec0000","topic_id":"5161dd617f123bd25900013d","body":"\"@someguy111\":/dis/the-time-wasting-thread/post/533b269763687247b3050200#post_533b269763687247b3050200\r\nWhat about super-strength polypropylene and industrial glue?  That plastic is being looked at to replace metal in cars, and there's glues that are so strong that only a couple drops can hold entire cars up by a single point.  The reason why those glues aren't used except by certain companies is that let's say you accidentally grab one of those plastics and the glue is on it, you're unquestionably fucked.  Plastics and glue can be used with 3d printers.","author":"38b55cdf63616403d7560600"},{"id":"533b2b6e6368723d04070000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/533b28b66368725651ec0000#post_533b28b66368725651ec0000\r\nPolypropylene may be strong but it would be awful for use in something like an engine. Keep it mind it's basically plastic and plastic does not mix with heat which an engine makes a lot of. As far as plastic body panels, yeah that would be a good idea as there would be no rust and the paint could literally be part of the body which means scratches and chips in the paint would not happen. Actually Saturn did that with their cars a while back; almost every panel on the car was plastic and it was dent proof, rust proof, and scratch/chip proof.\r\n\r\nAs far as the use of glue, Lotus already uses an extremely strong epoxy in the Elise to bond the aluminum chassis parts together because it cuts down on the weight. Even so I would not trust glue all that much as glue can be susceptible to things like heat and contaminates that would weaken it. ","author":"5010fa077f123b1e4f00104e"},{"id":"533b2c186368726266150200","topic_id":"5161dd617f123bd25900013d","body":"\"@someguy111\":/dis/the-time-wasting-thread/post/533b2b6e6368723d04070000#post_533b2b6e6368723d04070000\r\nSo basically everything, but the engine could be replaced.","author":"38b55cdf63616403d7560600"},{"id":"533b2dc963687254c09d0000","topic_id":"5161dd617f123bd25900013d","body":"No, there is also the transmission, the differential, the radiator, the brakes, the exhaust system, and the turbo/supercharger if the car has it. plus there are pats that must be metal as they must conduct electricity. I have never heard of a plastic battery or plastic wiring or a plastic alternator. \r\n","author":"5010fa077f123b1e4f00104e"}]}