{"topics":[{"id":"53e329ef6368726be9c20000","topic_id":"5161dd617f123bd25900013d","body":"\"@mariomarc\":/dis/the-time-wasting-thread/post/53e328ba6368721a41710100#post_53e328ba6368721a41710100\r\nIn my personal opinion, it's my favorite Aerosmith song. And it's not because of SRIV.","author":"513e68eda4c72d4e3b000164"},{"id":"53e32a536368721eb66e0000","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/53e329e66368726be9bf0000#post_53e329e66368726be9bf0000\r\nThat makes you my favorite kind of person\r\nI will cuddle you all the time","author":"4fe3df367f123b517900066a"},{"id":"53e32ad963687248555e0000","topic_id":"5161dd617f123bd25900013d","body":"\"@trashboat\":/dis/the-time-wasting-thread/post/53e329e06368725c9bbc0100#post_53e329e06368725c9bbc0100\r\nDoes King Joe often kill his opponents the boring way? I mean, it's kinda anticlimactic.","author":"513e68eda4c72d4e3b000164"},{"id":"53e32afc636872250f720000","topic_id":"5161dd617f123bd25900013d","body":"i wish i was more affective towards online people.\r\n\r\nhigh school shaped me into a cold cynical and distant person","author":"5154c5237f123bcd580002fc"},{"id":"53e32c546368722e0f860000","topic_id":"5161dd617f123bd25900013d","body":"welp ill just go to sleep then.","author":"5154c5237f123bcd580002fc"},{"id":"53e32c8a6368721b42190100","topic_id":"5161dd617f123bd25900013d","body":"I suppose I will try\r\nGood night","author":"4fe3df367f123b517900066a"},{"id":"53e32d016368722dfb900000","topic_id":"5161dd617f123bd25900013d","body":"I guess I'm off too.","author":"513e68eda4c72d4e3b000164"},{"id":"53e32d3d636872489a7f0000","topic_id":"5161dd617f123bd25900013d","body":"And I am back, from the movies!\r\n\r\n\r\n...oh flesh meat. \r\nHmh, is sleeping. Well, maybe tomorrow.\r\n\r\nSweet dream everyoneee, and don't let Freddy to catch you~","author":"5239db6da4c72d22d9000358"},{"id":"53e32e4d63687204984c0100","topic_id":"5161dd617f123bd25900013d","body":"!https://static1.e621.net/data/9d/cb/9dcb484c04543ca68e0ad819e5f7172a.jpg!","author":"5154c5237f123bcd580002fc"},{"id":"53e32e966368722dfb050100","topic_id":"5161dd617f123bd25900013d","body":"Oh god. These dark souls videos.\r\nI want it so badly.\r\n\r\nAs some of you may or may not know I tend to obsess over things for a duration","author":"4fe16df67f123b13e400003f"},{"id":"53e3319d6368722db7740100","topic_id":"5161dd617f123bd25900013d","body":"I randomly woke up in the middle of the night, but before I go back to bed I had a random ass thought out of nowhere: conservatives' fear of society changing to the extent that it's no longer recognizable is actually kind of justifiable.\r\n\r\nWhat I mean by this is that when you get right down to it a large tenant of conservatism is wanting to make sure things don't change.\r\n\r\nThe last couple of decades things have changed at a rapid rate socially to a massive rate unseen before and it's kind of understandable why people freak the fuck out cause the world they are in now is completely and totally different from the world they grew up in.  The world we live in right now will be totally and completely different from the world we'll be in fifty years from now.  Don't forget how almost everything eventually gets disproved to some extent or our understanding of which is completely different from our understanding of when we were children.\r\n\r\nTo use a science analogy twenty years ago it was a \"proven fact\" that our solar system was the only solar system with planets and now it's now believed that almost every star has at least a couple planets.\r\n\r\nThe things that are right will be eventually found out to be only partially true.  Like how countries that aren't communist have a higher standard of living, but free capitalist countries with no regulations at all are massively unstable and/or have a extremely large gap between the poor and rich and how the countries with hybrid economic practices rather than pure ones are the best off.\r\n\r\n\r\n\r\nTo use a analogy right now the amount of war in the world vs during the cold war era is massively the fuck down.  Right now there's only 10 wars going on, keep in mind the difference between a war and a conflict is death count and how if the death count is under 1k it's considered a conflict instead, half of the current wars going on are calming down and while they will continue as a conflict for a long time chances are they will no longer be wars in practice and instead be conflicts.   In fifty years from now if the trend continues war will be thought of as \"that dumb thing stupid primitives believe in\" and holy shit are we all going to look like idiots to our grandkids.","author":"38b55cdf63616403d7560600"},{"id":"53e333266368721af98d0000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/53e3319d6368722db7740100#post_53e3319d6368722db7740100\r\nA large tenenat of conservatism is more appropriately described as preserving stability and tradition.\r\n\r\nSaying they dont want things to change is a pejorative of that.\r\n\r\nBut I think you're right. But there is something to be said for the argument that societal declines can be masked by technological advances and better trade.\r\n\r\nWho knows. Our economy is based on debt at this and that can always do us in.\r\n\r\nIn other news, if the leader of the French Nationalist Party ran for President in France (I think that is the position), she would win","author":"4fe16df67f123b13e400003f"},{"id":"53e3478e6368726e7e570100","topic_id":"5161dd617f123bd25900013d","body":"i had a self hatred dream\r\n\r\nnow i woke up in the middle of the night feeling like shit.","author":"5154c5237f123bcd580002fc"},{"id":"53e36f0f6368720522000100","topic_id":"5161dd617f123bd25900013d","body":"Good morning","author":"5239db6da4c72d22d9000358"},{"id":"53e3786d6368727353a20100","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/53e3319d6368722db7740100#post_53e3319d6368722db7740100\r\n\r\n\"@Whatevs\":/dis/the-time-wasting-thread/post/53e333266368721af98d0000#post_53e333266368721af98d0000\r\nThere's always gonna be conflict, it's part of human nature to have opposing ideals and principles. The thing is a lot of 'em are too soft now to even pick up a weapon and defend their beliefs. Everyone's just really accepting now and even if they aren't they still don't have the guts to anything drastic. That's mostly seen in the first world at least. While I respect their opinions and beliefs, I for one will gladly fight and die for my sovereign country to remain a sovereign country.\r\n\r\nUnrelated:\r\nShould I start wearing an eyepatch? ","author":"52f0834d63687261cba90300"},{"id":"53e389a56368723e6ad70200","topic_id":"5161dd617f123bd25900013d","body":"\"@twistedmetalero\":/dis/the-time-wasting-thread/post/53e32e4d63687204984c0100#post_53e32e4d63687204984c0100\r\nHnnnrgh! I need this creature in my life!  ","author":"500b587e7f123b1f230014a9"},{"id":"53e3900563687252512d0200","topic_id":"5161dd617f123bd25900013d","body":"\"@Albus Fahrenheits\":/dis/the-time-wasting-thread/post/53e3786d6368727353a20100#post_53e3786d6368727353a20100\r\nI know; what I mean by this is that is if the trends that have been going on hold out the chances of first world countries or even second world countries going to war with each other will be so low that war won't be thought of a necessity rather \"that shit that third world countries drag us into\".\r\n\r\nSince the fall of the soviet union the total number of wars in the world has drastically reduced, don't quote me but I think the number of wars in the world has reduced by 80%(it's been a while since I've read on this topic), and the world over all is more peaceful with the exception of the middle east.\r\n\r\nIf this holds out in fifty years the entire world is going to be going, \"God damn it!  Another war in the middle east?  Double damn it; now they're asking for help.\"\r\n\r\nEven countries that have traditionally had long histories of violence are starting to calm down finally.  I could go into a long explanation, but I need to go take a shower so I'll summarize: the reason why there's less wars in the world is that as countries develop and the population's standard of living increased the countries become more economically stable and less likely there is to be a war in the country with the country more likely to solve something diplomatically and the people the people more likely to solve it through cultural and even political changes.  The exception to this is the middle east.\r\n\r\nTo use a analogy in Hong Kong recently there was a protest about how China rejected their desire to become more democratic; while the chinese police did look at them with disdain and gave them the evil eye they didn't run over protesters with tanks.  25 years ago protesting would have gotten you ran over with a tank.  On the other hand protesters is what caused Assad to crack open the military and begin firing on civilians.","author":"38b55cdf63616403d7560600"},{"id":"53e396da63687274aa3a0200","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/53e3900563687252512d0200#post_53e3900563687252512d0200\r\nThat's probably because most first world countries engage in war for economic reasons like oil. Then there are those who fight because of oppression, for freedom, or for their beliefs which, in my book, is a much nobler cause. ","author":"52f0834d63687261cba90300"},{"id":"53e3abef6368722113200200","topic_id":"5161dd617f123bd25900013d","body":"I very rarely dream","author":"4fe3df367f123b517900066a"},{"id":"53e3ad8d63687240ef330000","topic_id":"5161dd617f123bd25900013d","body":"\"@mariomarc\":/dis/the-time-wasting-thread/post/53e3abef6368722113200200#post_53e3abef6368722113200200\r\nEveryone dreams. You probably don't remember any dreams.\r\n\r\nor do you mean you don't have an ambition in life?","author":"52f0834d63687261cba90300"},{"id":"53e3adce6368726d871a0000","topic_id":"5161dd617f123bd25900013d","body":"The former","author":"4fe3df367f123b517900066a"},{"id":"53e3aed863687236dd900000","topic_id":"5161dd617f123bd25900013d","body":"\"@mariomarc\":/dis/the-time-wasting-thread/post/53e3adce6368726d871a0000#post_53e3adce6368726d871a0000\r\n\r\nDo you have nightmares?","author":"5239db6da4c72d22d9000358"},{"id":"53e3af3363687233d9a50100","topic_id":"5161dd617f123bd25900013d","body":"Not that I recall\r\nDont think","author":"4fe3df367f123b517900066a"},{"id":"53e3afc763687254ed300100","topic_id":"5161dd617f123bd25900013d","body":"\"@mariomarc\":/dis/the-time-wasting-thread/post/53e3af3363687233d9a50100#post_53e3af3363687233d9a50100\r\n\r\nOh by the way, Hi I'm the ultimate lifeform, nice to meet you c:","author":"5239db6da4c72d22d9000358"},{"id":"53e3b0536368722462290000","topic_id":"5161dd617f123bd25900013d","body":"Hi hi","author":"4fe3df367f123b517900066a"}]}