{"topics":[{"id":"53e3e9ab636872526e650000","topic_id":"5161dd617f123bd25900013d","body":"Uc9, what do you think will happen to New Zealand's politics in the future?","author":"50b70eeb7f123b1a02000097"},{"id":"53e3ecb06368723dec480000","topic_id":"5161dd617f123bd25900013d","body":"\"@Randomosaur\":/dis/the-time-wasting-thread/post/53e3e9ab636872526e650000#post_53e3e9ab636872526e650000\r\nI haven't really been paying attention to New Zealand all that much lately to be honest.","author":"38b55cdf63616403d7560600"},{"id":"53e3edc463687279496f0100","topic_id":"5161dd617f123bd25900013d","body":"\"@Randomosaur\":/dis/the-time-wasting-thread/post/53e3e9ab636872526e650000#post_53e3e9ab636872526e650000\r\nFrom what I understand from my brother who lives there: left wing parties mismanaged the whole country, so the right wing party which has always been the more responsible of the two is on the rise after a longer absence but their leader is not charismatic.\r\n\r\nI would ask Ebalosus\r\n\r\nAnd the first gay couple broke up I think, I remember seeing something like that on the news","author":"4fe16df67f123b13e400003f"},{"id":"53e3ee6663687205af5e0100","topic_id":"5161dd617f123bd25900013d","body":"!http://i2.kym-cdn.com/photos/images/original/000/807/159/6cf.png!","author":"5154c5237f123bcd580002fc"},{"id":"53e3ee8f6368727912c00000","topic_id":"5161dd617f123bd25900013d","body":"Uc9, Uc9, What would you do if you get elected in office? ","author":"50c204917f123b31440000a5"},{"id":"53e3ee9d63687256424b0100","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/53e3edc463687279496f0100#post_53e3edc463687279496f0100\r\nMe and my family hate the National party. ","author":"50b70eeb7f123b1a02000097"},{"id":"53e3f103636872567f470100","topic_id":"5161dd617f123bd25900013d","body":"\"@Randomosaur\":/dis/the-time-wasting-thread/post/53e3ee9d63687256424b0100#post_53e3ee9d63687256424b0100\r\nOkay.\r\n\r\nThen you'll hate that the Swedish Democrats (right) are on the rise after the Swedish Workers Party sold out the country for more votes\r\nhttp://youtu.be/VR-lAGj_dlQ\r\n\r\nSame with France. Marine La Penn would win the presidency if she ran according to polls\r\n\r\nI can't say I know about NZ, but both of the above are positive developments for France and Sweden.","author":"4fe16df67f123b13e400003f"},{"id":"53e3f1a763687220d49a0100","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/53e3f103636872567f470100#post_53e3f103636872567f470100\r\nWell, according to my family it has ruined life for us.","author":"50b70eeb7f123b1a02000097"},{"id":"53e3f23e6368720332900000","topic_id":"5161dd617f123bd25900013d","body":"\"@Randomosaur\":/dis/the-time-wasting-thread/post/53e3f1a763687220d49a0100#post_53e3f1a763687220d49a0100\r\nWhat does the National party stand for? All I know is it is Centre-Right.\r\n\r\n","author":"4fe16df67f123b13e400003f"},{"id":"53e3f2e463687228a9be0100","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/53e3f23e6368720332900000#post_53e3f23e6368720332900000\r\nI have no idea. \r\n\r\nBasically, I just believe what my family tells me about them.","author":"50b70eeb7f123b1a02000097"},{"id":"53e3f37b63687219b0790100","topic_id":"5161dd617f123bd25900013d","body":"!https://31.media.tumblr.com/3feec801674f2bc5ecb0eb2f1a0e0c4a/tumblr_n8q61nF3q01qzazvvo2_r1_1280.png!\r\n!https://38.media.tumblr.com/be4d76e2b2e32675e6e4dc2ed0c5fc42/tumblr_n8q61nF3q01qzazvvo3_r1_1280.png!","author":"5154c5237f123bcd580002fc"},{"id":"53e3f38f63687219b0840100","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/53e3edc463687279496f0100#post_53e3edc463687279496f0100\r\nAhhh, the fuck up cycle.\r\n\r\nGovernments like that tend to fall in the what I like to call the \"fuck up cycle\" where one party gains power cause the other party fucks up then they lose power and the other party gains power cause they in turn fuck in eventually too.\r\n\r\n\r\n\"@Number1pegasus\":/dis/the-time-wasting-thread/post/53e3ee8f6368727912c00000#post_53e3ee8f6368727912c00000\r\n[bq=\"Number1pegasus\"]Uc9, Uc9, What would you do if you get elected in office? [/bq]\r\nI'm technically a technocrat; so if we're talking all powerful leader I'd restructure the entire government into two fundamental branches the military branch and the civilian sector branch.  What I mean by this is that the navy, army, marines, air force, NSA, CIA and so forth would be in the military branch.  The department of health, education, NASA, transportation would be in the civilian sector branch.  That alone would save several hundred billion dollars cause theoretically would could have the same sized military and all that if we restructured it; right now the way we handle the military budget is massively inefficient.\r\n\r\nAlso each sub-branch would have a minimum annual budget that is adjusted for inflation each year so sub-branches like education it would be illegal to cut their budget further.\r\n\r\nEach branch would have a annual budget excess that they appropriate not according to who they know or how high they are on the chain but rather any excess income would be appropriated on how much they need for that year minus their minimum annual budget versus their projects order of importance.\r\n\r\nClose all tax loopholes and have taxes be calculated by a math equation rather than how we currently do it.\r\n\r\nThese changes alone would cut budget costs annually by several hundred billion dollars alone while at the same time increasing income by several hundred billion dollars.\r\n\r\n\r\n\r\nAlso inflation isn't all that bad; what I mean by this is that runaway inflation is bad whereas rapid deflation is bad as well.  If you were to pay off the deficit in only a couple years it would tank the economy; if you were to let it go it would tank the economy as well.  Rather what I would do is slowly pay it off the next twenty to thirty years so that the economic impact would be mitigated.\r\n\r\nAlso restructure congress so that they would have a set time table in which to do certain bills.  What I mean by this is that if the budget isn't passed then no one gets their pork barrel bills seen at all.\r\n\r\nRestructure elections to where districts are adjusted in a grid pattern according to population instead.  What I mean by this is that the best way of stopping gerrymandering is to have a grid in which a district is drawn and ignores county/city lines so that areas with high population are in their own district where as low population areas have their own area so that neither party can gerrymander anymore.\r\n\r\nHave all cops at all times wearing cameras that stream to secure locations so that if there's a bad cop he knows he's on camera and that if he does something or removes the camera he knows command is going to come running.  Basically have cops for cops.\r\n\r\n\r\nRestructure our prison structure to where each state has a limit on the number of prisoners they can have and if they exceed it they can pay other states to keep their prisoners at a gouged price so as to promote states from trying to prevent rehabilitation.  What I mean by this is that right now the problem with the prison structure is that it's a business; if you remove the profit they're going to be forced to change their tune.  It would drastically promote rehabilitation in that states with low percentage of prisoners winding back up in jail would generate more profit from other states paying them to hold their prisoners whereas states that hate rehabilitating prisoners would be paying for it out their ass.\r\n\r\nI could go on.","author":"38b55cdf63616403d7560600"},{"id":"53e3f39763687256ea910000","topic_id":"5161dd617f123bd25900013d","body":"\"@Randomosaur\":/dis/the-time-wasting-thread/post/53e3f2e463687228a9be0100#post_53e3f2e463687228a9be0100\r\nThat's what most people do.\r\n\r\nI still believe the dems are dirty commies and that the damn Japs make one hell of a car!\r\n\r\nNah. But I could see the Nationals causing problems with certain neoliberal policies like what happened in Russia where they privatized national industries... Which were already monopolies at that point die to being national industries. ","author":"4fe16df67f123b13e400003f"},{"id":"53e3f43b6368722f93360000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/53e3f38f63687219b0840100#post_53e3f38f63687219b0840100\r\nCan prisoners be rehabilitated?\r\nIf not wouldn't capping the prisoners make the system for expensive since it's often cheaper to imprison than to deal with crime?","author":"4fe16df67f123b13e400003f"},{"id":"53e3f4de63687212187e0000","topic_id":"5161dd617f123bd25900013d","body":"!http://38.media.tumblr.com/2c0203f8adeb0f0cf30df992c5c9642e/tumblr_n9y5dlqhje1qglypyo1_1280.jpg!","author":"5154c5237f123bcd580002fc"},{"id":"53e3f60a6368727a5da50000","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/53e3f43b6368722f93360000#post_53e3f43b6368722f93360000\r\nThe problem with our current system is that it discourages any attempt at rehabilitation or any attempt at making sure they don't commit crimes again.\r\n\r\nAlso contrary to popular belief most criminals are petty crimes/non-violent crimes and so forth.  Capping the number of prisoners you can hold would force states to put drug addicts in rehab rather than prison.  Rehab is much cheaper than prison.  Some prisons cost hundreds of thousands of dollars a year and some even push nearly a million dollars a year.  Rehab is way the fuck cheaper.  Also it would force shorter terms for non-violent criminals.  If you forced a state to pay a couple hundred thousand to house a criminal rather than paid them a couple hundred thousand to house a criminal it would sure as hell encourage them to make sure the criminal doesn't wind back up in prison.","author":"38b55cdf63616403d7560600"},{"id":"53e3f67063687275b9500000","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/53e3f103636872567f470100#post_53e3f103636872567f470100\r\nLove the butchered finnish at 0:29 in that video","author":"5007bbdf7f123b112f00023a"},{"id":"53e3f686636872448bd60100","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/53e3f60a6368727a5da50000#post_53e3f60a6368727a5da50000\r\nI see.\r\n\r\nDoes rehab work on addicts? And why is rehab cheaper than prison? That seems counterintuitive","author":"4fe16df67f123b13e400003f"},{"id":"53e3f6c96368721c30a20000","topic_id":"5161dd617f123bd25900013d","body":"\"@PaskaNaakka\":/dis/the-time-wasting-thread/post/53e3f67063687275b9500000#post_53e3f67063687275b9500000\r\nIt's your own fault for having such a silly language.\r\n\r\nAlso what party is in power there again? It's like a Right wing party with certain left wing policies to form some kind of olive branch system?","author":"4fe16df67f123b13e400003f"},{"id":"53e3f78e6368720332700100","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/53e3f6c96368721c30a20000#post_53e3f6c96368721c30a20000\r\n\"The National Coalition Party\":http://en.wikipedia.org/wiki/National_Coalition_Party","author":"5007bbdf7f123b112f00023a"},{"id":"53e3f7d66368723aab0c0000","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/53e3f686636872448bd60100#post_53e3f686636872448bd60100\r\nSometimes rehab works; sometimes it doesn't.  Last time I checked rehab has around a 30-50% success rate, but still if it's successful 30% of the time that's a fuck ton of people no longer recommitting crimes.\r\n\r\nRehab costs 10k-30k a year; jail on the other hand costs at least 80k a year; so $80,000 - $30,000 = a savings of at least $50,000 a year.\r\n\r\nEven if the success rate of that were only at 30% it would drastically save a ton of money annually.","author":"38b55cdf63616403d7560600"},{"id":"53e3f82d6368727aa0db0000","topic_id":"5161dd617f123bd25900013d","body":"for squiggy\r\n\r\n\"dominos pizza feat hatsune miku\":https://www.youtube.com/watch?v=gW2D_Votd2Y","author":"5154c5237f123bcd580002fc"},{"id":"53e3f8ce6368721dac4c0000","topic_id":"5161dd617f123bd25900013d","body":"\"@PaskaNaakka\":/dis/the-time-wasting-thread/post/53e3f78e6368720332700100#post_53e3f78e6368720332700100\r\nThought so.\r\n\r\n\r\n\"@uc9\":/dis/the-time-wasting-thread/post/53e3f7d66368723aab0c0000#post_53e3f7d66368723aab0c0000\r\nI'm very surprised by Prison's cost.\r\n\r\nHmm, I think there's some silliness going on here.\r\nLike in Cali, many of the arguments against the death penalty are that it costs too much (true), however it was these same people that inflated the cost in many cases.\r\nSo it's not that simple, unlike how they like to put it.\r\n\r\nBut 30% is rather high. Good idea for the addicts.","author":"4fe16df67f123b13e400003f"},{"id":"53e3f9486368721c0af40000","topic_id":"5161dd617f123bd25900013d","body":"*Looks out the window*\r\n\r\nKing Joe's still standing there.","author":"5062d6f17f123b3e16001184"},{"id":"53e3fa0763687275b9f70000","topic_id":"5161dd617f123bd25900013d","body":"Will lava boats ever be invented?","author":"50b70eeb7f123b1a02000097"}]}