{"topics":[{"id":"53e3fa696368726d46900100","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/53e3f8ce6368721dac4c0000#post_53e3f8ce6368721dac4c0000\r\nHere's something surprising; the biggest factor effecting crime though is . . . drum roll please. *drumroll.sfx* The economic standing of the individual.  What I mean by this is that the higher the economic standing of a individual the more likely they are to commit non-violent crimes and more likely they are to commit crimes like identity theft or some such.  In other words it's far less likely for a millionaire to rob a gas station at gunpoint.\r\n\r\nIn other words for all sides if you want to reduce violent crimes theoretically your best shot at this would be promote higher living standards through economic means.","author":"38b55cdf63616403d7560600"},{"id":"53e3fabf636872691de50000","topic_id":"5161dd617f123bd25900013d","body":"\"you just got breaded\":https://www.youtube.com/watch?v=6ai2c5vZGOs","author":"5154c5237f123bcd580002fc"},{"id":"53e3fb356368722a6d0a0000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/53e3fa696368726d46900100#\r\nWhich is not anyone disagrees with. Some ways largely work (more opportunity) other largely do not (subsidy and redistribution).\r\n\r\nThat's the issue. It's not caring versus not caring","author":"4fe16df67f123b13e400003f"},{"id":"53e3fc1c6368721c0a9b0100","topic_id":"5161dd617f123bd25900013d","body":"I'm also more sympathetic to this view.\r\nI think it explains more.\r\n\r\nhttp://www.heritage.org/research/reports/1995/03/bg1026nbsp-the-real-root-causes-of-violent-crime\r\n\r\n\r\nPetty theft is naturally an economic thing","author":"4fe16df67f123b13e400003f"},{"id":"53e3fe256368722a26840000","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/53e3fb356368722a6d0a0000#post_53e3fb356368722a6d0a0000\r\nEh; I kind of agree and kind of disagree.\r\n\r\nI like capitalism because capitalist countries have higher standard of living, but on the other hand letting the economy just go without any regulation or oversight is a bad idea cause reckless speculation causes economic busts.\r\n\r\nWhat I mean by this is that yes capitalism is good, but not for every industry and not 100% of the time.  Sometimes you do need oversight and sometimes you do need to use subsidies.  *SOMETIMES*  What I mean by this is for a company that is a nuclear energy company they need some huge fucking regulations cause the last time the USA was lack with safety regulation three mile island happened.  Other times lax oversight is good.  It's really on a case by case basis of what is the industry and whether or not they are economically unstable.  Economically unstable sectors and sectors that have very real dangers to human risk need far more regulation in general.\r\n\r\nSometimes subsidies and bail outs are good and sometime they're bad.  The wall street bail out made me rage cause yes they needed a bail out, but they didn't need that hundred billion dollars; they only needed a couple hundred million dollars; there's a massive difference between a hundred billion dollars and a hundred million dollars.  You should have heard how many profanities I said when I found out they were getting a hundred billion dollars.  If I had a swear jar I could have bought a new car.  A example of a good subsidy is solar roadways; right now the company developing this has received subsidies to help the company with their research and thanks to the research being done chances are we'll have a cheap energy source in the next decade.  A example of a bad subsidy is when a monopoly receives a subsidy.","author":"38b55cdf63616403d7560600"},{"id":"53e3ff2c6368720a5a6a0100","topic_id":"5161dd617f123bd25900013d","body":"Guess I'll have to try to take him down.\r\n\r\n*Puts on the Ultra eye*\r\n\r\nDUWA!\r\n\r\n*Becomes Ultra seven*","author":"5062d6f17f123b3e16001184"},{"id":"53e4014a63687241e6cf0000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/53e3fe256368722a26840000#post_53e3fe256368722a26840000\r\nI have to disagree, but largely I think the issue is misframed.\r\n\r\nIceland did not bail out its banks. Iceland is doing well now.\r\nWhich is why Matt Damon's documentary was dumb, but well intentioned.\r\n\r\nIceland did what the market said: let them fail.\r\n\r\nUltimately the short term disruption was better than long term cronyism.\r\n\r\nThe US is actually not a particularly capitalist country. Corporatism is more common.\r\n\r\nAs for energy subsidies, Solyndra has been enough of a boondoggle to be cautious about them.\r\n\r\nBut what I am getting at is many of the societal ills ascribed to capitalism are not remotely capitalist in nature beyond involving some company.\r\n\r\nNearly every economic bubble and bust was caused by the government altering the money supply making speculation artificially profitable.\r\n\r\nAnd while market failures have occurred in the past, using the recession from the roaring twenties that predated the Depression, the economy bounced back quickly.\r\nNew research, on the other hand, shows that the New Deal probably made the Depression last longer\r\n http://mises.org/freemarket_detail.aspx?control=515\r\n^ they have other articles on the subject.\r\n\r\nUltimately, I take a socialist approach on issues the government is already involved in. As socialism does make economic sense at times. For example, I would prefer a completely socialist healthcare system to either the old US system or Obamacare. And it can make moral sense","author":"4fe16df67f123b13e400003f"},{"id":"53e4046e636872402bb50100","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/53e4014a63687241e6cf0000#post_53e4014a63687241e6cf0000\r\n*look at clock\r\nOh crap; I'm late.\r\n\r\nI'll make it short: I agree partially.  Also I totally agree on the corporatism part.\r\n\r\nThe problem with the USA right now and why the not having any bail would have been bad is that the banks have the USA at metaphorical gunpoint.  Also as for bail outs effects on economic recoveries, partially agree; if the bail out wasn't so large the economy would have recovered faster because all that money didn't go to the economy it just got pocketed instead.  My problem with the bail out was of how much it was for.  If they were given just what they actually needed then it would have been fine, but all that money instead got pocketed.  It's like giving a kid a cake before dinner to try to make them eat dinner; they're just going to eat the cake and want more cake instead of eating diner.  To use a analogy I would have just gave them some bananas with their dinner instead.  The problem with banks right now is that they're spoiled.  If they throw enough of a fit they'll get a cake instead of getting a healthy dinner.\r\n\r\n\r\nAs for socialism; yeah socialism is often good in some sectors but not in others.  With health care I totally agree.","author":"38b55cdf63616403d7560600"},{"id":"53e4056e63687245a9910000","topic_id":"5161dd617f123bd25900013d","body":"Why don't Greenland and Antarctica get along?\r\n\r\nBecause they're polar opposites of each other.","author":"50b70eeb7f123b1a02000097"},{"id":"53e40b30636872603ccd0000","topic_id":"5161dd617f123bd25900013d","body":"HOLY SHIIIIT, ANDY UPDATED HIS PAGE\r\n","author":"5154c5237f123bcd580002fc"},{"id":"53e40b496368725ffcc10000","topic_id":"5161dd617f123bd25900013d","body":"\"@Randomosaur\":/dis/the-time-wasting-thread/post/53e4056e63687245a9910000#post_53e4056e63687245a9910000\r\nThis might be relevant to you interests. They're from Fallout.\r\n!http://img3.wikia.nocookie.net/__cb20110511012723/fallout/images/thumb/e/e6/Enclave_deathclaw.png/500px-Enclave_deathclaw.png!\r\n!http://images3.wikia.nocookie.net/__cb20110511010936/fallout/images/thumb/f/fe/Deathclawmother.png/497px-Deathclawmother.png!\r\n!http://4.bp.blogspot.com/-EYTCEcgI6_A/TkYYsQknaXI/AAAAAAAAAGs/eb28uQ8hXY4/s1600/Deathclaw.png!\r\n\r\nThey're called Deathclaws. Bioengineered mutant Jackson's chameleons mixed with the DNA of various other species.\r\nThe deathclaws were originally created before the Great War by the government to replace humans during close-combat search-and-destroy missions. They were derived from mixed animal stock and then refined by the Master, using genetic manipulation. The resulting creature is almost unbelievably fast and powerful.","author":"52f0834d63687261cba90300"},{"id":"53e40e2d6368723457820000","topic_id":"5161dd617f123bd25900013d","body":"!http://i.4cdn.org/mu/1407454409154.jpg!\r\n!http://i.4cdn.org/mu/1407454471227.jpg!","author":"5154c5237f123bcd580002fc"},{"id":"53e40f966368722899960100","topic_id":"5161dd617f123bd25900013d","body":"\"@Randomosaur\":/dis/the-time-wasting-thread/post/53e4056e63687245a9910000#post_53e4056e63687245a9910000\r\n[bq=\"Randomosaur\"]Why don't Greenland and Antarctica get along?\r\n\r\nBecause they're polar opposites of each other.[/bq]\r\nI have a challenge for the thread; fit as many bad puns as humanly possible into a single paragraph as humanly possible.","author":"38b55cdf63616403d7560600"},{"id":"53e421366368725d315c0100","topic_id":"5161dd617f123bd25900013d","body":"\"@Albus Fahrenheits\":/dis/the-time-wasting-thread/post/53e40b496368725ffcc10000#post_53e40b496368725ffcc10000\r\nCool idea, but pretty implausible execution. ","author":"50b70eeb7f123b1a02000097"},{"id":"53e421d86368725976630000","topic_id":"5161dd617f123bd25900013d","body":"\"@Randomosaur\":/dis/the-time-wasting-thread/post/53e421366368725d315c0100#post_53e421366368725d315c0100\r\nPretty much everything in Fallout is implausible.","author":"38b55cdf63616403d7560600"},{"id":"53e4225363687259176c0000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/53e421d86368725976630000#post_53e421d86368725976630000\r\nPretty much everything in fiction is implausible. Entirely plausible fiction would be dull.","author":"4f41ee04945b701c41002af7"},{"id":"53e4236663687259ba7e0000","topic_id":"5161dd617f123bd25900013d","body":"\"@Randomosaur\":/dis/the-time-wasting-thread/post/53e421366368725d315c0100#post_53e421366368725d315c0100\r\nYou should see the centaurs. And no, they don't look like what you think they look.\r\n","author":"52f0834d63687261cba90300"},{"id":"53e424256368725936e30000","topic_id":"5161dd617f123bd25900013d","body":"ok first things first, i am the realest","author":"5154c5237f123bcd580002fc"},{"id":"53e424f26368720f20740100","topic_id":"5161dd617f123bd25900013d","body":"\"@gasmaskangel\":/dis/the-time-wasting-thread/post/53e4225363687259176c0000#post_53e4225363687259176c0000\r\nHow are fictional works like _Sharknado_ implausible?","author":"50b70eeb7f123b1a02000097"},{"id":"53e425076368724cc83b0000","topic_id":"5161dd617f123bd25900013d","body":"just shaved","author":"4fe3df367f123b517900066a"},{"id":"53e425bd636872594d7a0100","topic_id":"5161dd617f123bd25900013d","body":"\"@Randomosaur\":/dis/the-time-wasting-thread/post/53e424f26368720f20740100#post_53e424f26368720f20740100\r\nI'm going to assume you're joking and give a more general answer.\r\n\r\nEven works set entirely in the real world with absolutely no fantastical elements rely on a certain amount of implausible coincidence, action and motivation. Note that implausible is not the same as impossible.","author":"4f41ee04945b701c41002af7"},{"id":"53e425c463687235128e0000","topic_id":"5161dd617f123bd25900013d","body":"\"@gasmaskangel\":/dis/the-time-wasting-thread/post/53e4225363687259176c0000#post_53e4225363687259176c0000\r\nFiction is duller than reality in some cases.","author":"5007bbdf7f123b112f00023a"},{"id":"53e426966368725a0d330100","topic_id":"5161dd617f123bd25900013d","body":"\"Fundie quote for GMA.\":http://www.fstdt.com/QuoteComment.aspx?QID=10083&Page=1 ","author":"50b70eeb7f123b1a02000097"},{"id":"53e4274f6368725a0d4a0100","topic_id":"5161dd617f123bd25900013d","body":"\"@Randomosaur\":/dis/the-time-wasting-thread/post/53e426966368725a0d330100#post_53e426966368725a0d330100\r\nThe fuck?","author":"4f41ee04945b701c41002af7"},{"id":"53e427ca63687233fc0b0000","topic_id":"5161dd617f123bd25900013d","body":"\"@gasmaskangel\":/dis/the-time-wasting-thread/post/53e4274f6368725a0d4a0100#post_53e4274f6368725a0d4a0100\r\nAlmost as crazy as the mother who said that Earth was the only planet with gravity, and that all planets were suspended in mid-air.","author":"50b70eeb7f123b1a02000097"}]}