{"topics":[{"id":"53e69f7e63687246e2950000","topic_id":"5161dd617f123bd25900013d","body":"Spike was only nine years old. He loved SquiggyBomb so much. He had all the merchandise and movies.\r\n\r\nHe prayed every night to SquiggyBomb. \"SquiggyBomb is love.\", he said. \"SquiggyBomb is life.\".\r\n\r\nTwilight Sparkle overheard him and called him a faggot. But Spike knew she was just jealous of his devotion to SquiggyBomb. He called her a cunt.\r\n\r\nTwilight slapped him and told him to go to sleep. \r\n\r\nSpike was lying on his bed crying. His face hurt. Suddenly, he felt a warmth approaching him. He felt something touch him. It was SquiggyBomb.\r\n\r\nSquiggyBomb grabbed Spike and put him on his hands and knees. Spike spread his asscheeks for Squiggy. Squiggy penetrated Spike's butthole. It hurt so much but he did it for Squiggy. He could feel his butt tearing as his eyes started to water.\r\n\r\nSpike pushed against his force. He wanted to please SquiggyBomb. SquiggyBomb roared a mighty roar as he filled Spike's butt with his love.\r\n\r\nTwilight Sparkle walked in, and looked at the coitus in shock. She stood there, motionless. SquiggyBomb looked her in the eye and said \"It's all over now.\". SquiggyBomb left through the window.\r\n\r\nSquiggyBomb is love. SquiggyBomb is life.","author":"50b70eeb7f123b1a02000097"},{"id":"53e6a24763687271fa160100","topic_id":"5161dd617f123bd25900013d","body":"\"@Randomosaur\":/dis/the-time-wasting-thread/post/53e69f7e63687246e2950000#post_53e69f7e63687246e2950000\r\n10/10 fapped hard","author":"5007bbdf7f123b112f00023a"},{"id":"53e6a26663687215e3870000","topic_id":"5161dd617f123bd25900013d","body":"\"@Randomosaur\":/dis/the-time-wasting-thread/post/53e69f7e63687246e2950000#post_53e69f7e63687246e2950000\r\n\"@PaskaNaakka\":/dis/the-time-wasting-thread/post/53e6a24763687271fa160100#post_53e6a24763687271fa160100\r\nI'm seeing doubles.","author":"4fde5cee945b700a970060fc"},{"id":"53e6a3b163687206bd640000","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/53e6a26663687215e3870000#post_53e6a26663687215e3870000\r\nStop using drugs then.","author":"5007bbdf7f123b112f00023a"},{"id":"53e6a4516368723c625f0100","topic_id":"5161dd617f123bd25900013d","body":"\"@PaskaNaakka\":/dis/the-time-wasting-thread/post/53e6a3b163687206bd640000#post_53e6a3b163687206bd640000\r\nNo, you.","author":"4fde5cee945b700a970060fc"},{"id":"53e6a4d463687267d70a0000","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/53e6a4516368723c625f0100#post_53e6a4516368723c625f0100\r\nNever. I couldn't live without my morning meth.","author":"5007bbdf7f123b112f00023a"},{"id":"53e6a59f636872576e3b0100","topic_id":"5161dd617f123bd25900013d","body":"\"@PaskaNaakka\":/dis/the-time-wasting-thread/post/53e6a4d463687267d70a0000#post_53e6a4d463687267d70a0000\r\nMe neither.\r\n!http://upload.wikimedia.org/wikipedia/commons/b/bf/Tarbosaurus_skull.jpg!","author":"50b70eeb7f123b1a02000097"},{"id":"53e6a65a6368725eca280000","topic_id":"5161dd617f123bd25900013d","body":"\"@PaskaNaakka\":/dis/the-time-wasting-thread/post/53e6a4d463687267d70a0000#post_53e6a4d463687267d70a0000\r\n\r\nBut that is \"...\":https://www.youtube.com/watch?v=rmQFcVR6vEs","author":"4fde5cee945b700a970060fc"},{"id":"53e6a8e163687274fc550000","topic_id":"5161dd617f123bd25900013d","body":". . . God damn it. . .\r\n\r\nI was up all night working on a C++ project trying to get as much as I could done that way even the laziest of fuckers would be like, \"Oh hey, you serious that all I have to do is this one part that <uc9's real name> needs help with?  Shit; easy A+ bitches.\" and they still haven't touched it.\r\n\r\nSeriously. . just fucking seriously. .","author":"38b55cdf63616403d7560600"},{"id":"53e6a9316368722de7810000","topic_id":"5161dd617f123bd25900013d","body":"My house is as big a King Kai's planet","author":"4fdfbf92945b7075d50036e4"},{"id":"53e6a9496368723becbe0000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/53e6a8e163687274fc550000#post_53e6a8e163687274fc550000\r\nare you sure you didn't sign up for a warped behavioral experiment?","author":"4fe16df67f123b13e400003f"},{"id":"53e6b6606368723441370000","topic_id":"5161dd617f123bd25900013d","body":"Dr. Randomosaur will see you now.","author":"50b70eeb7f123b1a02000097"},{"id":"53e6b69b63687231857f0000","topic_id":"5161dd617f123bd25900013d","body":"\"@Randomosaur\":/dis/the-time-wasting-thread/post/53e6b6606368723441370000#post_53e6b6606368723441370000\r\nDr, I seem to be growing new eyes all over my torso.","author":"4f41ee04945b701c41002af7"},{"id":"53e6b6b66368724a60500000","topic_id":"5161dd617f123bd25900013d","body":"Well fuck me; they're not even responding to me trying to contact them.","author":"38b55cdf63616403d7560600"},{"id":"53e6b773636872406d450100","topic_id":"5161dd617f123bd25900013d","body":"\"@gasmaskangel\":/dis/the-time-wasting-thread/post/53e6b69b63687231857f0000#post_53e6b69b63687231857f0000\r\n*Gets out a chainsaw*\r\nJust sit still.","author":"50b70eeb7f123b1a02000097"},{"id":"53e6b95f6368722fe90f0000","topic_id":"5161dd617f123bd25900013d","body":"You know something interesting? Equestria Royal guards and regular guard seem more like Japan's self defense force, its not actually a military, more like something to protect the borders from attack and so forth, does this mean Equestria's pretty lax in its development, or are they just complacent? ","author":"5046d66d7f123b38980018c6"},{"id":"53e6ba066368727df9930000","topic_id":"5161dd617f123bd25900013d","body":"\"@Evident Disaster\":/dis/the-time-wasting-thread/post/53e6b95f6368722fe90f0000#post_53e6b95f6368722fe90f0000\r\n\r\nConsidering that by the time Celestia got into power most of the bad guys had already been dealt with, I can assume it came as both.\r\n\r\nThey biggest evil things are found outside the towns and those who don't avoid them, know what they're into if they go inside.\r\n\r\nOn the other side, Celestia doesn't seem to be the kind who would just lash out on someone.","author":"4fdfbf92945b7075d50036e4"},{"id":"53e6bb1063687240e43c0000","topic_id":"5161dd617f123bd25900013d","body":"Yeah but it kind of makes me wonder, if the MLP world was something like ours, and there were belligerent nations in their world, wouldn't this be a bad idea long term wise? I mean eventually something might happen which would put the general population of Equestria in danger, and if that happens I'm not sure Celestia would directly intervene, a war between mortals has no reason to involve her or her sister, unless Luna's more of a pragmatist which I can maybe see. \r\nHowever there's this nagging feeling that in any case or situation, if its anything like the 1920s - 1930s, this might not end well for Equestria in its future. Maybe... its a hypothesis that not everything is sunshine and rainbows. \r\n\r\nAlso you're right Celestia wouldn't be the one to lash out, she also doesn't seem like the one to openly kill/harm others unless absolutely necessary. Which would mean this would be left to the Royal Guard or her errand girls. ","author":"5046d66d7f123b38980018c6"},{"id":"53e6bd066368723185740100","topic_id":"5161dd617f123bd25900013d","body":"\"@Evident Disaster\":/dis/the-time-wasting-thread/post/53e6bb1063687240e43c0000#post_53e6bb1063687240e43c0000\r\n\r\nGotta hand it to them. They make diplomacy something that really works as a solution rather than just a protocol or temporal solution.\r\n\r\nIf such nations began to form, my guess is it would only make those that aren't to unite and make sure they don't get out of hand. And even if they eventually get out of control, the sole existance of magic makes things to get solved without major issues.","author":"4fdfbf92945b7075d50036e4"},{"id":"53e6bf6c636872450cf20000","topic_id":"5161dd617f123bd25900013d","body":"Maybe, that is assuming magic is predominant in most of these nations and that magic users are anywhere near Twilight's level of power, from what we've seen in show the most that many unicorns can do with their level of magic is their skill set, passed possibly down hereditary lines. \r\n\r\nTwilight's family is probably one of the few which has more latent magic users, since she and her brother are both very powerful, though Shining's is more defensive in nature. It can be overwhelmed with enough force, Changeling's showed that, its not unlikely that Twilight's got a limit to how much she can possibly use as well. \r\n\r\nThat said, there's a limit to what extent magic can be useful for, and if there are much more non-magic entities which had to develop more physical means in order to survive and develop, there's a high chance they're a lot more better armed and equipped. \r\n\r\nIn the long term outlook, magic users have their place in society, but you can't honestly expect them to win against sheer numbers and overwhelming amounts of force. And well there's a high chance that magic users are also limited by hereditary lines, most unicorns are like Rarity and so forth since they can't use their magic to such extents. ","author":"5046d66d7f123b38980018c6"},{"id":"53e6c30163687257da520100","topic_id":"5161dd617f123bd25900013d","body":"\"@Evident Disaster\":/dis/the-time-wasting-thread/post/53e6bb1063687240e43c0000#post_53e6bb1063687240e43c0000\r\n\r\nYou know, I keep wondering if Equestria has a nemesis rival power, like what the USSR was to the US.","author":"4fde5cee945b700a970060fc"},{"id":"53e6c3c7636872734c100100","topic_id":"5161dd617f123bd25900013d","body":"As if any nation could stand up to an army of heart attack-inducingly adorable ponies.","author":"5007bbdf7f123b112f00023a"},{"id":"53e6c4bc636872328f1b0100","topic_id":"5161dd617f123bd25900013d","body":"Griffons maybe? They've been kind of the non-canon version of the USSR in some people's arts and stories. It would work, since they're predatory like and they're a race which doesn't have access to magic, but can fly and so forth. That'd work. ","author":"5046d66d7f123b38980018c6"},{"id":"53e6c4c76368720c770b0100","topic_id":"5161dd617f123bd25900013d","body":"Okay; reading up a bit on my nightly cool science shit news and here's a short tidbit:\r\nCyborgs are coming sooner rather than later, but not in the way we traditionally imagine them.\r\n\r\nWhat I mean by this is that artificial organs still have quite a while to go.  Aesthetic cyborg parts are probably going to come about within the decade.  What I mean by this is that is let's say you wanted to be a real life furry/wanted to look like a completely different person/whatever or something along those lines; that shit is coming sooner rather than later.  What isn't coming soon is replacements for organs.  You'll be able to replace your arms, legs, skin, face and a ton of stuff, but you won't be able to get replacement organs for a up to 20 years from now.  Why?  Cause that shit's harder to do than you think.  You'll be able to replace your bones, skin, legs, arms, face and a ton of stuff but you'll still need your biological heart and such cause the stuff we have right now just would not cut it and if it failed would run the risk of you dying.  A pacemaker failing is bad.  If your legs and arms failed you would just be stuck unable to move.\r\n\r\nWhy this is still good:\r\nA fuck ton of diseases would be much harder to transmit.  Things like stds and HIV or such would be wiped off the face of the earth.  The only thing you'd really have to continue to worry about is airborne pathogens and blood borne pathogens.","author":"38b55cdf63616403d7560600"},{"id":"53e6c7b46368723a36300100","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/53e6c4c76368720c770b0100#post_53e6c4c76368720c770b0100\r\nAs long as I can have bionic kitty ears and a robooty, I'm cool. ","author":"500b587e7f123b1f230014a9"}]}