{"topics":[{"id":"533ce8fa636872764ac10200","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/533ce66063687235c59e0000#post_533ce66063687235c59e0000\r\nI'm addicted to coffee cream. I drink it straight.","author":"5010fa077f123b1e4f00104e"},{"id":"533cf18763687209814d0100","topic_id":"5161dd617f123bd25900013d","body":"Fuck Yeah!\r\n!http://kattheacrobat.files.wordpress.com/2009/01/6a00d4142829d33c7f011016645c1b860d.jpg!","author":"4fde5cee945b700a970060fc"},{"id":"533cf6b763687208f0b10000","topic_id":"5161dd617f123bd25900013d","body":"\"@someguy111\":/dis/the-time-wasting-thread/post/533ce8fa636872764ac10200#post_533ce8fa636872764ac10200\r\nI think I've only ever had coffee cream a couple of times before.  I'm trying to imagine why you like it, but I can't remember what it tastes like.  If I recall it tastes like unpasteurized milk right?  I don't drink coffee cause it upsets my stomach.\r\n\r\n\r\n\r\nI have a random question:  Why do smokers say that quitting is hard?  I used to smoke and I'm having a nicotine withdrawal, but I still don't smoke.  When I quit smoking I just up and decided one day to not smoke and haven't smoked since.","author":"38b55cdf63616403d7560600"},{"id":"533cfd9063687219093e0100","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/533cf6b763687208f0b10000#post_533cf6b763687208f0b10000\r\nThere is a little thing called willpower.\r\nHowever, there are biological clues that some people vary from another on the susceptibility of addiction than others.  ","author":"4fde5cee945b700a970060fc"},{"id":"533cff706368727e9e600000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/533cf6b763687208f0b10000#post_533cf6b763687208f0b10000\r\nI have always loved coffee cream ever since I went to restaurants as a kid and would drink it from the little containers they had sitting in that little basket on the table. I would drink most if not all of them before the food even got to the table then would ask for more and take a bunch home with me. I've always liked milk but cream is much better than milk. There's just something about it; it's both sweet and thick and just really good. I can't really describe the taste other than just really good milk but if I have any cream near me it's gone fast.\r\n\r\nNicotine replaces a chemical in the brain, I don't know which but after a while the body stops making that chemical because it no longer needs to and the cigarettes become the source of it, that why it's so hard to quit for so many people. Other times it's because they just need the feel of a cigarette in their mouth. i notice a lot of smokers or smokers who quit or are trying to quit always have something between their lips like a toothpick. Possibly the reason other find it so hard to quit is the reason they took up smoking the first place; they like it. It's like giving up your favorite food, it's seen as deprivation. Others may have started smoking because it's a way for them to relieve their stress and they have come to rely on it for stress relief.","author":"5010fa077f123b1e4f00104e"},{"id":"533d02406368721bca870300","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/533cfd9063687219093e0100#post_533cfd9063687219093e0100\r\nI would be the willpower group in this case, cause my family is massively prone to addiction to the point I'm the only one that has ever given up smoking and can resist drinking.  I just drink for fun; rest of my family once they go alcoholic can't even put any alcohol in the fridge without them taking it. . . No seriously; I had a nice wine and was saving it cause of how strong it was(Wasn't a true wine; rather a fortified wine I added in something fun).  Couple days later my mom drinks the whole thing even though I warned her that she would probably die if she did.  Before you ask no she didn't; made sure she was okay, had a vomit towel just in case, put her face down on the pillow in case she threw up so she wouldn't choke to death on her own vomit and she was passed out drunk for the *entire* next day and had a hangover on the next day.\r\n\r\nGod help her if I ever get everclear.  I could put a warning label on alcohol saying, \"Drink it and you die\" and they'd drink it all anyhow.  In fact the second to last time my sister visited they drank so hard it was four am when they came home and passed out on the lawn, had to drag their sorry selves inside and they puked everywhere. . . Idiots\r\n\r\nI'm one of those people that you would think would be a light weight metaphorically, is quietly sipping on a unmarked bottle while everyone's acting like idiots and when you challenge them to a drinking contest they're not even phased by the third bottle and you fell out of the chair.\r\n\"@someguy111\":/dis/the-time-wasting-thread/post/533cff706368727e9e600000#post_533cff706368727e9e600000\r\nHmm. . I guess I would be in the deprivation group.  I liked smoking and the high it gave, but I just went, \"Y.o.l.o. (throws the entire pack in the garbage and immediately gives up smoking forever)\"","author":"38b55cdf63616403d7560600"},{"id":"533d04286368725855870000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/533d02406368721bca870300#post_533d02406368721bca870300\r\n\r\nI'm liking you more and more everyday. Even if you don't appreciate sleep, that's ok.","author":"4fdfbf92945b7075d50036e4"},{"id":"533d0d22636872271f070300","topic_id":"5161dd617f123bd25900013d","body":"\"@QuasarNova\":/dis/the-time-wasting-thread/post/533d04286368725855870000#post_533d04286368725855870000\r\nIt's funner to watch people acting stupid drunk and taking pictures of them rather than you being the one having pictures taken of.\r\n\r\n\"Here is a embarrassing photograph of you flirting with a coatrack; here is a picture of you accidentally announcing to someone that you like them; here is another picture of you -dancing- flailing about while drunk trying to dance to dubstep and here is the final picture of you smiling for the camera while I'm applying a disinfectant and bandaging your face for taking the dubstep drop literally\"\r\n\r\n\r\nI do like sleep; I just don't like sunlight.","author":"38b55cdf63616403d7560600"},{"id":"533d11d36368722b26910200","topic_id":"5161dd617f123bd25900013d","body":"So Venus gets more and more flanderized as the series goes on. Apparently in the manga she's a lot more competent.\r\n\r\nDoes Jupiter have any faults? She's stronger, more domestic, etc\r\n\r\nIt was a good decision, imo, to make Mars fiery in the anime. The reserved thing is already covered by Mercury.\r\n\r\nI also perfect a move in New Vegas I call the Whisper Quiet Spinning Spike Rail.\r\nI just use Project Nevada's sprint ability in conjunction with a shotgun. With the charge perk I can run with my gun out, allowing me to shoot. Spread is increased massively but with a shotgun it doesn't matter.\r\nThe blast should do serious damage to the enemy, me running into them will knock them down and leave them at my mercy.\r\nOh wait, there is no mercy.\r\n\r\n","author":"4fe16df67f123b13e400003f"},{"id":"533d14656368722989360000","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/533d11d36368722b26910200#post_533d11d36368722b26910200\r\nJust use the grenade machinegun or use a rocket launcher.  If you want to be subtle go for Fat Man; I always call mine \"subtlety\" in fact.","author":"38b55cdf63616403d7560600"},{"id":"533d14b76368721466520400","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/533d14656368722989360000#post_533d14656368722989360000\r\nDon't have those yet. Either some kind of laser gunner or bomb jockey methinks","author":"4fe16df67f123b13e400003f"},{"id":"533d14ee6368723c00c50300","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/533cf18763687209814d0100#post_533cf18763687209814d0100\r\nI eat these every Chinese New Year.","author":"50d9a3aea4c72dc9b3000120"},{"id":"533d160f636872435e750000","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/533d14b76368721466520400#post_533d14b76368721466520400\r\n25mm grenade apw?  Those are good for sneaking and you don't want to be caught.","author":"38b55cdf63616403d7560600"},{"id":"533d172463687226797f0100","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/533d160f636872435e750000#post_533d160f636872435e750000\r\nI'm level 6.\r\nBesides, PN adds chargeable Energy Weapons. I want to see what kind of damage I can do with those","author":"4fe16df67f123b13e400003f"},{"id":"533d1aa36368722ec55c0000","topic_id":"5161dd617f123bd25900013d","body":"That awkward and yet very awesome moment when you just thought of something that in any way is not related to what you were doing and thinking before.\r\n\r\nLike me recently.\r\nI was just thinking on posting a comment that says \"You are now inside a BABOON!\"","author":"4fe1b9f47f123b13df002976"},{"id":"533d8f5f636872325ed20200","topic_id":"5161dd617f123bd25900013d","body":"\"@HJSDGCE\":/dis/the-time-wasting-thread/post/533d1aa36368722ec55c0000#post_533d1aa36368722ec55c0000\r\n\r\n\r\nThat line fits an Old Spice commercial so well, I'm surprised they haven't used ot","author":"4fdfbf92945b7075d50036e4"},{"id":"533d97426368725574630200","topic_id":"5161dd617f123bd25900013d","body":"And now I sit waiting for a phonecall before I complete the final stages of packing for New Orleans.","author":"4fe4bf947f123b175b000001"},{"id":"533db4ac6368721c64ff0100","topic_id":"5161dd617f123bd25900013d","body":"\"@AaronMk\":/dis/the-time-wasting-thread/post/533d97426368725574630200#post_533d97426368725574630200\r\nYou're going to be living I think two hours away from me at least until I move myself.  Just don't get shot. . No seriously.","author":"38b55cdf63616403d7560600"},{"id":"533db63363687273ec610100","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/533db4ac6368721c64ff0100#post_533db4ac6368721c64ff0100\r\n\r\nIt's a five day vacation, I don't expect to leave Bourbon street or that touristy corner of NOLA where all the cops sit and act homeless. So I heard.\r\n\r\nAnd my Dad - who I'm going with along with my stepmom - has already been down there for the past few years annually so I've been briefed on the concept of staying to where there are people. Same rules as Detroit.","author":"4fe4bf947f123b175b000001"},{"id":"533db922636872045c490200","topic_id":"5161dd617f123bd25900013d","body":"!https://pbs.twimg.com/media/BkUh9M0CcAAQRCr.jpg:large!\r\n\r\nHasbro, stop trying to make Littlest Pet Shop happen. It's not going to happen.","author":"4ff4f96c7f123b7dda01f1ed"},{"id":"533db9d66368720e42330000","topic_id":"5161dd617f123bd25900013d","body":"\"@Itsthinking\":/dis/the-time-wasting-thread/post/533db922636872045c490200#post_533db922636872045c490200\r\nHasn't been paying attention to hasbro at all lately.  MLP was pretty much their one hit wonder franchise of the decade.","author":"38b55cdf63616403d7560600"},{"id":"533dbb6b6368726370460100","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/533db9d66368720e42330000#post_533db9d66368720e42330000\r\nThey've tried to make lightning strike twice three separate times, all have failed. It's like they've got an idea on a part of why the show is so good, but don't get that you can't force something like this.","author":"4ff4f96c7f123b7dda01f1ed"},{"id":"533dbd226368723a20310300","topic_id":"5161dd617f123bd25900013d","body":"\"@Itsthinking\":/dis/the-time-wasting-thread/post/533dbb6b6368726370460100#post_533dbb6b6368726370460100\r\nIt's probably why mlp is for the foreseeable future going to just get renewed until it's ran into the ground.  The reason being is that the toy sales industry is going down due to children wanting electronics instead; if mlp losses popularity or toy sales go down there goes their positive growth.  Mlp is the only thing that's holding up their stocks.\r\n\r\nMy money is on they're going to keep trying to make lightning strike again, but not succeeding and eventually the show's popularity wanes.","author":"38b55cdf63616403d7560600"},{"id":"533dbebf6368727fe5190000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/533dbd226368723a20310300#post_533dbd226368723a20310300\r\nThe thing is that they're trying to rely less and less on toys and more and more on media. So they're only going to keep trying to make lightning strike.\r\n\r\nToy sales are third in line.","author":"4ff4f96c7f123b7dda01f1ed"},{"id":"533dbfd06368721578540000","topic_id":"5161dd617f123bd25900013d","body":"\"@Itsthinking\":/dis/the-time-wasting-thread/post/533dbebf6368727fe5190000#post_533dbebf6368727fe5190000\r\nBut do you think they're going to manage to make lightning strike twice if they don't understand why the lightning struck in the first place?","author":"38b55cdf63616403d7560600"}]}