{"topics":[{"id":"53e8453463687214b53d0000","topic_id":"5161dd617f123bd25900013d","body":"\"@Evident Disaster\":/dis/the-time-wasting-thread/post/53e8443f63687242351a0100#post_53e8443f63687242351a0100\r\nsome states overperform, others underperform. And the states in the US vary a lot more than district/regions in most Western European countries\r\n\r\n\r\n\"@PaskaNaakka\":/dis/the-time-wasting-thread/post/53e843a26368726c6e640100#post_53e843a26368726c6e640100\r\nLooking for it, Finnish news can be hard to get here","author":"4fe16df67f123b13e400003f"},{"id":"53e845456368726282910000","topic_id":"5161dd617f123bd25900013d","body":"\"@Evident Disaster\":/dis/the-time-wasting-thread/post/53e8450663687260379e0100#post_53e8450663687260379e0100\r\nKamen Rider thing.","author":"513e68eda4c72d4e3b000164"},{"id":"53e845676368727cfeae0000","topic_id":"5161dd617f123bd25900013d","body":"actually i feel in these years we are living in more peace than in other decades tho, its just that we are far more aware about what is happening in other places of the world, in the 90´s terrorist wouldnt put videos of their massacres online or we wouldnt see internet pages about all the wars in the world.","author":"5154c5237f123bcd580002fc"},{"id":"53e8457e6368724235490100","topic_id":"5161dd617f123bd25900013d","body":"\"@Evident Disaster\":/dis/the-time-wasting-thread/post/53e8450663687260379e0100#post_53e8450663687260379e0100\r\n\"GII!\":https://www.youtube.com/watch?v=eONHxopnAZ0","author":"5062d6f17f123b3e16001184"},{"id":"53e8458763687230ace00000","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/53e8453463687214b53d0000#post_53e8453463687214b53d0000\r\nI was thinking about moving to Finland if things go south in US.","author":"513e68eda4c72d4e3b000164"},{"id":"53e8458a6368726cb8640000","topic_id":"5161dd617f123bd25900013d","body":"\"@Evident Disaster\":/dis/the-time-wasting-thread/post/53e844ee63687252cf010000#post_53e844ee63687252cf010000\r\nI have nothing against humans as a species. It is society that needs to be either abolished or in need of a total overhaul.","author":"4fde5cee945b700a970060fc"},{"id":"53e845a963687214cea10000","topic_id":"5161dd617f123bd25900013d","body":"\"@Ore-O\":/dis/the-time-wasting-thread/post/53e8458763687230ace00000#post_53e8458763687230ace00000\r\nor Australia/NZ","author":"4fe16df67f123b13e400003f"},{"id":"53e8463e636872255cbf0100","topic_id":"5161dd617f123bd25900013d","body":"\"@Evident Disaster\":/dis/the-time-wasting-thread/post/53e841b263687231d95c0100#post_53e841b263687231d95c0100\r\n[bq=\"Evident Disaster\"]Okay who here watches the news? Or for that matter keeps up to date with everything in the world? Cause there's a lot of crap which happens, and I'd like to know what you guys think.\r\nUnless of course you're like me who just doesn't give a crap often and just accepts the way the world is. [/bq]\r\nI do.\r\n\r\nTl:dr; ISIS is fucking over the middle east; ISIS will probably have their own country ten years from now independent of Iraq and Syria which everyone is going to nickname \"#1 shithole of the world\" and Syria will be nicknamed \"#2 shithole of the world\".  People are evacuating Syria and ISIS controlled areas as fast as humanly possible to the point that's probably how that shit's going to end is that almost all the civilian population will have left(10k people are leaving a day so in 5-10 years Syria will be a metaphorical ghost town).\r\n\r\nRussia fucked up by supporting the rebels in Ukraine and the rebels are losing control of large amounts of land to the point where realistically speaking the only city they can maintain control of in the long run is a town on the border with Russia anyhow.  Russia was caught shelling into Ukraine.  Russia fucked up diplomatically.  The Ukraine rebels fucked up and accidentally shot a civilian aircraft and have lost a ton of support.  Russia's boner for conquering countries got the cold shower treatment and will probably not be able to take control of anymore areas of land.\r\n\r\n\r\nEbola in northwest africa is spreading faster than they can quarantine it.  Traditionally ebola kills faster than it can infect, but due to extremely poor standards of living in the countries it's infecting it's spreading at a rate of about 20% a week.  It's enough of a \"oh shit\" scenario that the borders are getting shut down and sooner rather than later travel will be suspended.  More than likely it won't cross the Sahara, but if it does gg africa.  Liberia, Sierre Leone and such are probably fucked cause the quarantine procedures are constantly being breached due to the country not having the facilities to contain the outbreak.  It probably won't spread further than africa.  Worst case scenario is if it spreads beyond the Sahara we're talking at least a couple ten million dead; if it doesn't spread beyond the sahara we're talking only a couple hundred thousand to a couple million dead.  The vast majority of the deaths will be in Africa though.\r\n\r\nRobot penises: explanation cybernetics are coming sooner rather than later, but not in the way you expect cause robot organs are really difficult but legs and organs are much easier.\r\n\r\n\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/53e83e8463687273fe630100#post_53e83e8463687273fe630100\r\n[bq=\"SeraphimDawn\"]\"@uc9\":/dis/the-time-wasting-thread/post/53e83a3263687235dba90100#post_53e83a3263687235dba90100\r\nWhat happened?[/bq]\r\nTl:dr; group programming project that the rest of the group are being lazy asses so I had to 99% of it and I don't under the last 1% and even after asking them kindly to do a single paragraph's worth they expect me to do it and are expecting me to 100% of the project so I had to work all weekend doing the work of five people.","author":"38b55cdf63616403d7560600"},{"id":"53e846426368724235640100","topic_id":"5161dd617f123bd25900013d","body":"\"@Ore-O\":/dis/the-time-wasting-thread/post/53e845456368726282910000#post_53e845456368726282910000\r\n\r\nOh okay I thought that guy was saying we should check out Amazon.com, which would be really strange, cause I don't bother to buy stuff online unless its something I like. \r\n\r\n\r\n\"@Whatevs\":/dis/the-time-wasting-thread/post/53e8453463687214b53d0000#post_53e8453463687214b53d0000\r\n\r\nOkay well that I can understand. \r\n\r\n\r\nAnyone keeps in check with the Asia Pacific news? I mean politics and so forth? \r\n\r\nSouth Korea planning on selling ships to other countries, and them increasing their naval capacity and military in the face of Japanese nationalists.\r\n\r\nJapan's going through some rather unwanted changes, their Prime Minister wants to remove article 9 of that act which forbid Japan from ever having a military, so they can militarize again, which I can imagine the US and most of the UN will immediately shoot down. ","author":"5046d66d7f123b38980018c6"},{"id":"53e846816368727389cc0000","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/53e845a963687214cea10000#post_53e845a963687214cea10000\r\nI heard from my Spanish teacher that Finlanders treat teachers the same as other countries do to doctors.","author":"513e68eda4c72d4e3b000164"},{"id":"53e846cf6368722c84d40100","topic_id":"5161dd617f123bd25900013d","body":"\"@Evident Disaster\":/dis/the-time-wasting-thread/post/53e846426368724235640100#post_53e846426368724235640100\r\nI started watching Japanese news but it is an uphill battle\r\n\r\n\r\n\r\n\r\n\"@Ore-O\":/dis/the-time-wasting-thread/post/53e846816368727389cc0000#post_53e846816368727389cc0000\r\nyea but...\r\n!http://i.imgur.com/KHYw6EA.jpg!","author":"4fe16df67f123b13e400003f"},{"id":"53e8471263687273c3af0000","topic_id":"5161dd617f123bd25900013d","body":"\"@Evident Disaster\":/dis/the-time-wasting-thread/post/53e846426368724235640100#post_53e846426368724235640100\r\n[bq=\"Evident Disaster\"]\"@Ore-O\":/dis/the-time-wasting-thread/post/53e845456368726282910000#post_53e845456368726282910000\r\nwhich I can imagine the US and most of the UN will immediately shoot down. [/bq]\r\nNot necessarily; if Japan joins NATO chances are the USA will love that.","author":"38b55cdf63616403d7560600"},{"id":"53e8472863687203ba070000","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/53e8458a6368726cb8640000#post_53e8458a6368726cb8640000\r\nWell you're free to move to my country I don't care and I don't mind. \r\n\r\n\"@Ore-O\":/dis/the-time-wasting-thread/post/53e8458763687230ace00000#post_53e8458763687230ace00000\r\n\r\nOoh Finland the one place no one dares to screw with thanks to the sheer amount of advanced military hardware they have there, not a bad place to live. Though they aren't biased about race are they? I keep forgetting which nations in Europe are. \r\n\r\n\"@twistedmetalero\":/dis/the-time-wasting-thread/post/53e845676368727cfeae0000#post_53e845676368727cfeae0000\r\n\r\nYeah its a lot more relevant now, but there's a lot of stuff which we can't avoid. Technology changes certain aspect of life, heck people used to just text with mobiles, now we sent who pictures and stuff man, I used to have a flipping brick as a means to chat with someone 10 years ago. \r\n","author":"5046d66d7f123b38980018c6"},{"id":"53e847b26368724fe7690000","topic_id":"5161dd617f123bd25900013d","body":"\"@Ore-O\":/dis/the-time-wasting-thread/post/53e846816368727389cc0000#post_53e846816368727389cc0000\r\nWe are much less formal with our teachers than people in many other countries, sure. \r\n\r\nAnd also in Finland students take responsibility for their own studies; if you fail a test, you will be blamed for it, not the teacher.","author":"5007bbdf7f123b112f00023a"},{"id":"53e8480a6368723d44790000","topic_id":"5161dd617f123bd25900013d","body":"\"@Evident Disaster\":/dis/the-time-wasting-thread/post/53e8472863687203ba070000#post_53e8472863687203ba070000\r\nheh, there are two sides to that issue. But no Finland is not biased.\r\n\r\nBut also not as ravenously immigration crazy as other European countries. They have sensible policy.","author":"4fe16df67f123b13e400003f"},{"id":"53e8481f6368721330580000","topic_id":"5161dd617f123bd25900013d","body":"\"@PaskaNaakka\":/dis/the-time-wasting-thread/post/53e847b26368724fe7690000#post_53e847b26368724fe7690000\r\nda. Finnish education is very good.\r\n\r\n","author":"4fe16df67f123b13e400003f"},{"id":"53e848276368724c21260100","topic_id":"5161dd617f123bd25900013d","body":"unless finland person does a rap album that can top illmatic i will not see them as best country.","author":"5154c5237f123bcd580002fc"},{"id":"53e8483e6368721469d40000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/53e8471263687273c3af0000#post_53e8471263687273c3af0000\r\n\r\nWait what? Why the hell would they allow that to happen? Don't they veto this decision in the UN, they US can't just back them for the chance that they might support NATO. What happens when Korea and China decide that's not worth the risk of having rather aggressive neo-nationalist Japanese trying to influence another conflict? ","author":"5046d66d7f123b38980018c6"},{"id":"53e8489d6368721509bf0000","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/53e8480a6368723d44790000#post_53e8480a6368723d44790000\r\n\r\nOkay that's nice, hopefully I'll move there if things don't go so well here, or if there's a chance I get enough money I'll take a nice vacation there skiing since I've never seen snow in my entire life. Only hot burning deserts, giant ass spiders and so forth, ah Australia where half our wildlife can kill you very quickly. \r\n\r\nI love this place. ","author":"5046d66d7f123b38980018c6"},{"id":"53e848ec6368727d20060100","topic_id":"5161dd617f123bd25900013d","body":"Guys....\r\nI just got a 1933 copy of _Mein Kampf_ for only a Loonie from a moving sale... In _Deutsch_ too. I bought it because I like old things. Especially things that carry history. Or potentially carry historical values.\r\n\r\n[spoiler]I do not understand German O_O[/spoiler]","author":"4fde5cee945b700a970060fc"},{"id":"53e848ee6368726b528f0000","topic_id":"5161dd617f123bd25900013d","body":"\"@Evident Disaster\":/dis/the-time-wasting-thread/post/53e8483e6368721469d40000#post_53e8483e6368721469d40000\r\nDude; it's the usa.  The usa loves showing off it's military dick.","author":"38b55cdf63616403d7560600"},{"id":"53e849216368726cb8cd0000","topic_id":"5161dd617f123bd25900013d","body":"\"@Evident Disaster\":/dis/the-time-wasting-thread/post/53e8489d6368721509bf0000#post_53e8489d6368721509bf0000\r\nYou're Australian?\r\nAustralia is also doing well, no real reason to leave as far as I know.","author":"4fe16df67f123b13e400003f"},{"id":"53e849a663687239a2700100","topic_id":"5161dd617f123bd25900013d","body":"The Russian counter sanctions against EU are messing with finnish economy a bit right now, though.\r\n\r\n","author":"5007bbdf7f123b112f00023a"},{"id":"53e849cb6368720712930000","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/53e848ec6368727d20060100#post_53e848ec6368727d20060100\r\n\r\nAh that book, I read about it in my history class in high school, its interesting, and you might want to check up on that page I think it was 43 or something I can't recall, about the Jews. \r\n\r\n\"@uc9\":/dis/the-time-wasting-thread/post/53e848ee6368726b528f0000#post_53e848ee6368726b528f0000\r\n\r\nOh well I guess that I can understand, wow the US really likes to screw with its neighbors doesn't it? I don't see how this is going to end politically well, especially since the Chinese and Koreans clearly stated that they were going to beat the crap out of Japan if it tried something.\r\n\r\nWell actually an argument on some chat site where Japanese guys were laughing over that Korean ship which went down, the people on that page threatened to go and murder them as painfully as possible.\r\n\r\nI get the feeling that sentiment is shared by a lot of them. \r\n","author":"5046d66d7f123b38980018c6"},{"id":"53e849f46368724897530100","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/53e849216368726cb8cd0000#post_53e849216368726cb8cd0000\r\n\r\nI said if things actually go bad, and also I said I'd like to go there for a vacation. I've never seen snow. ","author":"5046d66d7f123b38980018c6"}]}