{"topics":[{"id":"53ea2bc86368727f5ce10000","topic_id":"5161dd617f123bd25900013d","body":"\"@Albus Fahrenheits\":/dis/the-time-wasting-thread/post/53ea27226368725251f00100#post_53ea27226368725251f00100\r\nCause there's a fine line between a tsunadere and being a jackass to which a a lot of anime crosses.  What I mean by this is that if a character goes around beating up other characters without provocation that's not being a tsunadere that's called a sadist.\r\n\r\n\r\n\r\nAlso here's something to make your blood boil; the Missouri dude that got shot did have a witness to the cop killing the dude.  The eye witness said that the 18 year old who was shot was trying to run from the cops and the cops shot him.\r\nBasically what happened was:\r\nThe person that got shot tries to run -> Police officer warns him that he'll shoot -> Person stops struggling -> Police officer shoots anyhow\r\n\r\nShit like this is why no one trusts cops cause if even after you stop struggling and give up you'll get shot anyways why should anyone trust you?  \"Freeze or I'll shoot\" has become \"Freeze and I'll shoot anyhow\".  And you know what's worse?  The police officer kept shooting the guy even after he was dead.","author":"38b55cdf63616403d7560600"},{"id":"53ea2ede6368720beeb00100","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/53ea2bc86368727f5ce10000#post_53ea2bc86368727f5ce10000\r\nThat's, absolutely disgusting.\r\n\r\nI hope that cop gets his ass fired for this.\r\n\r\nWhat the fuck. ","author":"50c204917f123b31440000a5"},{"id":"53ea2fbb6368720bb17c0100","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/53ea2bc86368727f5ce10000#post_53ea2bc86368727f5ce10000\r\nTrigger discipline. Guess he was a -bit- lot nervous. Needs more control in his reaction.\r\n\r\nAlso, on the Tsundere part. I kinda don't mind if they be asrseholes to me. I got a 'sticks and stones' policy and when they do hit it's mostly just for fun and I can take it. I don't know what to feel about yanderes though. Cute and scary? I just don't know.","author":"52f0834d63687261cba90300"},{"id":"53ea304b636872567c040100","topic_id":"5161dd617f123bd25900013d","body":"\"@Albus Fahrenheits\":/dis/the-time-wasting-thread/post/53ea1ca063687252911a0000#post_53ea1ca063687252911a0000\r\n\r\nlaw.\r\n\r\n","author":"5154c5237f123bcd580002fc"},{"id":"53ea30c56368727074310100","topic_id":"5161dd617f123bd25900013d","body":"\"@Albus Fahrenheits\":/dis/the-time-wasting-thread/post/53ea2fbb6368720bb17c0100#post_53ea2fbb6368720bb17c0100\r\n\r\nshooting somebody who not only is not armed, but not struggling, and to keep shooting him after he is dead means that cop shouldnt have gotten that job.","author":"5154c5237f123bcd580002fc"},{"id":"53ea30ef63687246a8410000","topic_id":"5161dd617f123bd25900013d","body":"\"@twistedmetalero\":/dis/the-time-wasting-thread/post/53ea304b636872567c040100#post_53ea304b636872567c040100\r\nWait. You study law and really like rap music? U-uhh, it's cool. Nothing odd about that.","author":"52f0834d63687261cba90300"},{"id":"53ea312a6368727f85b50100","topic_id":"5161dd617f123bd25900013d","body":"\"@twistedmetalero\":/dis/the-time-wasting-thread/post/53ea30c56368727074310100#post_53ea30c56368727074310100\r\nLike I said needs more discipline. A lot more.","author":"52f0834d63687261cba90300"},{"id":"53ea322c6368725656900100","topic_id":"5161dd617f123bd25900013d","body":"\"@Albus Fahrenheits\":/dis/the-time-wasting-thread/post/53ea30ef63687246a8410000#post_53ea30ef63687246a8410000\r\n\r\nyeah why.\r\n\r\nis it weird for a lawyer to listen to rap music that talk about doing drugs and sometimes OD, glorify violence, shooting people, do gang activities, rape women/rape men/rape yourself if you are that high and other illegal activities and enjoy it?","author":"5154c5237f123bcd580002fc"},{"id":"53ea337563687264e16f0000","topic_id":"5161dd617f123bd25900013d","body":"\"@twistedmetalero\":/dis/the-time-wasting-thread/post/53ea322c6368725656900100#post_53ea322c6368725656900100\r\nIt's just... niches of society. Nevermind. Guess I'm not the only one who breaks stereotypes.","author":"52f0834d63687261cba90300"},{"id":"53ea34a063687265cf910000","topic_id":"5161dd617f123bd25900013d","body":"\"@Albus Fahrenheits\":/dis/the-time-wasting-thread/post/53ea337563687264e16f0000#post_53ea337563687264e16f0000\r\n\r\ni was gonna get a clpnng tattoo too but they dont let me be a lawyer with it.","author":"5154c5237f123bcd580002fc"},{"id":"53ea430d6368725593f90000","topic_id":"5161dd617f123bd25900013d","body":"UHHH! I want to play Skyrim so fucking bad. ","author":"50c204917f123b31440000a5"},{"id":"53ea44756368725546690100","topic_id":"5161dd617f123bd25900013d","body":"\"@Number1pegasus\":/dis/the-time-wasting-thread/post/53ea430d6368725593f90000#post_53ea430d6368725593f90000\r\nI dont think ill evee get back into skyrim\r\nIts too much","author":"4fe3df367f123b517900066a"},{"id":"53ea4485636872519b150000","topic_id":"5161dd617f123bd25900013d","body":"\"@Number1pegasus\":/dis/the-time-wasting-thread/post/53ea430d6368725593f90000#post_53ea430d6368725593f90000\r\n\r\nillegal downloads exist :V","author":"5154c5237f123bcd580002fc"},{"id":"53ea44a46368722be54b0000","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/53e9b8836368727392df0000#post_53e9b8836368727392df0000\r\nKind of","author":"4fe3df367f123b517900066a"},{"id":"53ea450363687256100e0100","topic_id":"5161dd617f123bd25900013d","body":"\"DONT FORGET THAT MILLER HIGH LIIIIIFEEEEE\":https://www.youtube.com/watch?v=3E7dHprClzA","author":"5154c5237f123bcd580002fc"},{"id":"53ea45b36368726e522c0000","topic_id":"5161dd617f123bd25900013d","body":"\"@twistedmetalero\":/dis/the-time-wasting-thread/post/53ea4485636872519b150000#post_53ea4485636872519b150000\r\nI don't think that would be a good idea.\r\n\r\n\r\n\"@mariomarc\":/dis/the-time-wasting-thread/post/53ea44756368725546690100#post_53ea44756368725546690100\r\nThe Puns, they burn. ","author":"50c204917f123b31440000a5"},{"id":"53ea45e263687255df810000","topic_id":"5161dd617f123bd25900013d","body":"\"@Number1pegasus\":/dis/the-time-wasting-thread/post/53ea45b36368726e522c0000#post_53ea45b36368726e522c0000\r\n  \r\nthere is nothing wrong with a little torrent here and there :V\r\n\r\nbut if you dont want too its ok.","author":"5154c5237f123bcd580002fc"},{"id":"53ea464a636872519b6a0000","topic_id":"5161dd617f123bd25900013d","body":"\"@twistedmetalero\":/dis/the-time-wasting-thread/post/53ea45e263687255df810000#post_53ea45e263687255df810000\r\nYeah that's true, I guess when it comes to games like that I'd just rather get it officially.\r\n\r\nPlus I'm scared of getting some form of virus. ","author":"50c204917f123b31440000a5"},{"id":"53ea46d863687203d6e30000","topic_id":"5161dd617f123bd25900013d","body":"\"@Number1pegasus\":/dis/the-time-wasting-thread/post/53ea464a636872519b6a0000#post_53ea464a636872519b6a0000\r\n\r\neh, if you get a good antivirus like avast dat ass you will be ok.\r\n\r\nalso checking comments on torrents.","author":"5154c5237f123bcd580002fc"},{"id":"53ea47186368727ef3780100","topic_id":"5161dd617f123bd25900013d","body":"Just wait for another steam sale\r\nGet the full game with dlc for like 20 bucks","author":"4fe3df367f123b517900066a"},{"id":"53ea47376368726a91a70000","topic_id":"5161dd617f123bd25900013d","body":"\"@twistedmetalero\":/dis/the-time-wasting-thread/post/53ea46d863687203d6e30000#post_53ea46d863687203d6e30000\r\nSome of us just don't like downloading games that are still legal to officially buy at the moment okay? (Present company included)","author":"5062d6f17f123b3e16001184"},{"id":"53ea47b363687236131d0000","topic_id":"5161dd617f123bd25900013d","body":"\"@trashboat\":/dis/the-time-wasting-thread/post/53ea47376368726a91a70000#post_53ea47376368726a91a70000\r\n\r\nyou know you can torrent games and buy them later?","author":"5154c5237f123bcd580002fc"},{"id":"53ea47df63687255df130100","topic_id":"5161dd617f123bd25900013d","body":"Random thought:\r\nAfter watching 2001 space odyssey again I sort of agree *with whoops wrong person* on genetic engineering, but have to massively disagree on his idea of his desire to create freaks of nature just cause it \"looks cool\".  What I mean by this is that chances are everyone has seen 2001, but in case you haven't basically what it's about is that a alien species goes around the galaxy and on planets that could support life start the evolutionary process and that species on planets with life that can become intelligent they promote intelligence in them to start the evolutionary process to jump start it.  In the movie they teach our evolutionary ancestors how to use tools thus starting the process of how humans came about.  In the movie they also start turning Jupiter into a micro-star in order to warm up Europa enough to allow for life to start.\r\n\r\n\r\nPersonally while I agree with the idea of introducing life to planets that can support it and alter species that can potentially become sapient I massively have to disagree with the idea of jamming species together on the basis of \"it looks cool\".\r\n\r\nWhat I mean by this is that personally what I would do is introduce the gene responsible for human evolution into other species as well as geo-engineering and bio-engineering for species to be more resilient to harsh environments.  What I mean by this is that theoretically Mars could support life; the top three problems is the radiation, the lack of oxygen, the planet constantly tilts and the lack of the planet having a magnetosphere to protect the planet.  Theoretically if you were to engineer bacteria, plants and animals to survive high radiation that's one problem fixed(some animals can survive up to 100k rads).  The lack of oxygen can be fixed with bacteria chewing on the rocks; there's a lot of oxygen trapped in the rocks on mars.  The problem with how the planet constantly tilts is that summers can be as hot as 0 degrees celsius, but the winters are fucking cold.  The bacteria on mars would have to breath out CH4 to heat up the planet.  You would also need to make everything resilient to the cold.  That would just leave how the sun blasts away the atmosphere often; that's a bit more tricky though while the engineered bacteria could put enough oxygen and CH4 into the air for it to have a stable breathable atmosphere every time a solar storm would blast through the planet it would remove a fourth of the atmosphere meaning if you would have a hard ass time breathing, but you would still be able to breath.  That problem is a bit more tricky.\r\n\r\n\r\nThe problem with venus is that it's too fucking hot; you would need to massively geo-engineer the planet and drastically reduce the temperature of the planet before anyone even attempted to.  Europa might already support life; when the sun becomes a red giant it'll become hot enough to melt the surface and potentially a atmosphere.\r\n\r\n\r\n\r\n\r\nWhile the majority of stars do have planets the probability of any of them supporting life is drastically much smaller due to that often times the goldie lock zone(what they call the area that is not too hot and not too cold to support life) doesn't have any rocky planets in it or if they do they don't have enough water or such.  You would need massive amounts of geo-engineering for planets outside the goldie lock zone for them to support life, but it's still possible.","author":"38b55cdf63616403d7560600"},{"id":"53ea48b263687224346f0100","topic_id":"5161dd617f123bd25900013d","body":"\"@twistedmetalero\":/dis/the-time-wasting-thread/post/53ea47b363687236131d0000#post_53ea47b363687236131d0000\r\nI don't care, It's still wrong to do it with games that Are still for sale on Steam or New from gamestop or something. (Resale doesn't count)","author":"5062d6f17f123b3e16001184"},{"id":"53ea48e36368726e52bf0000","topic_id":"5161dd617f123bd25900013d","body":"Edit: Never mind.","author":"5062d6f17f123b3e16001184"}]}