{"topics":[{"id":"5347fd75636872695d390200","topic_id":"5161dd617f123bd25900013d","body":"\"@someguy111\":/dis/the-time-wasting-thread/post/5347fcf163687267d3d00100#post_5347fcf163687267d3d00100\r\n\r\nIf you dont find it fun then you dont, others do, nobody thinks the same and like said, its a game, its not meant to be taken seriously, they are made to be fun and are dumbed down.","author":"5154c5237f123bcd580002fc"},{"id":"5347ff6163687228053c0000","topic_id":"5161dd617f123bd25900013d","body":"\"@twistedmetalero\":/dis/the-time-wasting-thread/post/5347fd75636872695d390200#post_5347fd75636872695d390200\r\nFun and dumbed down? Most war games like CoD and such are so realistic they could almost be considered war simulators, not games.","author":"5010fa077f123b1e4f00104e"},{"id":"534800456368723103770000","topic_id":"5161dd617f123bd25900013d","body":"!http://i.kinja-img.com/gawker-media/image/upload/s--BCnNcCnj--/g7gazhoko9zo80jhelvi.gif!","author":"4fde2a2d945b7009f8002262"},{"id":"534801eb6368722d5b820100","topic_id":"5161dd617f123bd25900013d","body":"\"@RIG\":/dis/the-time-wasting-thread/post/534800456368723103770000#post_534800456368723103770000\r\nThis was the granddad of Lasik, but instead of improving your vision it just burned your eyes out.","author":"5010fa077f123b1e4f00104e"},{"id":"5348038663687240e97c0100","topic_id":"5161dd617f123bd25900013d","body":"\"@someguy111\":/dis/the-time-wasting-thread/post/5347ff6163687228053c0000#post_5347ff6163687228053c0000\r\n\r\nHow about you look at games like company of heroes, stalker, or civ 5, men of war or counter strike, they dont take a realistic sad battlefield point of view like lets say spec ops and even manage to put humor here and there, they focus on gameplay and the history doest really go that far in depth of human cruelty or shit.\r\n\r\nGranted i dont play much war battle games as much as i wanted\r\n\r\n","author":"5154c5237f123bcd580002fc"},{"id":"5348062063687235f02d0000","topic_id":"5161dd617f123bd25900013d","body":"Not a big fan a games that are just violence for the sake of violence. Even if they aren't an exact depiction of war they still include the elements which make it awful. I can understand how games like TF2 could just be considered all in fun because they are so far removed from anything that can be considered realistic or taken seriously but nonetheless I still don't see the appeal of senseless violence.","author":"5010fa077f123b1e4f00104e"},{"id":"5348151463687215bc540200","topic_id":"5161dd617f123bd25900013d","body":"\"@someguy111\":/dis/the-time-wasting-thread/post/5348062063687235f02d0000#post_5348062063687235f02d0000\r\nSo you wouldn't like Anarchy Reigns.","author":"4fde4618945b700aa0002fff"},{"id":"53481aed6368725adbe90000","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/5348151463687215bc540200#post_5348151463687215bc540200\r\nNever even heard of it but probably not. Now when I say I don't like violent games I don't mean games like Zelda or something like that, I mean games that are literally nothing but running around and killing people or games that feature brutal and realistic violence and heavy references to war. Games where you kill evil aliens and demons are sort of a gray area for me. No I do not agree with whatshisname (that lawyer who tried to ban violent games) but at the same time I really hate anything to do with war and violence against humans, be it in a game or not.\r\n\r\nEdit: Also as far as pony goes, I have a very hard time with Shining Armor for obvious reasons and the latest episode that aired was very painful for me as was Wonderbolts Academy due to all the war references.","author":"5010fa077f123b1e4f00104e"},{"id":"53481d9c6368722be87b0300","topic_id":"5161dd617f123bd25900013d","body":"\"@someguy111\":/dis/the-time-wasting-thread/post/53481aed6368725adbe90000#post_53481aed6368725adbe90000\r\nI've never had a problem with excessive violence. But then again, I've never had trouble separating reality and fiction.","author":"4fde4618945b700aa0002fff"},{"id":"534820d46368721de4780200","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/53481d9c6368722be87b0300#post_53481d9c6368722be87b0300\r\nI'm interpreting that as an insult. I understand it's a game. I understand what fiction is. I also understand the realistic depiction of something awful. How about Child Abuse: the game? Beat a little kid senseless with a bat as he screams and begs for you to stop. Games that depict horrible things that really happen I don't find amusing; war is something that really happens. Games that have extreme violence are not something I enjoy. However games that depict it in a serious way like showing a realistic gunshot wound or a internal organs being splattered against a wall I just find disgusting and upsetting. Games that are so ridiculously over-the-top with violence are admittedly so overdone I can't take them seriously, not that I really look into that kind of stuff anyway.\r\n\r\n\"Also it would seem the writers of the pony comics share both your view and apparently everyone else's by having the characters in battle armor\":http://derpiboo.ru/597918 I must say it's quite heartbreaking to see that, for me at least, not that it matters.","author":"5010fa077f123b1e4f00104e"},{"id":"5348229a63687253822c0200","topic_id":"5161dd617f123bd25900013d","body":"\"@someguy111\":/dis/the-time-wasting-thread/post/534820d46368721de4780200#post_534820d46368721de4780200\r\nI wasn't trying to insult you and if it seemed that way I'm sorry.","author":"4fde4618945b700aa0002fff"},{"id":"534823d16368724869590000","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/5348229a63687253822c0200#post_5348229a63687253822c0200\r\nNo offense taken.","author":"5010fa077f123b1e4f00104e"},{"id":"53482440636872483a990000","topic_id":"5161dd617f123bd25900013d","body":"\"@someguy111\":/dis/the-time-wasting-thread/post/534823d16368724869590000#post_534823d16368724869590000\r\nBut I DO see your point. Realistic depictions of violence are never interesting or fun. They're just unsettling and uncomfortable.","author":"4fde4618945b700aa0002fff"},{"id":"53482b056368722240c50100","topic_id":"5161dd617f123bd25900013d","body":"\"@someguy111\":/dis/the-time-wasting-thread/post/534823d16368724869590000#post_534823d16368724869590000\r\nJust out of curiosity. What is the origin of your username? If you don't mind sharing.","author":"4fde5cee945b700a970060fc"},{"id":"53482c37636872563b840100","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/53482440636872483a990000#post_53482440636872483a990000\r\nAlso don't get me wrong, I'm not saying a game has to be all sunshine and smiles, I rather like games that have an engaging story and have some dark elements to show the characters' true personalities such as Twilight Princess for example which is in my top 3 games of all time; but again those are both stories and completely fictional stories at that.\r\n\r\nOne other thing is I don't actually mind violence as long as it's in the right context such as fighting monsters and such; it's when people fight against each other, especially people who have very good designs and personalities and that I really like. Link, for example, in a death-match type game I feel is a very bad depiction of him since he's a character I really like and hate to see in such a pointless and terrible situation; just fighting for the sake of fighting. I never could get into Smash Brothers. As far as pony goes, I feel the same way; I HATE to see characters I like being put in a position of war and violence. Fighting is Magic, as much as everyone seemed to love, I had no interest in. I felt it was kind of a slap in the face to use characters with such developed personalties just to punch and kick each other. I feel a far better pony game would be an adventure type game ala Zelda where you have to find the Elements by using each of the characters unique abilities (AJ for the strength to move big objects, Dash to use speed to get an item to somewhere fast, Twilight to solve puzzles, Rarity to find special kinds of gems that give you powers, Flutters to communicate with animals to get them to help, and Pinkie to...uh...something). I find it kind of ironic that the same people who say they want to snuggle Fluttershy also want to beat her into submission in that game. Also again it's very painful and heartbreaking for me to have pony, a show I like so much, have references to war, both historic and modern.\r\n\r\n To put it another way, I don't like to see characters that I am fond of in any kind of position where they are either hurting others and/or getting hurt themselves or are advocating or referencing something horrible like war or genocide. I don't mind a story with some drama as I understand that good stories need something interesting, it's just there is a fine line between an engaging and moving story and grimdark.","author":"5010fa077f123b1e4f00104e"},{"id":"53482ca76368726f10680100","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/53482b056368722240c50100#post_53482b056368722240c50100\r\nIt's pretty self-explanatory, I'm simply some guy on this site. The \"111\" I just put there because \"someguy\" was already taken.","author":"5010fa077f123b1e4f00104e"},{"id":"53482d556368722240d50200","topic_id":"5161dd617f123bd25900013d","body":"\"@someguy111\":/dis/the-time-wasting-thread/post/53482ca76368726f10680100#post_53482ca76368726f10680100\r\nI see.\r\nFor a second, I thought there was a deeper meaning behind that 111 part of the name.","author":"4fde5cee945b700a970060fc"},{"id":"53482d8863687249b5590200","topic_id":"5161dd617f123bd25900013d","body":"\"Anime PSA: Life Lessons\":https://www.youtube.com/watch?v=dP1cqAbKF4Y\r\nWARNING!: Quite disturbing.","author":"4fde5cee945b700a970060fc"},{"id":"53482f496368726ea36e0200","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/53482d8863687249b5590200#post_53482d8863687249b5590200\r\nThat's not so much disturbing as it is just silly. I got a couple laughs out of a few scenes.","author":"5010fa077f123b1e4f00104e"},{"id":"534833396368721185c40000","topic_id":"5161dd617f123bd25900013d","body":"i would also like to point out now that im in a pc, that cod is far from being realistic, if it was categorized as a military simulation even ign would rate it low, arma would be more close to it.\r\n\r\ni mean cod only goes for multiplayer since campaing its effortless every game, but really multiplayer is not a big deal to make off, a bunch of guys shooting characterless soldiers, getting nice perks like oh super sky sattelite and chopper teleportation and taking it down with a pistol, it is more a silly game.\r\n\r\nedit: someguy, everytime you talk it reinforces the theory that you are my  opposite twin.","author":"5154c5237f123bcd580002fc"},{"id":"534839d36368727a67800100","topic_id":"5161dd617f123bd25900013d","body":"LOL!\r\n\"What?\":http://mashable.com/2014/04/03/lego-evil/","author":"4fde5cee945b700a970060fc"},{"id":"53483aba6368726063860000","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/534839d36368727a67800100#post_534839d36368727a67800100\r\nWhat _isn't_ a tool of the devil these days?","author":"5007bbdf7f123b112f00023a"},{"id":"53483bc66368724e1e050100","topic_id":"5161dd617f123bd25900013d","body":"\"@PaskaNaakka\":/dis/the-time-wasting-thread/post/53483aba6368726063860000#post_53483aba6368726063860000\r\nI bet you, this is probably the same crazy priest who claimed Pokemon, MLP, and Barbie as \"Satanic\". Not sure if he is right about the last one, but yeah.","author":"4fde5cee945b700a970060fc"},{"id":"5348cb586368721823900000","topic_id":"5161dd617f123bd25900013d","body":"\"You win. PERFECT!\":https://www.youtube.com/watch?v=zzDOpvukhNo\r\n!https://i.chzbgr.com/maxW500/8141166080/h5F4317AB/!","author":"4fde5cee945b700a970060fc"},{"id":"5348cb996368725d75b50100","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/5348cb586368721823900000#post_5348cb586368721823900000\r\nWell that's one way to do it!","author":"50c204917f123b31440000a5"}]}