{"topics":[{"id":"542f78af6368727f6a290200","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/542f736a6368726154390000#post_542f736a6368726154390000\r\nMy girl made me watch that anime. Very awkward considering who she is.","author":"52f0834d63687261cba90300"},{"id":"542f7a236368727fda720100","topic_id":"5161dd617f123bd25900013d","body":"Beast Wars best Transformers?","author":"4fe16df67f123b13e400003f"},{"id":"542f7a466368727a33570000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/542f736a6368726154390000#post_542f736a6368726154390000\r\norange haired little sister, very tsundere?","author":"4fe16df67f123b13e400003f"},{"id":"542f7e4d636872740e1d0000","topic_id":"5161dd617f123bd25900013d","body":"\"20 Creepiest Children’s Toys Ever Made\":https://www.youtube.com/watch?v=yHjCerAYnKg","author":"4fde5cee945b700a970060fc"},{"id":"542f80776368724e22cc0000","topic_id":"5161dd617f123bd25900013d","body":"\"20 Most Shocking Children’s Toys Ever Made\":https://www.youtube.com/watch?v=p4_w9TOQLYs","author":"4fde5cee945b700a970060fc"},{"id":"542f830063687251495c0000","topic_id":"5161dd617f123bd25900013d","body":"I'm in a slightly philosophical mood, so please forgive me for pontificating a bit. I think that true evil is the exploitation of human nature, whether good or ill. Murder, rape and robbery are all surely awful things that we must work to overcome, punish and care for the victims of, but they are simple, animal crimes. The legacy left by our ape ancestors.\r\n\r\nTrue evil is either indulging in these things out of a desire to hurt, to destroy, to defile or looking at our nature and using it to hurt people. This is why I so loathe psychics, faith healers and the like and I don't think I've ever made my utter hate, my rage and contempt for these fucking parasites quite clear. They exploit grief, hope and desperation. Emotions that are not only human but uniquely vulnerable. To take those things and use them to hurt people...\r\n\r\nSimilarly to exploit the hind brain feelings, our fear, our hate, our rage strikes me as a uniquely vile act. We are creatures evolved to feel these things and in and of themselves they are not evil. Rage when we are truly wronged is a perfectly understandable reaction. Hate for that which is undoubtedly vile is perhaps even close to being righteous. Fear of immediate danger is goddamn sensible.\r\n\r\nBut to guide people to rage over slights that either did not happen or which were perpetrated by the long dead against the long dead, to tell people to hate that which is merely different, to teach fear of the outsider strikes me as wicked, and to do so knowingly as an act of definite and conscious evil. There can be no justification for such an act.\r\n\r\nI apologize for rambling.","author":"4f41ee04945b701c41002af7"},{"id":"542f833563687241d1940100","topic_id":"5161dd617f123bd25900013d","body":"!http://i.imgur.com/UZaOftb.jpg!","author":"5154c5237f123bcd580002fc"},{"id":"542f8caf63687203e11f0200","topic_id":"5161dd617f123bd25900013d","body":"\"@Albus Fahrenheits\":/dis/the-time-wasting-thread/post/542f78af6368727f6a290200#post_542f78af6368727f6a290200\r\n!http://i0.kym-cdn.com/photos/images/original/000/678/156/014.gif!\r\n\r\n\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/542f80776368724e22cc0000#post_542f80776368724e22cc0000\r\n[bq=\"SeraphimDawn\"]\"20 Most Shocking Children’s Toys Ever Made\":https://www.youtube.com/watch?v=p4_w9TOQLYs\r\n[/bq]\r\nAt least they're not as bad as the top ten worst toys invented; if you're wondering how bad some toys are there is a actual video cheap plastic toy that you would normally find in a happy meal or such where the point of the game is to fly the planes into the world trade centers and you get more points the more you dodge anti-aircraft missiles and the more times you hit the buildings. . . No I'm not making this up either.","author":"38b55cdf63616403d7560600"},{"id":"542f8cb86368727f60ac0000","topic_id":"5161dd617f123bd25900013d","body":"\"@gasmaskangel\":/dis/the-time-wasting-thread/post/542f830063687251495c0000#post_542f830063687251495c0000\r\nHave you done anything to hinder such evil? Must be very frustrating to have all that hate and not do anything about it.","author":"52f0834d63687261cba90300"},{"id":"542f8ddc6368726aaa5f0100","topic_id":"5161dd617f123bd25900013d","body":"\"@Albus Fahrenheits\":/dis/the-time-wasting-thread/post/542f8cb86368727f60ac0000#post_542f8cb86368727f60ac0000\r\nWhen you think about it the reason why evil continues to exist in the world is that they continue to make themselves sound rational and logical.  To use a extreme example of what I mean is for ISIS they totally believe what they are doing is perfectly rational.\r\n\r\nI'm not going to lie; I'm totally looking forward to how estimates predict 5 billion people are going to be using the web by 2020.  Why?  Cause the internet is ironically both the smartest and dumbest thing ever created.  It's going to be hilarious watching ISIS people on twitter trying to rationalize themselves and they already are on twitter and it's hilarious how badly they defend their actions in a open debate.","author":"38b55cdf63616403d7560600"},{"id":"542f8e7e6368723541ac0000","topic_id":"5161dd617f123bd25900013d","body":"\"please dont drink and drive\":https://www.youtube.com/watch?v=ukjSczbmKRA&feature=youtu.be","author":"5154c5237f123bcd580002fc"},{"id":"542f8f1963687269a2150000","topic_id":"5161dd617f123bd25900013d","body":"\"@Albus Fahrenheits\":/dis/the-time-wasting-thread/post/542f8cb86368727f60ac0000#post_542f8cb86368727f60ac0000\r\nI do what I can when I can.\r\n\r\nI am of course human and therefor as limited and flawed as any other. There are times when I know, to my shame, that I have fallen for the same tricks and traps.\r\n\r\nIn my view the only ethical course is to speak out when you see these things, and I like to think that most of the time I'm able to live up to my own ideals.\r\n\r\nTo be clear I do not blame the victims of such trickery, and often even the perpetrators are just victims of previous abusers of human nature that took the terrible exploitation to heart.\r\n\r\nThat's the problem with a lot of problems, there is no one group or individual you can point to and blame for them because probably that person or group is just spouting the same terrible, evil things that they were taught by someone they had reason to believe.\r\n\r\nThis is also why I have a special, genuine hate for those who claim to speak to the dead or heal the sick through the power of God. These people have no excuse because they know, no matter how much they may lie to themselves, that they are frauds.","author":"4f41ee04945b701c41002af7"},{"id":"542f8f866368726e615d0000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/542f8ddc6368726aaa5f0100#post_542f8ddc6368726aaa5f0100\r\nThey lack exposure to any sort of outside point of view, which is something a lot of extremists seek to cultivate. A big part of any sort of indoctrination is \"the following things are evil and must never so much as be looked at for any reason, ever.\"","author":"4f41ee04945b701c41002af7"},{"id":"542f8f8e636872030b4d0100","topic_id":"5161dd617f123bd25900013d","body":"!https://i.chzbgr.com/maxW500/8334121472/hB6E67DD2/!","author":"4fde5cee945b700a970060fc"},{"id":"542f9109636872498e040100","topic_id":"5161dd617f123bd25900013d","body":"\"@gasmaskangel\":/dis/the-time-wasting-thread/post/542f8f866368726e615d0000#post_542f8f866368726e615d0000\r\n[bq=\"gasmaskangel\"]\"@uc9\":/dis/the-time-wasting-thread/post/542f8ddc6368726aaa5f0100#post_542f8ddc6368726aaa5f0100\r\nThey lack exposure to any sort of outside point of view, which is something a lot of extremists seek to cultivate. A big part of any sort of indoctrination is \"the following things are evil and must never so much as be looked at for any reason, ever.\"[/bq]\r\nAnd the funny thing is that is why they'll never actually succeed in taking over the world or such.  The only way ISIS can ever really go is a new north korea; what I mean by this is so absolutely poor that there's people starving in the streets with their leaders continuing to claim that their country is great.","author":"38b55cdf63616403d7560600"},{"id":"542f922f63687218bc460000","topic_id":"5161dd617f123bd25900013d","body":"\"@gasmaskangel\":/dis/the-time-wasting-thread/post/542f830063687251495c0000#post_542f830063687251495c0000\r\nI can't say my beliefs are absolutely right nor can you say they are wrong. \r\n\r\nIn my mind there has to be doubt or else there won't be any room for learning. Yet I am a believer for the sake of believing.\r\n\r\nIn the end it is comforting to know that there is light in the end of the tunnel. No matter how many times we fall. And I haven't lost my faith.","author":"52f0834d63687261cba90300"},{"id":"542f92af636872748df50000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/542f8ddc6368726aaa5f0100#post_542f8ddc6368726aaa5f0100\r\nI dont think they will have to bother rationalizing anything.\r\nI certainly dont think they will keep their promise to leave the west alone (taquiyya) but at the same time we need to stop playing world police. ","author":"4fe16df67f123b13e400003f"},{"id":"542f93df63687238df670000","topic_id":"5161dd617f123bd25900013d","body":"I know it's off topic, but still important to news:\r\nI think there's a very good reason why the Hong Kong protests haven't been violently cracked down yet; cause everyone and their grandmas have phones now.  The difference between Tiananmen Square is that the second China sends in the military to crack down on the protests there's going to be every last person in the world watching it live and that's going to be extremely fucking ugly for china's international diplomacy.","author":"38b55cdf63616403d7560600"},{"id":"542f953b63687218bcc00000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/542f93df63687238df670000#post_542f93df63687238df670000\r\nThe Filipinos there are reminded of the EDSA revolution.\r\n\r\nAlso, with their land-grabbing attitude on the Spratley Islands.","author":"52f0834d63687261cba90300"},{"id":"542f95e363687209af100000","topic_id":"5161dd617f123bd25900013d","body":"\"@Albus Fahrenheits\":/dis/the-time-wasting-thread/post/542f953b63687218bcc00000#post_542f953b63687218bcc00000\r\nI would not be surprised if the same thing happens in the long run.  It's pretty apparent China's scared, cause they can't violently crack down on the protests cause the whole world is watching and it's already spreading to the mainland albeit slowly.\r\n\r\nIf China does become a democracy we're talking 5-10 years from now though.","author":"38b55cdf63616403d7560600"},{"id":"542f9641636872059a220000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/542f93df63687238df670000#post_542f93df63687238df670000\r\nI think this is the chink in their Communist armor.\r\nIt would be amusing to see if this is the beginning of the end for this illegitimate dynasty.\r\n\r\nMandate of Heaven yo!","author":"4fde5cee945b700a970060fc"},{"id":"542f96d96368724b9db90000","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/542f9641636872059a220000#post_542f9641636872059a220000\r\nDon't go on thinking I hate Chinese now. In fact during highschool our gang boss is a chink.","author":"52f0834d63687261cba90300"},{"id":"542f96e66368720b35b20100","topic_id":"5161dd617f123bd25900013d","body":"\"@Albus Fahrenheits\":/dis/the-time-wasting-thread/post/542f922f63687218bc460000#post_542f922f63687218bc460000\r\nI'm not talking about faith. That's your own damn business and as much as I may dislike religion I believe it is utterly ineradicable and perhaps even necessary to the peace of mind for some people.\r\n\r\nI'm talking about people who exploit that faith. The people who say if you fill their collection plate God will heal your cancer and if it turns out he didn't then its your own damn fault for not having enough faith.","author":"4f41ee04945b701c41002af7"},{"id":"542f978463687232ae650100","topic_id":"5161dd617f123bd25900013d","body":"Bad news for Squiggy.\r\n\r\nI'm not too fond of Kiva. (The action was good, But I just couldn't get invested in anything else.)\r\n\r\nI'll try watching for a few more episodes, But I'll probably drop it soon if it can't get me invested.","author":"5062d6f17f123b3e16001184"},{"id":"542f978b6368725536950000","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/542f9641636872059a220000#post_542f9641636872059a220000\r\n[bq=\"SeraphimDawn\"]\"@uc9\":/dis/the-time-wasting-thread/post/542f93df63687238df670000#post_542f93df63687238df670000\r\nI think this is the chink in their Communist armor.\r\nIt would be amusing to see if this is the beginning of the end for this illegitimate dynasty.\r\n\r\nMandate of Heaven yo![/bq]\r\nHonestly I think the chinese communist party is scared, cause I think they know this is the end of their reign.","author":"38b55cdf63616403d7560600"}]}