{"topics":[{"id":"52f1db16636872719e050300","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/52f1cd296368720784790000#post_52f1cd296368720784790000\r\n[bq=\"Whatevs\"]\"@uc9\":/dis/the-time-wasting-thread/post/52f1ccc063687207b46b0000#post_52f1ccc063687207b46b0000\r\nlast gasp of the sizable religious faction.\r\n\r\nI have a shrewd theory.\r\nYou see, I think you can explain voting patterns as ethnic things. And Christianity is really the only mass organizer of white people, as well as being more traditional so it fits with the ostensible Republican agenda.\r\n\r\nReally, imo, both parties are left of center but that is another issue.[/bq]\r\n\r\nYou evidently haven't seen Europe's very own Special Racism. Or the Balkans. Despite everyone being white, everyone still finds reasons to hate one another based on ethnic/cultural background. Just some more than others, and the rest enough for them to snicker, but not go to war again or make a mass cultural revolution.\r\n\r\nAmerica is a special case because we ARE a nation of immigrants and there's no identity as old as the French identity, or the Spanish, or the German. So we don't got as big of national mythology, and what we have of it tends to be shared across cultural bounds to express that whole concept of the immigrant state.\r\n\r\nSo Christianity uniting the white people only really works in the US since there's no \"American\" background like there is a \"French\" background; and anyone who could claim that is now in the impoverished minority. But even within America that level of unity only goes as far as what sect of the faith is prominent in one region; Catholic, Baptist, Presbyterian, Lutheran, and on and on.\r\n\r\nThe only major divide between people as a person in this place tends to be more-so on skin color than name or where you claim you're from (and I'm sure only the recently immigrated in those cordoned off mono-cultural sections of New York and such may only care if you're from Sicily or Tuscany).","author":"4fe4bf947f123b175b000001"},{"id":"52f1df51636872431d430100","topic_id":"5161dd617f123bd25900013d","body":"\"@AaronMk\":/dis/the-time-wasting-thread/post/52f1db16636872719e050300#post_52f1db16636872719e050300\r\nI don't see how the Balkans disprove my point, they fight over ethnicity and religion.\r\nI just view voting as a stripped down way of conflict.","author":"4fe16df67f123b13e400003f"},{"id":"52f1df8b636872467ad00100","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/52f1df51636872431d430100#post_52f1df51636872431d430100\r\n\r\nAnd the Balkans are white. Or are within that sphere of white-skinned. Your previous statement made it sound like all the white-folk are united, as opposed to the \"brown\", \"Black\", and \"yellow\".","author":"4fe4bf947f123b175b000001"},{"id":"52f1dfc06368724370810100","topic_id":"5161dd617f123bd25900013d","body":"\"@AaronMk\":/dis/the-time-wasting-thread/post/52f1df8b636872467ad00100#post_52f1df8b636872467ad00100\r\nBut they still differentiate on ethnicity, they made disputes out of more minor differences than the political sphere of America.","author":"4fe16df67f123b13e400003f"},{"id":"52f1e0086368724460d70100","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/52f1dfc06368724370810100#post_52f1dfc06368724370810100\r\n\r\nYour previous statement made it sound like you were claiming all the white folk are united in one big happy family, when they are not. Or the entire European/Western community is under the same uniting banner of Christianity.","author":"4fe4bf947f123b175b000001"},{"id":"52f1e11d6368724460aa0200","topic_id":"5161dd617f123bd25900013d","body":"\"@AaronMk\":/dis/the-time-wasting-thread/post/52f1e0086368724460d70100#post_52f1e0086368724460d70100\r\nI mean America specifically","author":"4fe16df67f123b13e400003f"},{"id":"52f1e12163687242f9770200","topic_id":"5161dd617f123bd25900013d","body":"\"@AaronMk\":/dis/the-time-wasting-thread/post/52f1e0086368724460d70100#post_52f1e0086368724460d70100\r\nLook at all the shit that is happening in China. Growing riots and civil unrest. They even began having to deal with cases of terrorism on their turfs.","author":"4fde5cee945b700a970060fc"},{"id":"52f2132563687225a21b0400","topic_id":"5161dd617f123bd25900013d","body":"Where has Molestia been? The user. I don't know how to do his name <3<","author":"4fe16df67f123b13e400003f"},{"id":"52f22db0636872364cc10100","topic_id":"5161dd617f123bd25900013d","body":"Why do I get the feeling that the true reason that there are not many female protagonists written (besides a possible lack of talent) is because the writers are afraid of feminists playing Gordon Ramsay on them?","author":"50d9a3aea4c72dc9b3000120"},{"id":"52f22e7f63687234f07b0200","topic_id":"5161dd617f123bd25900013d","body":"\"@NotYourAverageLurker\":/dis/the-time-wasting-thread/post/52f22db0636872364cc10100#post_52f22db0636872364cc10100\r\nIt is an issue. But I think it has more to do with male protagonists being easier, especially for action settings.\r\n\r\nAnd I remember seeing a survey where men and women prefer a male protagonist but I can't be sure.","author":"4fe16df67f123b13e400003f"},{"id":"52f264046368727d2d690300","topic_id":"5161dd617f123bd25900013d","body":"I literally feel sick to my stomach.\r\n\r\nI've been having more and more frequent episodes lately where my stomach aches, my eyes fill with tears, I shake, quiver, can't control my legs and berate myself all at once. Somehow I manage to function in my everyday life while this is going on, but there have been occurrences where I literally can't do anything because I'm in too bad of a panic. It's mostly grade induced, and considering that my grades have been going down despite my constant studying, my parents don't really understand that. They always tell me they'll be happy with my best effort, seem to accept when I bring home the occasional seventy eight on some advanced geometry test that I still managed to fail even with the help of a tutor, feed me this \"I'm disappointed in the grade, not in you\" crap...but when the quarterly report for my grades come in, that's when shit hits the fan and suddenly I'm \"hiding tests from them\" and \"a compulsive liar\" which, yes, I did have a problem with when I was younger. My mother is the one who really pushes this, my old man just kinda sits and listens to her rant, nodding at the right moments.\r\n\r\nShe's compared me to her unloyal, law breaking, once drug addicted sister on the account that we both \"constantly lie\". She tells me that I won't get into college because my grades suck, despite me never dropping below honor role (honor roll where I'm from means your GPA is in the 85-90 range; I usually get high honor roll but with two of my grades dropping to eighty eights, well, that isn't happening). It doesn't matter that I kick ass on state mandated exams, have a 98+ average in Spanish and English, slay in my AP courses...she can't handle that I just can't do great in those courses where I can't manage to get straight As. She wants me to get to college on a scholarship, and I really don't think it's going to happen. And all the while, my teachers want me to take SAT 2s, easier than actual SATs but still require a shitload of studying, I'm trying to get at least a four on the AP exam so that's taking a lot of effort and studying, and I have to worry about whether I'm going to get into my chorus class next year because now the teacher wants to interview us, despite me being in the class for two years. And he's a hardass, so it's hard to please him. And my boyfriend's been threatening me to see the school psych about this, bless his soul, but I can't exactly say all of this. I can only write it, because by the time I got to talking about my grades I'd be a blubbering mess, incapable of talking. Plus, the school psychs don't really do anything. And the boyfriend keeps trying to make me feel better, talk me out of the sadness, but he has the intent of \"curing\" me, and it doesn't matter how many times I say that's impossible, he can't completely rid me of depression, he still thinks he can do it.\r\n\r\nSo where is this all going? I finally went up to my mum and broke down. I never do that: usually whenever I break down, she views it as me trying to get sympathy. I could only manage to say (I was sobbing too hard) that my science average dropped to an 88 because of a bad test score fucking me over, and all she did was stroke my hair, say that she would have been happy to get that grade as a kid, and comfort me. And so here I am thinking, well, that went well. And then later in the day, she apparently has some sort of fight with my father over the snow, takes it out on me, says I'm a liar who never told her about my science test and now will not allow me to go to a comic convention I was really looking forward to over my winter break. Despite me telling her about it for months, mentioning that \"there is no set date for it yet\", she claims that it is my fault I'm not going because \"you didn't put the date for it on the calendar\". I finally fucking abide in my mother because I thought maybe she could help me more than my loyal but clueless boyfriend, and this is the reward I get.\r\n\r\nI honestly think that I have some sort of sick obsession for pleasing her. I mean, I've gotten to the point that any criticism from her (\"why didn't you do the dishes, Jess? They've been done for hours!\") can start me off on the path to a total meltdown. The worst panic I ever had was when she told me that I didn't clean the dog's water dish. I started thinking about how useless I was, and how my grades were going down, and fighting, and how I can't be out with my friends anymore, and I had to stop doing my homework because, as the cherry on top, she made me correct a math test I had gotten an eighty five on, resulting in me just loosing it. I cried so much that I couldn't even see. And she never noticed.\r\n\r\nAs I'm writing this, I've completely lost control of my right shoulder. It keeps wobbling, and not from the cold. And I can't tell anyone else about this but strangers on the internet, because the love of my life doesn't understand it and my parents don't accept it. Isn't that pathetic? ","author":"5041b54f7f123b77af00a442"},{"id":"52f2678e6368726835e90000","topic_id":"5161dd617f123bd25900013d","body":"\"@And Brother I Hurt People\":/dis/the-time-wasting-thread/post/52f264046368727d2d690300#post_52f264046368727d2d690300\r\n\r\nNo, it's not.\r\n\r\nI also come from a family that has pretty high standards when it comes to grades. And you were in honest mode, so I'm gonna do the same. \r\n\r\nI have never been a model student like you, from the 5th grade all the way to highschool, it was a pain in the ass to get a decent note (I had the occasional 100 but it was far inbetween). It got to a point were I genuinely stopped caring all together and I didn't wanted to do anymore.\r\n\r\nEven to this day, I had no idea how I got back up, but I know it wasn't because of my own will alone. I know I had help. But know that I think about it, it was because I still didn't worried, I didn't let the stress to get the best of me. If I failed a subject, though luck, but there are still ways of passing it and I did just that.\r\n\r\nIf you think stress is getting the best of you at a certain moment, leave everything you are doing, immediately. Close your eyes, breath and think of something else, take your mind out of the reality just the right amount of time to get back on track and always tell yourself: \"I will pass this. Not because they tell me to, but because I know I can and no one can tell me otherwise\".\r\n\r\n","author":"4fdfbf92945b7075d50036e4"},{"id":"52f26b486368726768d50200","topic_id":"5161dd617f123bd25900013d","body":"\"@QuasarNova\":/dis/the-time-wasting-thread/post/52f2678e6368726835e90000#post_52f2678e6368726835e90000\r\n\r\nI just can't fucking wait until I get out of my house. No, I don't have some sort of rose tinted view of college life. But because I feel like if I end up getting an 88 there, I'll finally be really fucking proud, even if it wasn't a ninety.\r\n\r\nThe hell they give me about grades makes it really impossible for me to calm down. I feel like relaxing for one moment can really put me under.","author":"5041b54f7f123b77af00a442"},{"id":"52f26f4a6368724e2d5c0000","topic_id":"5161dd617f123bd25900013d","body":"\"@And Brother I Hurt People\":/dis/the-time-wasting-thread/post/52f26b486368726768d50200#post_52f26b486368726768d50200\r\n\r\n\r\nThis is a genuine advice I got from a teacher on my college freshamn year: If you were the kind of people that got mauled or chewed by your parents for failing. That's over, if you fail, be glad. Why? Because every failure you have is not meant to be as something to stress about, it means there is plenty of room for improvement and you have untapped potential that can still be used. When you fail, don't sulk and feel depressesed. Satnd up, get over it and start from scratch. If you fail again, repeat the process, but never letting negative emtions to get the best of you.\r\n\r\nI don't know if this can help you, but if it could help a loser like me, maybe it can work.\r\n\r\n\r\n","author":"4fdfbf92945b7075d50036e4"},{"id":"52f27266636872330a6b0000","topic_id":"5161dd617f123bd25900013d","body":"\"@And Brother I Hurt People\":/dis/the-time-wasting-thread/post/52f264046368727d2d690300#post_52f264046368727d2d690300\r\nNo. You're not pathetic, you're human. I wish I had something better to offer you than this, but the stress and shit doesn't last forever. And hell, from the sound of it you're a better student than I ever was.","author":"4f41ee04945b701c41002af7"},{"id":"52f276dd63687272b2500000","topic_id":"5161dd617f123bd25900013d","body":"\"@QuasarNova\":/dis/the-time-wasting-thread/post/52f26f4a6368724e2d5c0000#post_52f26f4a6368724e2d5c0000\r\n\r\nI can try it, but sort of hard to start over again when your parents are telling you that it's all over.\r\n\r\n\r\n\"@gasmaskangel\":/dis/the-time-wasting-thread/post/52f27266636872330a6b0000#post_52f27266636872330a6b0000\r\n\r\nI really, really want to be proud of my grades, I do. But I'm so used to getting them that I guess the pride just wears off after a while. It would explain why I hate getting below the average, too.\r\n\r\nI just really wish my parents wouldn't kill me for it.","author":"5041b54f7f123b77af00a442"},{"id":"52f2798f63687273703c0100","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/52f1e12163687242f9770200#post_52f1e12163687242f9770200\r\n[bq=\"SeraphimDawn\"]\"@AaronMk\":/dis/the-time-wasting-thread/post/52f1e0086368724460d70100#post_52f1e0086368724460d70100\r\nLook at all the shit that is happening in China. Growing riots and civil unrest. They even began having to deal with cases of terrorism on their turfs.[/bq]\r\nAnd what I hear about East Asia in general is that everyone hates everyone.","author":"4fe4bf947f123b175b000001"},{"id":"52f27a5b6368727261b20100","topic_id":"5161dd617f123bd25900013d","body":"\"@And Brother I Hurt People\":/dis/the-time-wasting-thread/post/52f264046368727d2d690300#post_52f264046368727d2d690300\r\nI can't believe someone who seem like such a good student with an obvious dedicationg to it, can feel that way.\r\n\r\nI wish I could relive you with something, your grades are good, I have about the same and I'm happy with them, but if you feel like your stress is pulling them down then just forget about your mother and keep in mind that your results will probably be objectively good from any normal person point of view.","author":"509129db7f123b36cb010fa5"},{"id":"52f27da763687270b3b70000","topic_id":"5161dd617f123bd25900013d","body":"\"@boz\":/dis/the-time-wasting-thread/post/52f27a5b6368727261b20100#post_52f27a5b6368727261b20100\r\n\r\nThe problem is that while I'd love to do that, it'a s little hard to forget about your mother when you end up getting an eighty eight in some course and as punishment, she makes you study that subject for two hours everyday at your kitchen table. I mean, i usually do that anyway just because I like doing it, but it stings when she won't let you leave to be with friends, or something.","author":"5041b54f7f123b77af00a442"},{"id":"52f27dff63687276ef3d0300","topic_id":"5161dd617f123bd25900013d","body":"\"Let's take a nice side-long look at Lebanon.\":http://youtu.be/A1C0izZjtfY","author":"4fe4bf947f123b175b000001"},{"id":"52f280086368727041d70100","topic_id":"5161dd617f123bd25900013d","body":"\"@AaronMk\":/dis/the-time-wasting-thread/post/52f27dff63687276ef3d0300#post_52f27dff63687276ef3d0300\r\nI think Tripoli is in Libya.","author":"4fde5cee945b700a970060fc"},{"id":"52f280bf6368725a1e2a0100","topic_id":"5161dd617f123bd25900013d","body":"\"@AaronMk\":/dis/the-time-wasting-thread/post/52f27dff63687276ef3d0300#post_52f27dff63687276ef3d0300\r\n\"Did I not tell anyone how beautiful Lebanese food looks?\":http://www.youtube.com/watch?v=Fz8wgvb1zF8","author":"4fde5cee945b700a970060fc"},{"id":"52f28e7263687240e22c0000","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/52f280086368727041d70100#post_52f280086368727041d70100\r\n\"There's a Tripoli in Lebanon.\":https://en.wikipedia.org/wiki/Tripoli,_Lebanon\r\n\r\n\r\n\"More Lebanon\":https://www.youtube.com/watch?v=CSPzoUbnRko","author":"4fe4bf947f123b175b000001"},{"id":"52f28f0163687247f5cf0300","topic_id":"5161dd617f123bd25900013d","body":"\"@AaronMk\":/dis/the-time-wasting-thread/post/52f28e7263687240e22c0000#post_52f28e7263687240e22c0000\r\nDammit!\r\nWhy do different cities have to copy the names of other cities?\r\n","author":"4fde5cee945b700a970060fc"},{"id":"52f28fb963687240e2980000","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/52f28f0163687247f5cf0300#post_52f28f0163687247f5cf0300\r\n\r\nI presume there's another Tripoli somewhere, since the name means \"Three Cities\".\r\n\r\nOfficially, the Tripoli in Lybia is the Tripoli-of-the-West, or Ṭarābulus al-Gharb.","author":"4fe4bf947f123b175b000001"}]}