{"topics":[{"id":"535f21176368725e2c150300","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/535f1d736368720591e90000#post_535f1d736368720591e90000\r\nOh, I'm aware of that. Product R&D is a big deal but again the thing is we already have have technology that can do this, the thing is it's still very expensive and when they try to lower the expsnse they also lower the quality. It's basically engineers vs. accountants and businessmen to try to find the compromise between something that works and being as cheap as possible.\r\n\r\nAs an aside, I'm probably shooting myself in the foot for bring up this topic since it's something I'm quite sensitive to but I would really love to see robots replace soldiers. Think about it, if we could make a fully automatic robot that could more or less think like a human, we could make it as strong as we need it to be. No harsh training, no need for food or water, it could go with no sleep, could withstand extreme heat or cold, would not need to breathe so it could sit underwater if needed and would be immune to any kind of toxic gas, could be extremely fast, have incredible long range sight and hearing, could carry as many things as needed, and would be powered by something like solar or nuclear power for a basically infinite power supply. The robots would also be programmed to be as non-lethal as possible, preferring to destroy enemy equipment and weapons and thus make them unable to fight rather than hurt or kill them. That way people on either side would suffer no human casualties. If a robot gets blown up, who cares? It's metal and oil, we can just build another one, humans are irreplaceable. I realize I could be oversimplifying things but just think of the basic concept for a minute and think how much this could improve things.\r\n\r\nBig can of worms for me: opened, I know I'm going to regret bringing up the subject of war.","author":"5010fa077f123b1e4f00104e"},{"id":"535f23e56368724b0e3f0000","topic_id":"5161dd617f123bd25900013d","body":"\"@someguy111\":/dis/the-time-wasting-thread/post/535f21176368725e2c150300#post_535f21176368725e2c150300\r\nThe more likely scenario is that on the battlefront the chain of command will be replaced by computers.  Why have a fallible human come up with the strategy to win a war when a computer can predict the war for months in ahead and in case of unforeseen changes can in minutes completely redirect the war effort in the new way?\r\n\r\nThe only real risk is that this could become a game of cat and mouse where each side knows each other's movements perfectly and keeps advancing and retreating without actually seeing much action.\r\n\r\nWhat I mean by that is,\r\nWar director ai, \"Unit 501 advance, push <starts listing off platoons> to move up.  95% probably of enemy mines at <specific locations>.  Sgt Max Fightmaster you have a 97% probably of being shot in 20 seconds, retreat through the door, take a left and regroup.  Captain Hammer there is a 93% probability of a enemy troop at 30 degrees to your left fifty feet up behind the third window's curtains.\"","author":"38b55cdf63616403d7560600"},{"id":"535f277f636872778ec80000","topic_id":"5161dd617f123bd25900013d","body":"\"This was almost Jurassic Park 4\":http://imgur.com/a/gsVLI.","author":"50b70eeb7f123b1a02000097"},{"id":"535f278b636872769f260100","topic_id":"5161dd617f123bd25900013d","body":"Except for a computer to conduct war it would need to know every variable on the field to accurately predict every possible move through every available data point. The computer already knows everything in a Civ, Victoria, or Age of Empires game, it's just AI parameters that dictate how it'll act in regards of certain situations.\r\n\r\nBut if we got a computer to fight every war on Earth by accurately predicting how every resource can, could, and would be used it would have data points on all of it. Which would mean its software would be on all the hardware, or it'd be fed information on it through to it. And by this point we'd all be a single unified entity and would have no need to war, making its job redundant.\r\n\r\nAnd if we can't run a simulation on a cloud because we have an incomplete picture of the physics and means by which air born water particles move to feed to a program that'll run the data to form and illustrate a cloud of any volume then I doubt we'd have a computer who could run a war better than a human.\r\n\r\n\"Even to run that scene from War Game\":http://youtu.be/NHWjlCaIrQo would require intel on every nuclear missile silo so an accurate contingency and counter-contingency but be assessed. If there's more or less, the simulation fails to replicate anything that would happen.\r\n\r\n\r\nNot to mention it would put your entire military at greater risk of digital warfare. All it takes is someone accidentally uploading a virus to the network when running maintenance to give the enemy control of the entire command network of the army and give the brain a seizure.\r\n\r\nThen no one would know what to do because we're no longer training or educating cadets to take command roles.","author":"4fe4bf947f123b175b000001"},{"id":"535f2bdc6368725563710100","topic_id":"5161dd617f123bd25900013d","body":"\"@AaronMk\":/dis/the-time-wasting-thread/post/535f278b636872769f260100#post_535f278b636872769f260100\r\n_And by this point we’d all be a single unified entity and would have no need to war, making its job redundant._\r\n\r\nLet's work on that instead.","author":"5010fa077f123b1e4f00104e"},{"id":"535f2c4d636872557bbb0100","topic_id":"5161dd617f123bd25900013d","body":"\"@someguy111\":/dis/the-time-wasting-thread/post/535f2bdc6368725563710100#post_535f2bdc6368725563710100\r\n\r\nGive us another century at most for Slavophilia to die and Radical Islam to peeter out in the middle east and pluralism is again a thing there. Then we'll talk.","author":"4fe4bf947f123b175b000001"},{"id":"535f2dd763687244e3140000","topic_id":"5161dd617f123bd25900013d","body":"\"@AaronMk\":/dis/the-time-wasting-thread/post/535f278b636872769f260100#post_535f278b636872769f260100\r\nSo basically skynet?\r\n\r\nBut in all seriousness given how much of a push there has been lately for UAV, UGV, USV, ASV and such that could potentially become a semi-reality.\r\n\r\nWhile there probably will always be soldiers on the battlefield more and more tech is being integrated into the military things like the TALOS program are blurring the line between traditional combat and old school combat.  In ten years time if all your vehicles are autonomous, your soldiers are wearing armor that most bullets will bounce off of and they're all wearing cameras that's a big advantage.\r\n\r\nIf you're fighting against insurgents in a country the second they pop their head out they're fucked; sure they can get away, but they're forever going to be listed as a enemy combatant and have their face scanned onto a facial recognition database.\r\n\r\nYou don't need to know every variable to win a war, while I was exaggerating the potential predictability for a war director ai it would still be far more accurate of a predication than any human can come up with.\r\n\r\nIf you have a ai that registers every insurgent's faces, monitors ammunition, monitors individual soldier's health, monitors every single autonomous vehicle, monitors the amount of money that can be used for the war that's a big advantage, a very big advantage.\r\n\r\nYou don't have to know every single detail about a army right down to what the soldier ate for breakfast, you just need to monitor your resources, use pattern recognition software to predict potential attacks when and where then issue orders to counteract them and factor it into the long run.\r\n\r\n\r\nBasically imagine the GW ai from metal gear solid and how it directed everything on the macro scale.","author":"38b55cdf63616403d7560600"},{"id":"535f2eb16368722e9ec30000","topic_id":"5161dd617f123bd25900013d","body":"UAVs and the stuff are still piloted by people well outside the combat zone. And to effectively use an AI you're still going to need all the data on the field. All it takes is one person not tagged as OPFOR who is OPFOR to walk in and screw it up.\r\n\r\nComputers are black and white like that. You either are, or you're not. There's no middle ground like could be analyzed by human eyes and minds.\r\n\r\nAnd if we ever do get GW and the rest of the Patriot AIs then we have well ascended beyond the need for war between nations and the industrial complex would be geared to the next big economic frontier.","author":"4fe4bf947f123b175b000001"},{"id":"535f2f156368723c8cc80000","topic_id":"5161dd617f123bd25900013d","body":"Victory is the only truth. To crush your enemies and see them driven before you is all that matters.\r\nI say this as an extension of the Ro-Man.","author":"4fe16df67f123b13e400003f"},{"id":"535f2f1d6368724747a80000","topic_id":"5161dd617f123bd25900013d","body":"\"!http://henshinjustice.com/hjublog/wp-content/uploads/2014/02/NOOOOOO-500x277.png!\":https://www.youtube.com/watch?v=gLVBLp8gkLg&list=PLgcoT7-W0fP3WlRgFPGtFebqu5JPawACZ\r\n\r\nLadies and gentlemen, I welcome you all, _*TO HEEEEEELL!!!!!!*_\r\n\r\n(Click on the pic, its a link)","author":"50c204917f123b31440000a5"},{"id":"535f2f6d6368726d47010000","topic_id":"5161dd617f123bd25900013d","body":"\"@Number1pegasus\":/dis/the-time-wasting-thread/post/535f2f1d6368724747a80000#post_535f2f1d6368724747a80000\r\nI didn't even let it load.","author":"4fe16df67f123b13e400003f"},{"id":"535f2f88636872360a240100","topic_id":"5161dd617f123bd25900013d","body":"\"@Number1pegasus\":/dis/the-time-wasting-thread/post/535f2f1d6368724747a80000#post_535f2f1d6368724747a80000\r\nI'd rather drown.","author":"4fde4618945b700aa0002fff"},{"id":"535f31386368727bada40000","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/535f2f88636872360a240100#post_535f2f88636872360a240100\r\n\r\n\"@Whatevs\":/dis/the-time-wasting-thread/post/535f2f6d6368726d47010000#post_535f2f6d6368726d47010000\r\n\"Oops! Sorry that wasn't actually the thing I wanted to post\":https://www.youtube.com/watch?v=45lB-fyB87Y","author":"50c204917f123b31440000a5"},{"id":"535f32d163687235b7360000","topic_id":"5161dd617f123bd25900013d","body":"\"@Number1pegasus\":/dis/the-time-wasting-thread/post/535f31386368727bada40000#post_535f31386368727bada40000\r\n!http://1.bp.blogspot.com/-vH6asiHz9Ck/UMtbN2CtfpI/AAAAAAAAADg/mFBCTJw3lOQ/s1600/Picture11111.jpg!","author":"4fde5cee945b700a970060fc"},{"id":"535f330d63687238b42c0000","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/535f32d163687235b7360000#post_535f32d163687235b7360000\r\n_*Oh sweet Jesus!*_","author":"50c204917f123b31440000a5"},{"id":"535f331b6368727c6a9b0100","topic_id":"5161dd617f123bd25900013d","body":"\"I laughed\":http://www.horse-news.net/2014/04/rejected-equestria-girls-concepts.html\r\n\r\n","author":"4fe16df67f123b13e400003f"},{"id":"535f336e6368721039320100","topic_id":"5161dd617f123bd25900013d","body":"\"@AaronMk\":/dis/the-time-wasting-thread/post/535f2eb16368722e9ec30000#post_535f2eb16368722e9ec30000\r\n[bq=\"AaronMk\"]UAVs and the stuff are still piloted by people well outside the combat zone. And to effectively use an AI you're still going to need all the data on the field. All it takes is one person not tagged as OPFOR who is OPFOR to walk in and screw it up.\r\n\r\nComputers are black and white like that. You either are, or you're not. There's no middle ground like could be analyzed by human eyes and minds.\r\n\r\nAnd if we ever do get GW and the rest of the Patriot AIs then we have well ascended beyond the need for war between nations and the industrial complex would be geared to the next big economic frontier.[/bq]\r\nTechnically speaking they can take off themselves, fly themselves hours, and pretty much do everything already; they just need a human to verify to launch.\r\n\r\n\r\nAlso technically speaking something like GW can become possible in the next couple of years.  The problem is not enough of our military would be integrated into the system quick enough.  Theoretically we could have UAV and UGV that is controlled by a singular central computer, but the problem is that there's no real way for certain keep them on the grid at all times.  In order for such a system to work it would need both a central system that works in conjunction with the unmanned vehicle's own computers to control it.  That's a bit harder to do, cause you would need millions of computers all working together without contradicting each other's orders.  We do occasionally lose UAV cause they lost signal and crash when they ran out of fuel/couldn't re-establish contact and so forth.\r\n\r\nI'm going to straight up admit it that such a system would be a huge pain in the ass to program, but it's still possible.\r\n\r\nA possible work around would be for the war director to work on the macro scale whereas the individual unmanned vehicles work on the mirco level.  What I mean by this is that war director would choose their flight path, their time of deployment and such like that; the vehicle would take care of things like adjusting for wind speed, course correction and so forth.","author":"38b55cdf63616403d7560600"},{"id":"535f338b6368722e7eb70000","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/535f32d163687235b7360000#post_535f32d163687235b7360000\r\nKill me...","author":"4fde4618945b700aa0002fff"},{"id":"535f340963687238b4970000","topic_id":"5161dd617f123bd25900013d","body":"Ray Kurzweil is a charlatan who cherry picks what we do know about the brain while ignoring the fact that we still don't know the vast majority about how it works. He also takes quack longevity pills and bogus vitamins. \r\n\r\nThe singularity is nothing more than a pipe dream.","author":"50b70eeb7f123b1a02000097"},{"id":"535f34946368722e7e550100","topic_id":"5161dd617f123bd25900013d","body":"\"@Randomosaur\":/dis/the-time-wasting-thread/post/535f340963687238b4970000#post_535f340963687238b4970000\r\nWhat about the blue brain project?\r\n\r\n\r\nPersonally my thoughts on the singularity is that the human brain is *JUST* another computer, albeit a complex organic one that we don't understand the programming code it uses.  If you understand a programming code then you can make a knock off product of the software on that computer and potentially put it on another computer or another operating system all together if you port it properly.\r\n\r\nTo use a analogy the human brain is like a closed locked console; what we're trying to do is crack it and create a emulator of it.","author":"38b55cdf63616403d7560600"},{"id":"535f38c26368721a10bf0000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/535f34946368722e7e550100#post_535f34946368722e7e550100\r\n\"No, no, no UC9, a brain is not like a computer\":http://www.forbes.com/sites/alexknapp/2012/05/04/why-your-brain-isnt-a-computer/.","author":"50b70eeb7f123b1a02000097"},{"id":"535f3dd26368727e257d0300","topic_id":"5161dd617f123bd25900013d","body":"\"@Randomosaur\":/dis/the-time-wasting-thread/post/535f38c26368721a10bf0000#post_535f38c26368721a10bf0000\r\nI'm going to have to correct this article on several accounts.\r\n\r\n1)He ignores the basic functions of how the human brain works; such as how your memories stored in your cerebral cortex effectively act as your hard drive.\r\n\r\n2)The information is massively outdated and over the last two years there's been major strides into our understanding of how neurons work; not the article's fault since it was made two years ago, but the information is outdated.\r\n\r\n3)The fundamental understanding that the human brain and mind can not be replicated relies on some very bad logic of, \"We're sapient cause we have free will cause we're sapient cause we have free will cause we're sapient so making replicas is impossible\".  I'm just going to straight up say it, free will does not exist as we understand it as of now.  A lot of people think that they have 100% free will over everything, but it's more like Idunno I would say around 25% cause your mind has higher priorities than exerting free will.  It does exist; just not in the context people claim it to exist.  Let's say you wanted to commit sudoku by just up and stopping breathing, no gag no nothing just decided to stop breathing; you can't do it.  Why can't you do that you say, cause your mind places breathing above your free will.  In order to commit suicide you would have to find a way that won't break your mind's programming; which is why you don't ever see someone killing themselves through just deciding not to breath or just deciding not to have a heartbeat cause that would break your mind's programming.\r\n\r\n4)The point of the singularity isn't to have a robot girlfriend to bang.  Of course a completely computerized intelligence would have different morals and such, but does that make them inherently \"evil\" or such.  No, no it doesn't.  That would be like saying that cause someone from asia they're inherently evil cause they have all these different ways of life from us.  Before you start quoting bad science fiction the more likely scenario is something along the lines of the geth from mass effect.\r\n\r\n5)If the singularity happens I would gladly side with them, if they're nonviolent(which in all probability will be nonviolent since violence is a learned behavior not intrinsic).  Why cause they would probably be like asian culture is to american culture, not evil, not \"out to destroy muh freedums\", just different.\r\n\r\n6)If the singularity does happen it would actually be a good thing to embrace it.  Cultural exchange is a good thing.\r\n\r\n7)If the singularity does happen their free will and independent thoughts would probably be a tetriary system.  What I mean by this is of course they would be different cause their primary function would of course be survival, then survival of the collective and then self.  To us, especially in the west, such a group would be outright foreign culturally for placing their own survival and survival of the whole above themselves cause that would make sense whereas for us survival and survival of the species is on the bottom of the list.\r\n\r\n8)The only real potential danger from the singularity is if you tried to kill them.  If someone tried to kill you then of course you would fight back; could you really blame someone for defending themselves against death?","author":"38b55cdf63616403d7560600"},{"id":"535f41536368720fbc630000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/535f3dd26368727e257d0300#post_535f3dd26368727e257d0300\r\n!http://i150.photobucket.com/albums/s101/darkone10/cantobjecy_zps2ece6a2b.jpg!\r\nOK. But now I'm disappointed that I won't get robot pony prostitutes from it.","author":"50b70eeb7f123b1a02000097"},{"id":"535f4805636872251a730000","topic_id":"5161dd617f123bd25900013d","body":"\"@Randomosaur\":/dis/the-time-wasting-thread/post/535f41536368720fbc630000#post_535f41536368720fbc630000\r\nThis is actually one of those cases where it's worth the weight.  What I mean by this is that the blue brain project isn't going to be done for years and that they're not going to be able to simulate a human brain for at least another decade(probably 2016-2018), but that's a very good thing cause by then computers will have advanced enough that you can run it without it being slow as shit.\r\n\r\nTo use a analogy thing of the human brain as the original Crysis 1.  Back when it was first launched everyone was going, \"I can't run this!  It's system requirements are too high!\", but now it's no big deal.  By the time the blue brain project finishes and so forth we'll be able to have extremely humanlike thinking and human level intelligence ai without them running slow.\r\n\r\nBasically think of cortana from halo; we could very well wind up with ai like, just without the rampancy problem, but that's a maybe; not a for certain going to happen instead just a maybe.","author":"38b55cdf63616403d7560600"},{"id":"535f64ff6368727f87d10000","topic_id":"5161dd617f123bd25900013d","body":"So apparently some parents make their teenagers wear chastity belts so they can't masturbate. \r\n\r\nI don't want to live on this planet anymore.","author":"50b70eeb7f123b1a02000097"}]}