{"topics":[{"id":"52d8a4e4636872616e040000","topic_id":"5161dd617f123bd25900013d","body":"\"@Ore-O\":/dis/the-time-wasting-thread/post/52d8a42b6368724e982e0400#post_52d8a42b6368724e982e0400\r\n!http://i0.kym-cdn.com/photos/images/original/000/679/417/625.jpg!","author":"38b55cdf63616403d7560600"},{"id":"52d8a53d6368726538180000","topic_id":"5161dd617f123bd25900013d","body":"You know, I like bacon.\r\n\r\nBut its memetic status irks me to no end.","author":"4fddff15945b706cf6000520"},{"id":"52d8a878636872673ad90100","topic_id":"5161dd617f123bd25900013d","body":"\"@AaronMk\":/dis/the-time-wasting-thread/post/52d89d376368724791550400#post_52d89d376368724791550400\r\nThat sucks man.","author":"4f41ee04945b701c41002af7"},{"id":"52d8ea8f6368720304360100","topic_id":"5161dd617f123bd25900013d","body":"To throw in some provocative statements into that Religion talk: Jesus was just a big hippy, so I see no reason to take his teachings seriously myself.\r\n","author":"4fe16df67f123b13e400003f"},{"id":"52d8ed4b63687206dbbe0200","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/52d8ea8f6368720304360100#post_52d8ea8f6368720304360100\r\nHe seemed like a pretty nice person; although if he was around today chances are he would get crucified anyhow regardless of how much times have changed.\r\n\r\nI may be a different religion now, but even I have to respect such a individual.\r\n\r\nThe problem is though his messages about forgiveness and the idea of \"he who lives by the sword dies by the sword\" and such are still massively unpopular beliefs even for christians.  If he was alive today he would get gut shot by a angry person yelling about he's a, \"hippy commie out to destroy 'murrica\".","author":"38b55cdf63616403d7560600"},{"id":"52d8edcd63687203049b0200","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/52d8ed4b63687206dbbe0200#post_52d8ed4b63687206dbbe0200\r\nAnd good.","author":"4fe16df67f123b13e400003f"},{"id":"52d8f125636872246a220000","topic_id":"5161dd617f123bd25900013d","body":"Well this thread took some.... turns of events.","author":"50c204917f123b31440000a5"},{"id":"52d95e5c636872435d630100","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/52d8ea8f6368720304360100#post_52d8ea8f6368720304360100\r\n\r\nFunnily enough, I had a discussion with a friend of mine about an alternate history wher Jesus wasn't put on the cross.\r\n\r\nWe concluded that past 40 he would have burned out, turning into the Classical-era Ted Nugent. Going on to fire arrows into the air outside the Hippodrome and riffing on Samaritans and other non-Jews/Romans.\r\n\r\nUltimately, Christianity would become more violent and nutty, and Islam would be more of a \"we're tired of your shit, Rome\" perspective. Mohhamad would teach more along our-Jesus and beat-poem alternate-Jesus out of the equation before unfortunately dying by being plowed over by a woman driving a camel; this then becoming the new symbol of Islam.\r\n\r\nAnd all Jihads were fought be deploying rigged out, SUV-like camels directed by women.","author":"4fe4bf947f123b175b000001"},{"id":"52da9932636872032d3c0400","topic_id":"5161dd617f123bd25900013d","body":"So today, my Muslim friend discovered that, by the rules of her religion, she's not allowed to talk to men.\r\n\r\nShe had lived years not knowing this, and after a strange turn of events, an argument with her mother ended in \"What?! You want to visit a _man_ in a _cafe?_ (for the record, no, no she didn't) You're not even allowed to talk to boys, it's a sin!\"\r\n\r\nAnd this has absolutely devastated my friend. Many of her friends are guys, and she has no intention to stop talking to them. She's had to change names in her phone's address book (example: Carlos to Carla) because she's afraid her mom will check her phone - every message that my friend sends gets forwarded to her mother's phone; she's had to download apps like Kik to get around this. And this is the same woman who accused her daughter of being a lesbian because a female friend texted her \"love you!\" on her birthday.\r\n\r\nIt fucking kills me, because here's a girl who's really dedicated to her religion. Loves going to the mosque, prays at the right times, all of it. And there's sections of it that she doesn't agree with: she doesn't wear a hijab, and her mom doesn't force her to. But this is the one part she won't bend on, and it's starting to cut into my friend's social life. There's a club that she loved to attend, and her mother saw her talking a guy there: now she's not allowed to come anymore. Because, according to her mom, \"I didn't think you'd actually talk to the guys!\"\r\n\r\nWhere am I going with this? It sucks to see someone so dedicated to something, but want to change parts of it because, let's face it, some of it is outdated, and have their mom crack down on it and treat her own daughter like she's a package of sins.  ","author":"5041b54f7f123b77af00a442"},{"id":"52da9a2d6368721477380000","topic_id":"5161dd617f123bd25900013d","body":"\"@And Brother I Hurt People\":/dis/the-time-wasting-thread/post/52da9932636872032d3c0400#post_52da9932636872032d3c0400\r\nThat's a very silly thing to make a sin out of.","author":"4fddff15945b706cf6000520"},{"id":"52daaa5d6368723b18050000","topic_id":"5161dd617f123bd25900013d","body":"\"@And Brother I Hurt People\":/dis/the-time-wasting-thread/post/52da9932636872032d3c0400#post_52da9932636872032d3c0400\r\n\r\nShe must have some hyper-ass-Orthodox parents, because I couldn't find shit on that when scanning my own copy of the Koran for anything like that.\r\n\r\nJust phrases about dressing modest, and at most the affirmation of marriage being more a contract of financial stability between a man and one or more girls. But in so far as I can tell: they should be able to talk.\r\n\r\nUnless this is part of the Hadiths (which are fairly secondary), which I don't own.","author":"4fe4bf947f123b175b000001"},{"id":"52dab3236368723a7d220300","topic_id":"5161dd617f123bd25900013d","body":"\"@AaronMk\":/dis/the-time-wasting-thread/post/52daaa5d6368723b18050000#post_52daaa5d6368723b18050000\r\n\r\nSomething about it seems fishy to me. Considering that she's not allowed to date, she's basically being forced into the family business, and all around isn't going to escape from her family any time soon, hey, it wouldn't surprise me if her mom made some shit up. \r\n\r\nIs it possible that it's a rule in a certain sect of Islam?","author":"5041b54f7f123b77af00a442"},{"id":"52dab49e6368723aa20c0000","topic_id":"5161dd617f123bd25900013d","body":"\"@And Brother I Hurt People\":/dis/the-time-wasting-thread/post/52dab3236368723a7d220300#post_52dab3236368723a7d220300\r\n\r\nAs far as I know, there are two sects of Islam that could be considered fundie as shit: Salafists and Wahabists. I think the Wahabi are the more conservative, so probably them.\r\n\r\nOtherwise, there are the Sunni and Shia. But those two are only different in regards to a succession feud over the Caliphate that's been running for too god-damn long (over a thousand years at this point). Then we got the under appreciated Suffis who place more emphasis on Islam's spiritualism than anything, and they like to spin.\r\n\r\n\r\nBut I have a friend who managed to date an Imam's daughter despite being non-Muslim. So I suspect there's something going on.","author":"4fe4bf947f123b175b000001"},{"id":"52dab8566368723b26200100","topic_id":"5161dd617f123bd25900013d","body":"\"@AaronMk\":/dis/the-time-wasting-thread/post/52dab49e6368723aa20c0000#post_52dab49e6368723aa20c0000\r\n\r\nIt sucks to see a parent so hellbent on controlling their daughter's life (she's done more shit, but out of respect, I won't say what) that they use a religion that their own child finds comfort in as a leash.","author":"5041b54f7f123b77af00a442"},{"id":"52dabd6963687234420e0000","topic_id":"5161dd617f123bd25900013d","body":"\"@And Brother I Hurt People\":/dis/the-time-wasting-thread/post/52dab8566368723b26200100#post_52dab8566368723b26200100\r\nSome people are just total control freaks.\r\n!http://static3.wikia.nocookie.net/__cb20110319022707/marvel_dc/images/2/29/Control_Freak_Teen_Titans.jpg!","author":"513e68eda4c72d4e3b000164"},{"id":"52dada5c6368720af5480000","topic_id":"5161dd617f123bd25900013d","body":"Dinh AaronMk: I'm tempted to mod CK2 where cities are renamed \"Hoods\" or something, temples are Suburbia, and castles are Prisons\r\n<friend>: lol\r\nDinh AaronMk: And if not rename cities \"hoods\", they become Detroits.\r\nDinh AaronMk: Or Compton\r\n<friend>: Everywhere is detroit\r\n","author":"4fe4bf947f123b175b000001"},{"id":"52dae8a36368725bebab0200","topic_id":"5161dd617f123bd25900013d","body":"\"@AaronMk\":/dis/the-time-wasting-thread/post/52dab49e6368723aa20c0000#post_52dab49e6368723aa20c0000\r\nThere are more differences than that.  One os more violent than the other. I think sunni.","author":"4fe16df67f123b13e400003f"},{"id":"52daec6863687208e3ab0000","topic_id":"5161dd617f123bd25900013d","body":"\"@AaronMk\":/dis/the-time-wasting-thread/post/52dada5c6368720af5480000#post_52dada5c6368720af5480000\r\nIf everywhere is truly Detroit, then it would be Gotham City everywhere.","author":"513e68eda4c72d4e3b000164"},{"id":"52dafb5963687261cf5c0200","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/52dae8a36368725bebab0200#post_52dae8a36368725bebab0200\r\n\r\nThe Sunni-Shia feud has been going on for so long I'd stick to the idea that none are more violent than the other. It all gets blurred in the prolonged conflict, and further muddled with with the inclusion of Cold War-era politics that has fucked the Middle East up as it has.","author":"4fe4bf947f123b175b000001"},{"id":"52db08b163687202103b0000","topic_id":"5161dd617f123bd25900013d","body":"You know what would be the first step into overthrowing the North Korean dictatorship?\r\n\r\n\r\nSmuggle some Flamin' Hot Cheetos and Doritos to it's hungry population. Get them hooked on the stuff, make them fight for it. Just like how the Brits got the Chinese addicted to opium.\r\n\r\n!http://fc03.deviantart.net/fs70/f/2012/364/a/0/moustache_pinkie_pie_by_jackos92-d5posyw.png!","author":"4fde5cee945b700a970060fc"},{"id":"52db4da76368720733250200","topic_id":"5161dd617f123bd25900013d","body":"I would have less problems if I were physically aggressive and less morally sound.\r\n\r\nI guarantee a good half of my issues would evaporate on the spot, and the other half would shrivel up and be dead within a week.\r\n\r\nI feel my family is massively hypocritical regarding religion. If asked we will all say Christian, despite doing absolutely nothing resembling Christian values. And I would say it only because the few times I have brought it up with my mother, it's proven the most direct route to turning her into \"Shrieking Self-righteous Embodiment of Intolerance\".\r\n\r\nI'm not sure if this is the best place for personal Bs, but there you go.","author":"4fddff15945b706cf6000520"},{"id":"52db701b63687217ceff0100","topic_id":"5161dd617f123bd25900013d","body":"I haven't watched Frozen yet but I saw a really good piece of art of Elsa.\r\n!http://i2.kym-cdn.com/photos/images/newsfeed/000/680/697/e72.jpg!","author":"50d9a3aea4c72dc9b3000120"},{"id":"52db775163687201c1d80000","topic_id":"5161dd617f123bd25900013d","body":"\"@NotYourAverageLurker\":/dis/the-time-wasting-thread/post/52db701b63687217ceff0100#post_52db701b63687217ceff0100\r\nIs there an anime-style version of her anywhere?","author":"4fde5cee945b700a970060fc"},{"id":"52db77fb63687201c1100100","topic_id":"5161dd617f123bd25900013d","body":"\"@NotYourAverageLurker\":/dis/the-time-wasting-thread/post/52db701b63687217ceff0100#post_52db701b63687217ceff0100\r\n\r\nIt's like J Scott Cambell decided to draw her. I like it!\r\n\r\nYou should go see the movie. It's really good.","author":"500757fd7f123b75a90003b1"},{"id":"52db788c63687205b6320100","topic_id":"5161dd617f123bd25900013d","body":"\"@NotYourAverageLurker\":/dis/the-time-wasting-thread/post/52db701b63687217ceff0100#post_52db701b63687217ceff0100\r\n\r\nShe looks like... Emma Frost... We've come full circle I guess xD","author":"4fdfbf92945b7075d50036e4"}]}