{"topics":[{"id":"532e732163687271b9030000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/532e72966368727487d80000#post_532e72966368727487d80000\r\n\r\nChange the names to you and Whatevs and you got yourself a deal","author":"4fdfbf92945b7075d50036e4"},{"id":"532e74306368723babd90200","topic_id":"5161dd617f123bd25900013d","body":"\"@QuasarNova\":/dis/the-time-wasting-thread/post/532e732163687271b9030000#post_532e732163687271b9030000\r\nDon't worry that ship is in my secret luggage compartment.  No one will ever guess the combination though.","author":"38b55cdf63616403d7560600"},{"id":"532e74b763687272b95b0000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/532e74306368723babd90200#post_532e74306368723babd90200\r\n\r\nThen I solemnly swear I didn't saw anything. I didn't saw you playing with the figurines of a wedding cake, and they weren't in any way related to yuri scenarios.","author":"4fdfbf92945b7075d50036e4"},{"id":"532e753e63687224d1290000","topic_id":"5161dd617f123bd25900013d","body":"\"@QuasarNova\":/dis/the-time-wasting-thread/post/532e74b763687272b95b0000#post_532e74b763687272b95b0000\r\nGOOD!\r\n(door closes)","author":"38b55cdf63616403d7560600"},{"id":"532e761e63687225444d0000","topic_id":"5161dd617f123bd25900013d","body":"\"Anyone agree with this?\":https://www.youtube.com/watch?v=T24DPU-hkJM","author":"4fde5cee945b700a970060fc"},{"id":"532e76bb6368724a9e1f0000","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/532e761e63687225444d0000#post_532e761e63687225444d0000\r\nPretty much; I'm having to go back to college to get a degree that is actually worth something.  Advertising has taken a huge shit and in only a couple years won't even exist.  That's why only a couple degrees are worth it and most colleges and degrees are utterly full of shit.\r\n\r\n\r\nAlso found this\r\n!http://i3.kym-cdn.com/photos/images/original/000/721/944/9e8.jpg!","author":"38b55cdf63616403d7560600"},{"id":"532e791f6368721547310000","topic_id":"5161dd617f123bd25900013d","body":"So I spent an hour and a half drawing an anthro-pone.\r\n\r\nI think this is leading into a fine first.","author":"4fe4bf947f123b175b000001"},{"id":"532edec96368723fbda00300","topic_id":"5161dd617f123bd25900013d","body":"Have you guys ever created your own fictional universe?\r\nSomething original and stuff.\r\n\r\nMine was a dystopian post-apocalyptic future where the world is ruled by seven different cities called Capitols and each ruled by two consul members.\r\nThere's a race called Symbiotes that each have these awesome powers to do their exposure to a black-coloured alien living goo called Parasites.","author":"4fe1b9f47f123b13df002976"},{"id":"532eeaa66368723828d20100","topic_id":"5161dd617f123bd25900013d","body":"\"@HJSDGCE\":/dis/the-time-wasting-thread/post/532edec96368723fbda00300#post_532edec96368723fbda00300\r\n\r\nSo, is about Venom in the Fist of the North star universe.","author":"31bee2686368722a0df23600"},{"id":"532eebf363687252fc3d0100","topic_id":"5161dd617f123bd25900013d","body":"\"@HJSDGCE\":/dis/the-time-wasting-thread/post/532edec96368723fbda00300#post_532edec96368723fbda00300\r\nOh yes, many times and many quite complicated.\r\n\r\nFor instance I've got one where its your typical high fantasy world, at least until the industrial revolution hit. This isn't a \"magic goes away\" sort of scenario either. Magic is still working fine and dandy in this world, and in fact magic users have become aristocrats who look down on people who need to rely on \"crude and base machinery\" for a living.\r\n\r\nElves are particularly dickish about this.\r\n\r\nOrcs and goblins are all cockney and make up the overwhelming majority of the working class, humans are just sort of around, and dwarves and gnomes have become quite wealthy either supplying ore or building new gadgets.","author":"4f41ee04945b701c41002af7"},{"id":"532ef61b6368727ac1550000","topic_id":"5161dd617f123bd25900013d","body":"\"@Gizoid101\":/dis/the-time-wasting-thread/post/532eeaa66368723828d20100#post_532eeaa66368723828d20100\r\nKinda...\r\nExcept that they don't make you look like Venom or Carnage.\r\nInstead, they look like how they've always been like.\r\nThe only change would be their mental and physical attributes.\r\nYou'll still look human, but have awesome super powers (and a second voice in your head).","author":"4fe1b9f47f123b13df002976"},{"id":"532f16a26368720bcb4a0100","topic_id":"5161dd617f123bd25900013d","body":"\"@HJSDGCE\":/dis/the-time-wasting-thread/post/532edec96368723fbda00300#post_532edec96368723fbda00300\r\nOnce. It was a generic dystopia future that was a rip off of City 17, and had a completly black girl (and I don't mean as in race) called Correr as it's daaarrk and edgy defender. \r\n\r\nIt pretty much ripped off elements of Naruto and every dystopia ever.\r\n\r\n\r\nThe other one I did was a land called Nod where the people are more or less hippies that love  rock n roll. But a bunch of highish tech, pompous velociraptor Englishmen nobles banned rock and were general dicks. It had robots and steampunk and such. And the hero was some guy called Jeremy Bon Jovi, who freed the world through the power of rock.\r\n\r\n...I still like the second one.\r\n","author":"500757fd7f123b75a90003b1"},{"id":"532f36b763687223f54a0000","topic_id":"5161dd617f123bd25900013d","body":"\"@HJSDGCE\":/dis/the-time-wasting-thread/post/532edec96368723fbda00300#post_532edec96368723fbda00300\r\nDude; I would win this competition hands down, but it would take me pages to describe.\r\n\r\n\r\n\r\nSide note:\r\nOh for fucks sakes news can't you for once get what you're citing correct?  Does anyone else know who nate silver is?  Well the news is citing him again, but they're not even quoting him right.  This time it has to do with the 2014 elections; short version is ten tossup seats and that on average each party has a 25% chance of taking each seat with the remaining percentage being unclear, but the news just jumped the gun again.  They're saying the gop will win one billion billion seats or that democrats will win a trillion trillion seats.\r\n\r\nI'm annoyed cause they can't even get basic fucking third grade level math right.\r\nI feel as though if you sat a 24/7 news anchor down in front a third grade math test and the teacher asked them, \"Okay if you have a hundred seats and someone takes fifty how many do you have left?\" chances are the news anchor would respond with, \"A gagillion!\"\r\n\r\n\r\nWell natalia found out she's popular on the internet:\r\n!http://i0.kym-cdn.com/photos/images/original/000/722/291/d18.jpg!","author":"38b55cdf63616403d7560600"},{"id":"532f4bb56368723f71630000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/532f36b763687223f54a0000#post_532f36b763687223f54a0000\r\nShe seemed a bit shy, but was apparently alright with it. I guess it she accepts the fact that it is only natural something like this to happen.\r\n\r\n\"This should be Derpy's theme\":https://www.youtube.com/watch?v=Wb023QXyjec","author":"4fde5cee945b700a970060fc"},{"id":"532f4e926368724f0d350100","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/532f36b763687223f54a0000#post_532f36b763687223f54a0000\r\nOn Know Your Meme she's topping MLP, Twitch Plays Pokemon AND Kill la Kill in gallery views.","author":"515ddf93a4c72d8a1f000d57"},{"id":"532f53d96368724b18810000","topic_id":"5161dd617f123bd25900013d","body":"\"@ThatRandomGuy42\":/dis/the-time-wasting-thread/post/532f4e926368724f0d350100#post_532f4e926368724f0d350100\r\nSo?\r\nWho says memes couldn't crossover?","author":"4fde5cee945b700a970060fc"},{"id":"532f54846368724ab3820000","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/532f4bb56368723f71630000#post_532f4bb56368723f71630000\r\nUkrainian women are more reserved from what I understand. According to guys from the Navy who travel a lot (outside the Navy, I just know them because they were reenlisting in the Navy)","author":"4fe16df67f123b13e400003f"},{"id":"532f7f1763687211cf010000","topic_id":"5161dd617f123bd25900013d","body":". . . Well fook me.\r\nRussia has stationed a lot of soldiers on the ukraine border. . and I mean a metric fuckton.  Who wants to bet this is going to end badly?","author":"38b55cdf63616403d7560600"},{"id":"532f81ea63687247943e0000","topic_id":"5161dd617f123bd25900013d","body":"*DISCLAIMER: I wrote this just after I got home from work and I'm fucking exhausted so this is going long winded, rambling, and really, really dumb.* \r\n\r\nSo everyone pretty much agrees that copyright law needs to be reworked, but I very rarely see anyone proposing how it should be fixed. I can't go into actual legalism since I'm pretty much as far from an expert on the law as you can get, I'm just an opinionated asshole.\r\n\r\nFirst we need to understand the key word of Intellectual Property, and that is property. I am now going to paraphrase heavily from one of my favorite books, the left libertarian farce Illuminatus!\r\n\r\n1. Property is theft.\r\n2. Property is liberty.\r\n\r\nThis seems like a contradiction, but is not. People simply fail to understand that there are to sorts of property, and the way to tell which sort of property is which is fairly easy.\r\n\r\nIf the given property is the sort that would be respected by any rational, non criminal individual, then it is property 2, and represents liberty. Examples would be things that you personally buy like a book or a dvd which are now yours to dispose of as you please, or things that you personally create.\r\n\r\nIf a given property is not the sort that would be respected by a rational, non criminal individual and in fact the only way to have it respected is through force or the threat of force then that property is property 1, and represents theft.\r\n\r\nAnd here we get to copyright law. As it currently stands the laws are heavily weighted in favor of property 1. Massive corporations own the legal rights to works that are so goddamn old its hilarious, long since anyone involved in the actual creation of that work has died, or is able to take a creators work away from them through use of complicated contracts. They are able to crush works that neither claim owner ship of the property or profit from it (parodies, reviews, ect.) and frequently do so.\r\n\r\nWhat's more the law allows them to restrict activities that are entirely legal. DRM only hurts the honest customers, the MPAA and RIAA don't want you to ever use any of their properties in a creative way, and all in all it is a classic FUBAR situation.\r\n\r\nNow what can be done about this? Well copyright needs, first and foremost, to protect the actual creators of the content. Again, I am not a legal expert at all so I have no idea how this would be structured to protect groups while still not fucking property 2 in the ass. Secondly, we need copyright law to clearly define and protect consumer rights, and the rights to create commentary, review and parody of the works, and it needs to be done in such a way that proof of violation of copyright is required before even a C&D order can be issued. Burden of proof needs to lie with the accuser, and as the law stands now this is true if the case gets to court but even before it gets that far now a C&D will result in party being hit with it losing time and money which can easily cripple small, independent artists.\r\n\r\n*TL;DR:* Martians abducted and replaced every US president since Jefferson as part of a plot to dominate our pitiful mudball planet.","author":"4f41ee04945b701c41002af7"},{"id":"532f83816368724a5b580000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/532f7f1763687211cf010000#post_532f7f1763687211cf010000\r\nThey should just let the Crimean themselves decide their path.","author":"4fde5cee945b700a970060fc"},{"id":"532f84ca6368726188610100","topic_id":"5161dd617f123bd25900013d","body":"\"@gasmaskangel\":/dis/the-time-wasting-thread/post/532f81ea63687247943e0000#post_532f81ea63687247943e0000\r\nYeah, but we got to make sure the law gets reworked in \"the good way\", not another \"update\" like the DMCA BS that the government and mega corporations came up with to \"adapt\" to the 21st century. And in order to do that, those internet illiterate old people in congress and business must GO!","author":"4fde5cee945b700a970060fc"},{"id":"532f8506636872487e120100","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/532f83816368724a5b580000#post_532f83816368724a5b580000\r\nThe number one sign that someone is a idiot in politics is when someone thinks they should do the thinking for others.\r\n\r\nIf putin does annex eastern ukraine bye bye russian economy cause that's going to piss everyone off.  Pissing off everyone = sanctions = massive reduction in trade = poof goes the economy\r\n\"@gasmaskangel\":/dis/the-time-wasting-thread/post/532f81ea63687247943e0000#post_532f81ea63687247943e0000\r\nThe irony is that private copyright infringement doesn't hurt companies, corporate copyright infringement does though.  So companies are getting worked up by nothing when other companies stealing their products hurts them far worse than any private individual solely stealing their product and yet rarely is corporate infringement prosecuted.","author":"38b55cdf63616403d7560600"},{"id":"532f8fcc636872624d840000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/532f8506636872487e120100#post_532f8506636872487e120100\r\nThe reason for that is both sides have entire battalions of lawyers. Effectively it is a microcosm of the current geopolitical landscape, where you only attack people not capable of retaliating in any meaningful way.","author":"4f41ee04945b701c41002af7"},{"id":"532f93a16368725b42ef0200","topic_id":"5161dd617f123bd25900013d","body":"GUYS!\r\n\r\n12 MONTHS HAVE PASSED!\r\n","author":"4fdfbf92945b7075d50036e4"},{"id":"532f94826368724da0210000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/532f8506636872487e120100#post_532f8506636872487e120100\r\nYeah, and the west will essentially disrespect the wishes of much of the actual inhabitants of that region.\r\nIt will only validate Putin's claim that the west has some serious double standards. Besides, Russia's places like got China to back them up, economically.\r\nIf the US has the rights to make demands on other nations, so should every other major powers.\r\n\r\nThat's equality.","author":"4fde5cee945b700a970060fc"}]}