{"topics":[{"id":"52d754816368723459c40100","topic_id":"5161dd617f123bd25900013d","body":"As an irrelevant side-note: I do fucking love how angsty self-described atheists only seem to perceive religion in the Christian or Abrahamic sense.\r\n\r\nNever mind there are other major theologies with widely differing moral concepts, cosmologies, and shit. No one ever tries to denounce Buddhism it seems.\r\n\r\nIt makes me feel like brushing up on the cosmology and morality in Zoroastrianism so I can bust down doors by going, \"Well actually...\" and starting talking like the Christian-oriented people are wrong, and not just the Atheists.\r\n\r\nBecause Zoroastrianism is fun like that. Ahura Mazda don't care really, all he did was make everything and as then put his time into fighting Angra Mainyu. Everything else is up to you, you may be punished for it during your life, and you better certainly define your shit by action and not talking about it. ","author":"4fe4bf947f123b175b000001"},{"id":"52d75ad86368723970d60000","topic_id":"5161dd617f123bd25900013d","body":"\"@AaronMk\":/dis/the-time-wasting-thread/post/52d754816368723459c40100#post_52d754816368723459c40100\r\nTere are atheists who don't even believe in science.","author":"4fde5cee945b700a970060fc"},{"id":"52d75bb4636872388e030100","topic_id":"5161dd617f123bd25900013d","body":"\"@AaronMk\":/dis/the-time-wasting-thread/post/52d754816368723459c40100#post_52d754816368723459c40100\r\nThe Abrahamic faiths are simply the most prominent in western civilization, and tend to be the ones campaigning against things like gay rights or science. In the US it isn't Buddhists insisting that we have a sticker in every biology textbook disclaiming evolution, nor are Zoroastrians picketing funerals waving signs about how \"God Hates Fags!\"\r\n\r\nAlso if you are an atheist posting on the internet, which I am, odds are good that you broke away from the Abrahamic faiths. In my case it was a particularly vile strain of Christianity which was really big on Hell, the general corruption of the modern world, and most of all on how gracious God was to care for a filthy disgusting little sinner like me, so forgive me if I've got a bit of grudge.","author":"4f41ee04945b701c41002af7"},{"id":"52d75eb06368723a63bd0200","topic_id":"5161dd617f123bd25900013d","body":"\"@gasmaskangel\":/dis/the-time-wasting-thread/post/52d75bb4636872388e030100#post_52d75bb4636872388e030100\r\nI bet you wish you lived in asia. . . No seriously. Buddhism, taoism, shintoism and several other religions that originate from asia have no problem with intellectualism and actually a fair number of buddhists are atheist.  What I mean by that is atheistic buddhism is basically the philosophy minus the religion; no belief in god required.  You could shout to them, \"I'm atheist\" and they'll go, \"okay. . and?\"","author":"38b55cdf63616403d7560600"},{"id":"52d760aa6368722e8f1c0000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/52d75eb06368723a63bd0200#post_52d75eb06368723a63bd0200\r\n\r\nBuddhism is fun since it blends so well with everything it's hard to get a official count. There could be up to a billion...\r\n\r\nThen again, there's also an issue with a majority of the nations in Asia having laws against religion or curbing religion. So a part of their regime may curb the official number of any one practitioner as part of their national image, like the PRC. And then you got North Korea.","author":"4fe4bf947f123b175b000001"},{"id":"52d761e76368722aa38b0000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/52d75eb06368723a63bd0200#post_52d75eb06368723a63bd0200\r\nFrom what little I know about Buddhism that doesn't surprise me.\r\n\r\nAt any rate while there the Asian approach to spirituality appeals to me, it fits with my \"lets just leave each other alone\" philosophy of life, I'm still glad to live in the US. Its easier to say \"fuck you in the fucking neck\" when stupid secular shit pisses me off here which generally affects me more than people being weirded out by my lack of belief. \r\n\r\nThe fortunate thing is that at least in California where I live, even believers are usually on my side when I explain why I tend to be hostile to Christianity, and usually I can just politely abstain when the topic of faith comes up.","author":"4f41ee04945b701c41002af7"},{"id":"52d898ee6368724822f40000","topic_id":"5161dd617f123bd25900013d","body":"I follow no faith. I just try to focus on being good within reason and ability.\r\n\r\nI submitted Club Sandwich as a chip flavor.","author":"4fddff15945b706cf6000520"},{"id":"52d899676368724d463d0100","topic_id":"5161dd617f123bd25900013d","body":"\"@PonyPon\":/dis/the-time-wasting-thread/post/52d898ee6368724822f40000#post_52d898ee6368724822f40000\r\nClub sandwich as a chip flavor? You *MONSTER.*","author":"4f41ee04945b701c41002af7"},{"id":"52d899b26368724a96e30100","topic_id":"5161dd617f123bd25900013d","body":"\"@gasmaskangel\":/dis/the-time-wasting-thread/post/52d899676368724d463d0100#post_52d899676368724d463d0100\r\nThe time to cut the middleman has come!","author":"4fddff15945b706cf6000520"},{"id":"52d89b196368724a0d9c0200","topic_id":"5161dd617f123bd25900013d","body":"What odd Is Buddhism has a just as violent history, and just as many subdivisions as Abrahamic religions. Yet you'll never see someone bad mouth it.\r\n\r\nWeird, huh?","author":"500757fd7f123b75a90003b1"},{"id":"52d89b9f636872491dbd0200","topic_id":"5161dd617f123bd25900013d","body":"Had accident, much hurt. For my convenience:\r\n\r\nDinh AaronMk: Well hold on, I've been in th ER for seven hours.\r\nTheEvanCat: What's the situation?\r\nDinh AaronMk: I hit a patch of ice, went off road, took out mailbox, and rammed an oak. Came to with EMS next to me and a possible broken shoulder.\r\nDinh AaronMk: Left arm is in a sling, doctors are saying \"probably not\". So I'mma get a date with a bone doc tomorrow, hopefully.\r\nDinh AaronMk: And to try and locate my glasses when I visit the wreck of my Millenium Falcon.\r\nTheEvanCat: Ah. Sucks.\r\nDinh AaronMk: But I only got one not-hurting arm\r\n\r\n\r\nSeven-eight/maybe nine hours, several x-rays, one ultra-sound, CT scan, and I'm home.","author":"4fe4bf947f123b175b000001"},{"id":"52d89bb26368724adcdf0200","topic_id":"5161dd617f123bd25900013d","body":"\"@PonyPon\":/dis/the-time-wasting-thread/post/52d899b26368724a96e30100#post_52d899b26368724a96e30100\r\n\r\nDude.  Attaching main-dish flavors to snack foods NEVER ends well.  Ask anyone who's even been unfortunate enough to eat a Grilled Cheese and Ketchup chip.\r\n\r\n\r\n... I almost tossed my cookies, and it takes a lot to do that to me.","author":"5057a9e47f123b142a012d03"},{"id":"52d89c116368724cca900200","topic_id":"5161dd617f123bd25900013d","body":"\"@Kazapsky\":/dis/the-time-wasting-thread/post/52d89bb26368724adcdf0200#post_52d89bb26368724adcdf0200\r\nGrilled cheese and _Ketchup?_\r\n\r\nWell there's your problem right there.","author":"4fddff15945b706cf6000520"},{"id":"52d89c236368724b352c0300","topic_id":"5161dd617f123bd25900013d","body":"\"@AaronMk\":/dis/the-time-wasting-thread/post/52d89b9f636872491dbd0200#post_52d89b9f636872491dbd0200\r\nSo how fucked is your shoulder then?\r\n\r\n\"@Kazapsky\":/dis/the-time-wasting-thread/post/52d89bb26368724adcdf0200#post_52d89bb26368724adcdf0200\r\n\"@PonyPon\":/dis/the-time-wasting-thread/post/52d89c116368724cca900200#post_52d89c116368724cca900200\r\nI once had hotdog flavored potato chips. They were nasty. Oddly enough the company that made those abominations also made my favorite chip flavor: cheddar and horseradish!","author":"4f41ee04945b701c41002af7"},{"id":"52d89d376368724791550400","topic_id":"5161dd617f123bd25900013d","body":"\"@gasmaskangel\":/dis/the-time-wasting-thread/post/52d89c236368724b352c0300#post_52d89c236368724b352c0300\r\n[bq=\"gasmaskangel\"]\"@AaronMk\":/dis/the-time-wasting-thread/post/52d89b9f636872491dbd0200#post_52d89b9f636872491dbd0200\r\nSo how fucked is your shoulder then?\r\n[/bq]\r\n\r\nLeft arm is in a sling. Even with pain killers it's sore.","author":"4fe4bf947f123b175b000001"},{"id":"52d89dae6368724f9d0d0000","topic_id":"5161dd617f123bd25900013d","body":"\"@AaronMk\":/dis/the-time-wasting-thread/post/52d89d376368724791550400#post_52d89d376368724791550400\r\n\r\nDon't worry. The get well mails you are bound to recieve might help ;)","author":"4fdfbf92945b7075d50036e4"},{"id":"52d89ded6368725259180000","topic_id":"5161dd617f123bd25900013d","body":"\"@Princess♠Molestia\":/dis/the-time-wasting-thread/post/52d89b196368724a0d9c0200#post_52d89b196368724a0d9c0200\r\nCause they don't don't have denominations that still preach that things like homosexuality should be punishable by death, don't have denominations that send billions of dollars to actively provoke wars in the middle east under some looney belief that causing a nuclear war between israel and iran will cause god to reveal themself.\r\n\r\n\r\nAs much as I try to be nice to christians; the fact that I've seen christians with the batshit belief, especially my old church, wanting a nuclear middle east war under the belief that the rapture could only happen if the dome on the rock was destroyed is a bit fucking much.\r\n\r\n\r\nI am respectful towards christians to a extend, *BUT* when you have individuals preaching that a nuclear world war 3 would cause god to reveal himself that's pretty fucking looney.\r\n\r\n. . Before you ask what denomination of christianity I used to be the answer is southern baptist.\r\n\r\n. . I totally believe that individuals are allowed to have their own beliefs, but sweet fucking lord my old church was batshit crazy.","author":"38b55cdf63616403d7560600"},{"id":"52d89e2a6368724f61280000","topic_id":"5161dd617f123bd25900013d","body":"\"@QuasarNova\":/dis/the-time-wasting-thread/post/52d89dae6368724f9d0d0000#post_52d89dae6368724f9d0d0000\r\n\r\nEveryone knows to use Facebook!\r\n\r\nBeen reading the Get Wells from when my Mom made a status on it in the hospital.","author":"4fe4bf947f123b175b000001"},{"id":"52d89ef2636872534bae0000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/52d89ded6368725259180000#post_52d89ded6368725259180000\r\n\r\nFair point.\r\n\r\n...Damn. That's just nuts, man.","author":"500757fd7f123b75a90003b1"},{"id":"52d8a0e963687253149e0100","topic_id":"5161dd617f123bd25900013d","body":"\"@Princess♠Molestia\":/dis/the-time-wasting-thread/post/52d89ef2636872534bae0000#post_52d89ef2636872534bae0000\r\nI have no real problems with christians or the religion, but shit like that should be a crime.  Freedom of religion and freedom of speech does not extend to promoting global terrorism.","author":"38b55cdf63616403d7560600"},{"id":"52d8a21b63687253147b0200","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/52d89ded6368725259180000#post_52d89ded6368725259180000\r\nYet, when Muslims preach something like this, they would get branded as \"terrorist\" ideologists. While the other religions who do the same are less likely to receive the same backlash.\r\n\r\nGotta love those prejudice standards. _sarcasm*_\r\nThis is bullshit. All religions deserve to be treated as equal.","author":"4fde5cee945b700a970060fc"},{"id":"52d8a2776368725456660200","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/52d8a21b63687253147b0200#post_52d8a21b63687253147b0200\r\nExactly.","author":"38b55cdf63616403d7560600"},{"id":"52d8a3026368725456d20200","topic_id":"5161dd617f123bd25900013d","body":"\"There's No need for free speech if you let Jesus think for you\"\r\nSome Random shit","author":"5062d6f17f123b3e16001184"},{"id":"52d8a38e6368724f613b0300","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/52d8a21b63687253147b0200#post_52d8a21b63687253147b0200\r\nI would call it terrorist ideology (or just complete insanity) that even IF it's some christian guy preaching.\r\n\r\nThey could be non religous and I'd still call it insane and something a terrorist would come up with.\r\n","author":"500757fd7f123b75a90003b1"},{"id":"52d8a42b6368724e982e0400","topic_id":"5161dd617f123bd25900013d","body":"\"@gasmaskangel\":/dis/the-time-wasting-thread/post/52d89c236368724b352c0300#post_52d89c236368724b352c0300\r\nBacon-Flavored toothpaste anyone?","author":"513e68eda4c72d4e3b000164"}]}