{"topics":[{"id":"5588768263687205a1000279","topic_id":"5161dd617f123bd25900013d","body":"im all for robot body parts as long as they can cure diaper fetishists","author":"50a843d47f123b2e7c001359"},{"id":"558876836368726e2600035a","topic_id":"5161dd617f123bd25900013d","body":"\"@Too_Offensive\":/dis/the-time-wasting-thread/post/558875a9636872161c000093#post_558875a9636872161c000093\r\nEverything will be fiiiiine. ","author":"50c204917f123b31440000a5"},{"id":"558876ee636872695e000406","topic_id":"5161dd617f123bd25900013d","body":"\"@PaskaNaakka\":/dis/the-time-wasting-thread/post/5588754d6368727aee000139#post_5588754d6368727aee000139\r\n[bq=\"PaskaNaakka\"]\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/5588750363687229d40008dc#post_5588750363687229d40008dc\r\nWhy[/bq]\r\nBecause that is what hippies eat","author":"5239db6da4c72d22d9000358"},{"id":"558877006368727aee000339","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/558874f9636872695e0001b0#post_558874f9636872695e0001b0\r\n\r\nThat's bound to happen as technology advances, however, the human body will still need traditional medicine lest people have artificial blood which no matter how far society advances will always have that clutch of \"Consumed by tech\". Yes, some cybernetics augmentations will become part, heck some already are, in terms of limbs (an eye, a leg, another organ.).\r\n\r\nThere's never going to be a entirely cybernetic because the line between organic brain processes and artificial simply can't co-exist. Emotions are chemical reactions and you can make the argument they are simulations and really something unique to animals or man and they can be recreated via a computer but, what would you rather have? Someone who says \"I like you\" and is just saying it because they are programmed to say it or someone who you know is honest in that regard.\r\n\r\nThere's many opinions in this matter and everyone will say something different based on their emotional status, current life style, etc. So it's never going to go away and it's going to be a constant no matter how advanced society grows. There's always going to be the need of keeping the brain as less tech upgraded as you can. Some will take it to extreme measures I'm not saying they won't.\r\n\r\nBut I don't see that singularity of man and machine becoming a single entity.\r\n\r\n\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/5588750363687229d40008dc#post_5588750363687229d40008dc\r\n\r\nTofu is for the weak. Eat real meat","author":"4fdfbf92945b7075d50036e4"},{"id":"55887748636872586300002a","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5588761f636872695e0002f2#post_5588761f636872695e0002f2\r\n Oh god I can see it now\r\nThe organic purists vs cyborgs would be another case of upper class telling the lower class what their morals should be\r\n\r\nPersonally I'm all about cyborgs happening \r\nskin and bone are great but plastic and metal have much more longevity. ","author":"500b587e7f123b1f230014a9"},{"id":"558877ba63687258a00000b9","topic_id":"5161dd617f123bd25900013d","body":"\"@Number1pegasus\":/dis/the-time-wasting-thread/post/558876836368726e2600035a#post_558876836368726e2600035a\r\n[bq=\"Number1pegasus\"]\"@Too_Offensive\":/dis/the-time-wasting-thread/post/558875a9636872161c000093#post_558875a9636872161c000093\r\nEverything will be fiiiiine. [/bq]\r\n*FLORIDA MAN FOUND DEAD IN FRONT COMPUTER*\r\n*ONLY SUSPECTS ARE THE USERS FROM THE SITE FORUM*","author":"5239db6da4c72d22d9000358"},{"id":"5588783c6368726b0400008a","topic_id":"5161dd617f123bd25900013d","body":"\"@Shadow the Hedgehog\":/dis/the-time-wasting-thread/post/558876ee636872695e000406#post_558876ee636872695e000406\r\n\"@QuasarNova\":/dis/the-time-wasting-thread/post/558877006368727aee000339#post_558877006368727aee000339\r\n~^But I like tofu...^~","author":"4fde4618945b700aa0002fff"},{"id":"5588785b63687258a0000153","topic_id":"5161dd617f123bd25900013d","body":"This all sounds like Megaman ZX where humans are given mechanical implants and Reploids are given mortality.","author":"4fde5cee945b700a970060fc"},{"id":"5588785d636872583f0001a8","topic_id":"5161dd617f123bd25900013d","body":"Three words ladies and gentlemen.\r\n\r\nKUNG FU VIKING!","author":"4fde4618945b700aa0002fff"},{"id":"558878dd63687259e800023e","topic_id":"5161dd617f123bd25900013d","body":"If humans do become primarily mechanical it would probably be because of financial pressure.\r\n\r\nLet's add up all the stuff:\r\nEating, showering, water, AC/Heater to keep you comfortable, water heating, medical bills, insurance, dentist, glasses, constantly having to wash clothing cause of your sweat, constantly having to buy new clothing, winter jackets, light bulbs too see.\r\n\r\nMost of your income is already eaten up before you can even spend it.  When we do get cheap mechanical parts for humans chances are insurance companies would pressure a lot of people to get them by offering less and less treatment for organic body parts and more and more coverage for mechanical.\r\n\r\nMy guess in a nutshell:\r\n\"Hello Dave; this is your insurance company.  I regret to inform you that we no longer cover heart transplants; if you want a mechanical heart we cover that\"\r\n\"Hello Dave; this is your insurance company.  I regret to inform you that we no longer cover glasses; if you want artificial eyes we cover that\"\r\n\"Hello Dave; this is your insurance company.  I'm sorry Dave.  I can't let you do that; we no longer cover blood transfusions.  If you want artificial blood we cover that\"","author":"38b55cdf63616403d7560600"},{"id":"55887900636872586300028c","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/5588783c6368726b0400008a#post_5588783c6368726b0400008a\r\n\r\n!http://big.assets.huffingtonpost.com/ronswansononbacon4-17.400x226.gif!","author":"4fdfbf92945b7075d50036e4"},{"id":"55887995636872588d00035e","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/558878dd63687259e800023e#post_558878dd63687259e800023e\r\nI doubt that tecnology will come to Mexico","author":"5239db6da4c72d22d9000358"},{"id":"55887a3563687258a000041c","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/558878dd63687259e800023e#post_558878dd63687259e800023e\r\n\r\nIf economical stagnation is really the future (In that computers running the economy will make cash flow constant instead of being randomly up and down, which will also result in monetary exchange becoming obsolete since more likely there will be a globalized one), that's not a possibility.","author":"4fdfbf92945b7075d50036e4"},{"id":"55887ab863687219050001f7","topic_id":"5161dd617f123bd25900013d","body":"sounds like a shit future to me\r\n\r\nmight even be enough leverage to say i was born in the wrong generation... maybe","author":"50a843d47f123b2e7c001359"},{"id":"55887b436368726b04000472","topic_id":"5161dd617f123bd25900013d","body":"Over the past three days I have been witness to two stories involving people emotionally reconnecting with their dads.\r\n\r\n\r\nDo you think the universe is trying to tell me something?","author":"4fde4618945b700aa0002fff"},{"id":"55887c6a6368725c9e000164","topic_id":"5161dd617f123bd25900013d","body":"I doubt the majority of people will go full cyborg. The people who do would probably be viewed as the more extreme version of bodybuilders or something.\r\n\r\n\r\n\"@uc9\":/dis/the-time-wasting-thread/post/558878dd63687259e800023e#post_558878dd63687259e800023e\r\nAnd then dave took his money to another insurance company. ","author":"5007bbdf7f123b112f00023a"},{"id":"55887e0f63687247a10004d6","topic_id":"5161dd617f123bd25900013d","body":"\"@Shadow the Hedgehog\":/dis/the-time-wasting-thread/post/55887995636872588d00035e#post_55887995636872588d00035e\r\n[bq=\"Shadow the Hedgehog\"]\"@uc9\":/dis/the-time-wasting-thread/post/558878dd63687259e800023e#post_558878dd63687259e800023e\r\nI doubt that tecnology will come to Mexico[/bq]\r\n\r\nChances are it will. Mexico is just one step away from becoming part of either China or the US. Or both.","author":"4fdfbf92945b7075d50036e4"},{"id":"55887ea96368723e1b000026","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/55887b436368726b04000472#post_55887b436368726b04000472\r\nAfter the stories you've told us I think You might  wanna  ignore the universe And just hang out with your grandpa","author":"500b587e7f123b1f230014a9"},{"id":"55887f0b63687250ba00053c","topic_id":"5161dd617f123bd25900013d","body":"\"@QuasarNova\":/dis/the-time-wasting-thread/post/558877006368727aee000339#post_558877006368727aee000339\r\nIt's theoretically possible to transfer a consciousness to another body; it's just *WAY* out of our current level of technology.  It won't be possible technologically for another 40 to 50 years.\r\n\r\nYou know the bottle and the egg experiment to get it in the bottle?  Metaphorically it's similar concept.  You wouldn't be able to shove it into the new body, nor would you be able to copy it, etc but rather essentially hook up the mind with it's new body and essentially make it to where the computer brain takes higher priority and has higher performance thus pressuring the mind to get vacuumed into the new body.\r\n\r\nI'm obviously drastically simplifying here, but it's the best summary I can think of to get the idea across.  It's not going to be here for decades, but it's not impossible. . . HOWEVER considering how jarring such a experience would be I would have to drastically suggest that when it does become possible for people to not start body hoping as a hobby.  Streaming a entire consciousness would probably be a extremely jarring experience and if a person did it too often that might cause severe mental problems.  It would probably develop into a new mental illness of people cause chances are some people wouldn't listen and thus well you can probably imagine the damage constantly hoping bodies would do.\r\n\r\nTl:dr; it's not impossible; it's just incredibly complicated and when we eventually do develop the technology for the love of god listen to your doctor and don't do body hopping as a hobby.\r\n\r\nTl:dr of Tl:dr; if people start viewing that as like getting a new Ipod then that would be asking for trouble.  Transferring a consciousness would be a long term commitment not a fashion fad.","author":"38b55cdf63616403d7560600"},{"id":"55887f1f63687263e300042b","topic_id":"5161dd617f123bd25900013d","body":"\"@Too_Offensive\":/dis/the-time-wasting-thread/post/55887ea96368723e1b000026#post_55887ea96368723e1b000026\r\nHmmmmm... What would RJ say?\r\n\r\n\"Coincidence is but the mind interpreting what destiny has shown us.\"","author":"4fde4618945b700aa0002fff"},{"id":"55887f436368723d720000f0","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/55887b436368726b04000472#post_55887b436368726b04000472\r\nMaybe you should try to emotionally reconnect with your dad.\r\n\r\nOr perhaps emotionally reconnect your boot with his ass.","author":"5007bbdf7f123b112f00023a"},{"id":"55887fe56368723e1b0001ab","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/55887f0b63687250ba00053c#post_55887f0b63687250ba00053c\r\n\r\nI'd make the argument it's going to happen because of the addiction factor.\r\n\r\nIt happened with movies, it happened with videogames, it's _happening_ with internet and it will happen with the Oculus and VR systems.\r\n\r\nYes, it's going to happen and they'll be used as a cautionary tale as to why using technology in an attempt to replace/place technological performance over natural processes is not humanly possible to accept.","author":"4fdfbf92945b7075d50036e4"},{"id":"55887fe66368725e770005c9","topic_id":"5161dd617f123bd25900013d","body":"\"@PaskaNaakka\":/dis/the-time-wasting-thread/post/55887f436368723d720000f0#post_55887f436368723d720000f0\r\nIf it ever does happen I can fully say with the utmost confidence that I will do at least one of those two things.","author":"4fde4618945b700aa0002fff"},{"id":"558880176368723d720001fd","topic_id":"5161dd617f123bd25900013d","body":"\"this is not okay\r\n\r\nthis is NOT okay\":http://ghost-fan-club.deviantart.com/art/Tub-Guy-calls-Ghost-in-Puff-Form-508184610","author":"50a843d47f123b2e7c001359"},{"id":"5588809663687263e3000659","topic_id":"5161dd617f123bd25900013d","body":"\"@QuasarNova\":/dis/the-time-wasting-thread/post/55887fe56368723e1b0001ab#post_55887fe56368723e1b0001ab\r\nIf that sort of mental illness/addiction does develop it would probably become a body dysphoria.  The most probable mental illness would be people unable to identify their \"self\" and whenever they look at a mirror they think it's another person or such.\r\n\r\nIt wouldn't be a large percentage of people, but it would probably be high enough to be considered a problem.","author":"38b55cdf63616403d7560600"}]}