{"topics":[{"id":"5329f5c56368726d6d050000","topic_id":"5161dd617f123bd25900013d","body":"You know this shit with russia gave me a thought; the reason why the world's so fucked up isn't cause of corruption or vote rigging and so forth.  The reason why the world's fucked up is that insanity is doing the same thing expecting different results.\r\n\r\nPutin went in armed to the teeth expecting the west to just bend over and let them take crimea, but the problem with that is look at the last ten thousand years of human history; you have to know what you're doing if you want to grab land.\r\n\r\nIt's not that you can't have a country that ignores human rights, ignores international law and so forth; rather you have to actually have a fucking brain to do so and get away with it.  Going in waving your gun around going, \"MINE!\" is a quick way to get shot.  Using force politically is like trying to go to the national NRA convention/gun sale and yell to the crowd, \"THIS IS A ROBBERY!\"\r\n\r\nIf you want to get away shit the smart thing to do is swindle the person instead of pulling a gun on them.  Using force only works if the person you're trying to steal from doesn't have a gun as well.\r\n\r\nI know I'm going too far into this analogy, but to use a personal example I swindled my loan provider for school yesterday; the reason why I don't have any personal problems with loans or such is I know how to talk people's ears off when I need to.  I'm about a couple thousand dollars behind when it comes to outstanding loans, but I was able to not only talk them into giving me a exemption to allow me to go back to school, but lower my rate temporarily and another loan I have is temporarily being put into a grace period.  The companies were not supposed to do this and even have rules against allowing this, but you know why I was able to do this? I talked to them and brought them to my point of view and changed their minds to give me a exemption.\r\n\r\nMost people on the other hand think being loud and yelling at people to give you what you want works; spoiler it almost never does, but people still operate on the idea that waving your ego around slapping it in people's faces will make them do what you want.\r\n\r\nIf you want something no matter what and will go to any extent to get it the best option is to get the person to just give it to you, but the problem a lot of people have is that they think they can just rip it out of someone's hands and expect 100% of the time for it to work out in the end for them.\r\n\r\nTl:dr; now that I think about it the world's fucked up not cause of how much corruption there is, but cause of how many people think you can take something by force and expect to always get away with it when the truth is that if you want something the best option is to get them to give it to you out of their own volition.","author":"38b55cdf63616403d7560600"},{"id":"532a37e56368727174010000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5329f5c56368726d6d050000#post_5329f5c56368726d6d050000\r\nVaas Montenegro says hi. Not on Russia but on the insanity.","author":"513e68eda4c72d4e3b000164"},{"id":"532a3bc163687271fd0a0100","topic_id":"5161dd617f123bd25900013d","body":"\"@Ore-O\":/dis/the-time-wasting-thread/post/532a37e56368727174010000#post_532a37e56368727174010000\r\nHi Vaas.  Vaas did make a good point in the trailer, if you do the same thing over and over and keep failing expecting it to turn out how you want that truly is insanity.\r\n\r\nThe world is insane in that department, \"Well the last 999999999999999999 times we tried to get something we wanted we failed so best to try it another time just to see if we can get a different result\".  Most of history is filled with insane people who knew that what they were doing in that exact manner had a specific outcome and did it anyways, but expected different results, same with politics and economics and war.\r\n\r\nA prime example are bankers when it comes to economics are insane in that they think reckless speculation, even though the last 1000 economic recessions over the course of human history were mostly because of reckless speculation, will this time offer a different result.\r\n\r\nWe never actually as a species learn from our mistakes; we just make the same mistakes over and over and over expecting this time to be different.\r\n\r\nPutin in this case is insane in that he's going, \"Well our land grabbing during the soviet era ended with the collapse of the soviet union due to economic reasons, but surely this time will be different\".\r\nThe economy in Crimea is practically in freefall and if Putin does go to war then there goes russia's economy as well cause unlike during the soviet union a massive chunk of their economy comes from trade.  If he does go to war then (light switch flicks off) there goes russia's economy.  All Putin is doing right now is recreating *similar* economic situations that lead to the collapse of the soviet union.","author":"38b55cdf63616403d7560600"},{"id":"532a4097636872096e120000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/532a3bc163687271fd0a0100#post_532a3bc163687271fd0a0100\r\n\r\ni have always lived with the fact that humanity will advance really slowly, peace will never be achieved and we will commit tons of fatal mistakes.\r\n\r\ncause we are humans, thats how we are. but our intelligence applifies that, unlike animals.","author":"5154c5237f123bcd580002fc"},{"id":"532a40bc6368721d66d40100","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5329ddfc6368722b48800200#post_5329ddfc6368722b48800200\r\n\r\nLet me tell you about a wonderful Firefox addon called Commentsnob. It hides all those pesky youtube comments from sight.\r\n\r\n\"@twistedmetalero\":/dis/the-time-wasting-thread/post/5329e2c16368727eda950000#post_5329e2c16368727eda950000\r\n\r\nI see it as more of a hatebox. Yes, my opinion of youtube is low.","author":"500757fd7f123b75a90003b1"},{"id":"532a41416368724e59d60000","topic_id":"5161dd617f123bd25900013d","body":"\"@Princess♠Molestia\":/dis/the-time-wasting-thread/post/532a40bc6368721d66d40100#post_532a40bc6368721d66d40100\r\n\r\nreally? everytime on youtube, people be like \"YEAH THIS IS DA SHIT, AND EVERYTHING ELSE IS SHIT\"\r\n\r\ngo on another video stating a different opinion \"YEAH THIS IS THE SHIT, AND EVERYHTING ELSE IS SHIT\"\r\n\r\nthere are exceptions though mostly when it comes to fandom like videos.","author":"5154c5237f123bcd580002fc"},{"id":"532a4d7d636872500f600000","topic_id":"5161dd617f123bd25900013d","body":"I fear that if I ever died violently, Molestia (the user) would walk up to my corpse and ask me how my day was. And then get mad that I did not respond","author":"4fe16df67f123b13e400003f"},{"id":"532a4df1636872432dbd0000","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/532a4d7d636872500f600000#post_532a4d7d636872500f600000\r\nNot mad. Just disappointed.","author":"500757fd7f123b75a90003b1"},{"id":"532a4e2e636872787e380100","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/532a4d7d636872500f600000#post_532a4d7d636872500f600000\r\n\r\nThen you will realize you died before everyone else.","author":"4fdfbf92945b7075d50036e4"},{"id":"532a523e636872197c620000","topic_id":"5161dd617f123bd25900013d","body":"i just realized how obsessed youtube is with illuminaty and rappers.\r\n\r\nliterally put eminem illuminati and put the 1000 million videos about it go.\r\n\r\nfrom what i can gather, some believe marshall got \"cloned\" after the drug accident,using evidence like his closed earlobes(bullshit they also say the music video for 3 AM represents eminem sacrificing for some reason.\r\n\r\nnot afraid is eminem escaping the illuminati control.\r\n\r\nrap god is eminem implanting the idea that we must become transhumanist (dispite the fact that the song is about HIM being a god)\r\n\r\nalso, they blame everything he does into illuminati\r\n\r\n\"check\":https://www.youtube.com/watch?v=yRqv7qRTcY4 this video and tell me they arent full of bullshit.\r\n\r\nam i mad? nope, actually this illuminati crap its funny in a cringeworthy way","author":"5154c5237f123bcd580002fc"},{"id":"532a52896368721a87ac0000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5329f5c56368726d6d050000#post_5329f5c56368726d6d050000\r\nYou know, Putin was right about one thing. Is that the West, America in particular, have some sort of double standard politics on what one can or cannot do. \r\n\r\nFor example.  Why isn't Russia allowed to send their forces into Crimea to \"maintain order\", while the US was allowed to storm and plunder Iraq and Afghanistan without dire consequences from the international community?\r\nWhy are countries such as China, US, India, Israel, and Russia allowed to have nuclear weapons. But not Iran, North Korea, or Pakistan?","author":"4fde5cee945b700a970060fc"},{"id":"532a52906368721a87b70000","topic_id":"5161dd617f123bd25900013d","body":"Meanwhile I'm just sitting here putting Twilight into Marat's position.","author":"4fe4bf947f123b175b000001"},{"id":"532a53736368725e983f0000","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/532a52896368721a87ac0000#post_532a52896368721a87ac0000\r\n\r\nyou know, atlest russia is honest when it comes to no freedom of speech.\r\n\r\namerica is all like \"we respect LIBERTY, AND FREEDOM, AND MOUNTAIN DEW FLAVOR GEORGE WASHINGTON\"\r\n\r\nthen someone goes all like \"i dont like thing\"\r\n\r\nand stupid censorship happens.\r\n\r\nof course im not in touch much with america now, all i know is every 90 songs i find on youtube with vevo is censored.\r\n\r\nhell sometimes the dirty version of songs are censored.\r\n\r\n","author":"5154c5237f123bcd580002fc"},{"id":"532a54376368725dd8720000","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/532a52896368721a87ac0000#post_532a52896368721a87ac0000\r\n[bq=\"SeraphimDawn\"]\"@uc9\":/dis/the-time-wasting-thread/post/5329f5c56368726d6d050000#post_5329f5c56368726d6d050000\r\nYou know, Putin was right about one thing. Is that the West, America in particular, have some sort of double standard politics on what one can or cannot do. \r\n\r\nFor example.  Why isn't Russia allowed to send their forces into Crimea to \"maintain order\", while the US was allowed to storm and plunder Iraq and Afghanistan without dire consequences from the international community?\r\nWhy are countries such as China, US, India, Israel, and Russia allowed to have nuclear weapons. But not Iran, North Korea, or Pakistan?[/bq]\r\n\r\nIraq and Afghanistan came on US resolutions, especially Resolution 1441 calling for openness from Iraq for inspectors to scour the country the chemical weapons as per the outcome of the Iraq-Kuwait war. Afghanistan came at the formation of ISAF. So in international law the US was just taking part as per the roll in the UN, and other both circumstances the military action came following security-council voted and approved actions. So legally the US - and Britain and everyone else - was given one big international green-light to roll out and mess up some Hajis.\r\n\r\nPer Crimea, there was no UN resolution to say, \"Go ahead, do it\" and the invasion of Crimea to \"maintain order\" and encourage its separatism constitutes an illegal act on Ukraine per Article 2 of its constitution. Russia basically acted to take advantage of regional sensationalism to protect and guide its own interests rather than sit down with the Security Council and observe and then pass a resolution for intervention in the Crimea if international law is being broken.\r\n\r\nTo top it off, it's not like the US exports its own citizens to a region during a referendum to allow us to annex them as a state in the nation. The poll results per the Crimean referendum has there being more people for uniting with Russians then there are Russians in the region, which is pretty suspicious.","author":"4fe4bf947f123b175b000001"},{"id":"532a547a6368724f28850000","topic_id":"5161dd617f123bd25900013d","body":"\"@twistedmetalero\":/dis/the-time-wasting-thread/post/532a53736368725e983f0000#post_532a53736368725e983f0000\r\n[bq=\"twistedmetalero\"]\"@SeraphimDawn\":/dis/the-time-wasting-\r\nof course im not in touch much with america now, all i know is every 90 songs i find on youtube with vevo is censored.\r\n\r\nhell sometimes the dirty version of songs are censored.\r\n\r\n[/bq]\r\n\r\nThat's more a business thing than it is a national law thing.","author":"4fe4bf947f123b175b000001"},{"id":"532a548463687276e18d0100","topic_id":"5161dd617f123bd25900013d","body":"\"@AaronMk\":/dis/the-time-wasting-thread/post/532a54376368725dd8720000#post_532a54376368725dd8720000\r\n\r\n\"BOND WITH ME CRIMEA\"","author":"5154c5237f123bcd580002fc"},{"id":"532a54b2636872197cf60000","topic_id":"5161dd617f123bd25900013d","body":"\"@twistedmetalero\":/dis/the-time-wasting-thread/post/532a53736368725e983f0000#post_532a53736368725e983f0000\r\nTo be fair, that's more company doing than government.","author":"500757fd7f123b75a90003b1"},{"id":"532a552a636872193a490000","topic_id":"5161dd617f123bd25900013d","body":"\"@Princess♠Molestia\":/dis/the-time-wasting-thread/post/532a54b2636872197cf60000#post_532a54b2636872197cf60000\r\n\r\ni still want a mountain dew with george washington flavor\r\n\r\n","author":"5154c5237f123bcd580002fc"},{"id":"532a558c63687276e1170200","topic_id":"5161dd617f123bd25900013d","body":"\"@twistedmetalero\":/dis/the-time-wasting-thread/post/532a552a636872193a490000#post_532a552a636872193a490000\r\n\r\nAsk Japan.. That's more their department.\r\n\r\nSeriously, they have Curry flavored soda.","author":"500757fd7f123b75a90003b1"},{"id":"532a59226368723619170000","topic_id":"5161dd617f123bd25900013d","body":"\"@Princess♠Molestia\":/dis/the-time-wasting-thread/post/532a558c63687276e1170200#post_532a558c63687276e1170200\r\nGee, I wonder how that would taste.\r\nWhat if they have, Fugu Flavour?","author":"4fde5cee945b700a970060fc"},{"id":"532a5d0563687239acc20000","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/532a59226368723619170000#post_532a59226368723619170000\r\nKnowing Japan. It wouldn't surprise me. Innovation, or just plain weirdness, is their game.","author":"500757fd7f123b75a90003b1"},{"id":"532a5ed96368722751650000","topic_id":"5161dd617f123bd25900013d","body":"\"@Princess♠Molestia\":/dis/the-time-wasting-thread/post/532a5d0563687239acc20000#post_532a5d0563687239acc20000\r\nJapanese sure love novelty stuff.","author":"4fde5cee945b700a970060fc"},{"id":"532a68176368727b427a0000","topic_id":"5161dd617f123bd25900013d","body":"\"@Princess♠Molestia\":/dis/the-time-wasting-thread/post/532a5d0563687239acc20000#post_532a5d0563687239acc20000\r\nFunnily enough Japan isn't nearly as weird as depicted.  It's funny when you think about it in that think about it for a second, there's massive amounts of weaboos and such that want to move to japan cause they get all their information about japan through the weird shit and anime, but don't actually investigate into what the country is actually like.\r\n\"@twistedmetalero\":/dis/the-time-wasting-thread/post/532a548463687276e18d0100#post_532a548463687276e18d0100\r\nActually that's a meme.  It's a hetalia meme and the meme is, \"'become one with me' -Russia\"","author":"38b55cdf63616403d7560600"},{"id":"532a69116368722438b50000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/532a68176368727b427a0000#post_532a68176368727b427a0000\r\n\r\ni was actually quoting jimmy neutro happy family hour\r\n\r\nyes i know about that.","author":"5154c5237f123bcd580002fc"},{"id":"532a6a126368726558f20000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/532a68176368727b427a0000#post_532a68176368727b427a0000\r\nEvery country on Earth is defined by only a handful of traits that really only apply to a minority of the citizens. For example the perception of American's as gung ho, fat ass cowboys.","author":"4f41ee04945b701c41002af7"}]}