{"topics":[{"id":"53c2cabf6368727b68400100","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/53c2c980636872432a9b0100#post_53c2c980636872432a9b0100\r\nI don't think it was a long time ago.","author":"513e68eda4c72d4e3b000164"},{"id":"53c2cb01636872432ae40100","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/53c2c2296368726232150000#post_53c2c2296368726232150000\r\n\r\nAnd the Tea Party are such a bunch'a motherhumpers they want to ruin America","author":"5056c9e87f123b37f6012a34"},{"id":"53c2cba56368726b9a7b0100","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/53c2c980636872432a9b0100#post_53c2c980636872432a9b0100\r\nIf it isn't a democracy anymore then I can give up on voting.","author":"505696b47f123b37e800effa"},{"id":"53c2ce166368721448dc0100","topic_id":"5161dd617f123bd25900013d","body":"\"@Bryon\":/dis/the-time-wasting-thread/post/53c2ae3c6368722708b00100#post_53c2ae3c6368722708b00100\r\nI'm not dating anyone right now.  I've realized that I kind of am incompatible with far too many people.  What I mean by this is that is that while I can find someone to date the problem is that while I do get along with a lot of people things tend to fall apart in the long run due to massive philosophical and life style differences.\r\n\r\nWhat do I mean by this?  Everyone I'm long term compatible with are either monks, religious figures or hermits.\r\n\r\nA prime example of this is my goal in life; I have no goal or desire other than to pay off my school loans, work for a couple years to buy a miniature house then retire and live off that.  I highly doubt most people here would be comfortable living in a 200ft house or not buying anything.  I literally only have two boxes worth of materialistic possessions.\r\n\r\nIt would be massively inconvenient to be with someone that strives for money or really any person with some sort of material desire or desire for power or what have you cause it's a extreme contradiction to my own beliefs and life.\r\n\r\nMy own beliefs towards life and such summarized in one single sentence would be, \"surplus resources that aren't used towards either sustaining one's quality of life(aka paying your bills) of promoting the improving the quality of life of others is a waste\".","author":"38b55cdf63616403d7560600"},{"id":"53c2d006636872431e920100","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/53c2ce166368721448dc0100#post_53c2ce166368721448dc0100\r\n\r\nI gotta say, uc, you sure got a lot of guts compared to me to want to live like that.\r\n\r\nAlso...\r\n\r\n>>674104p","author":"5056c9e87f123b37f6012a34"},{"id":"53c2d1b0636872609cae0000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/53c2ce166368721448dc0100#post_53c2ce166368721448dc0100\r\nSo basically, fuck marriage, just live, type of attitude. ","author":"4fde5cee945b700a970060fc"},{"id":"53c2d21c636872614fa20000","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/53c2d1b0636872609cae0000#post_53c2d1b0636872609cae0000\r\n\r\nThat's what I got, and also the fact it's about spirituality","author":"5056c9e87f123b37f6012a34"},{"id":"53c2d27c636872614fb00000","topic_id":"5161dd617f123bd25900013d","body":"\"@Bryon\":/dis/the-time-wasting-thread/post/53c2d006636872431e920100#post_53c2d006636872431e920100\r\n[bq=\"Bryon\"]\"@uc9\":/dis/the-time-wasting-thread/post/53c2ce166368721448dc0100#post_53c2ce166368721448dc0100\r\n\r\nI gotta say, uc, you sure got a lot of guts compared to me to want to live like that.[/bq]\r\nIt's more of that I just don't give a shit about having the latest Iphone.\r\n\r\n\r\nI'm going to mock a ton of people here, but this is essentially how a lot of people act when it comes to money or material possessions:\r\n\"Oh my god!  If I don't get the latest Iphone53D v1.14 my life is going to be over!  My life is over!  I can't buy the latest Iphone!  Pity unto me for I can't fulfill my desire to buy everything like a kid upset he can't eat all the candy at a candy store!  How will I live without the latest Iphone?  How will I function?  What if my old Iphone suddenly dies on me cause I don't have the latest Iphone?  What if I get in a twenty car pile up and the call to 911 doesn't go through cause my Iphone4 is already 2 months old!  I could 'literally' die if I don't have the latest Iphone!\"\r\n\r\n\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/53c2d1b0636872609cae0000#post_53c2d1b0636872609cae0000\r\n[bq=\"SeraphimDawn\"]\"@uc9\":/dis/the-time-wasting-thread/post/53c2ce166368721448dc0100#post_53c2ce166368721448dc0100\r\nSo basically, fuck marriage, just live, type of attitude. [/bq]\r\nI'm not against marriage; I do want to eventually get married, but all my relationships end within a couple months.","author":"38b55cdf63616403d7560600"},{"id":"53c2d32a63687260db050100","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/53c2d27c636872614fb00000#post_53c2d27c636872614fb00000\r\n\r\nI can relate. I've not even held a girlfriend for more than a year in some cases, and then it sometimes just goes poof. And I'm not like that either with money; I think that if I got something I am fine with, i am fine with it. I don't even _HAVE_ a cellphone!","author":"5056c9e87f123b37f6012a34"},{"id":"53c2db596368726127d70100","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/53c2d27c636872614fb00000#post_53c2d27c636872614fb00000\r\nI've never dated before, so I can't say much. But I currently have no motivation.","author":"4fde5cee945b700a970060fc"},{"id":"53c2dc676368727e34f40000","topic_id":"5161dd617f123bd25900013d","body":"i havent even gotten a relationship, being with another human being for a week that isnt my family stresses me and all i wish is for them to fuck off.\r\n\r\n","author":"5154c5237f123bcd580002fc"},{"id":"53c2dd2763687258a7110000","topic_id":"5161dd617f123bd25900013d","body":"can anyone give me like a recap of r. kelly´s trial? like why is it so famous n shit? seems like people keep mentioning it all the time (i was watching boondocks and bam, r.kelly prosecution reference) ","author":"5154c5237f123bcd580002fc"},{"id":"53c2dd8563687258b7460000","topic_id":"5161dd617f123bd25900013d","body":"\"@twistedmetalero\":/dis/the-time-wasting-thread/post/53c2dd2763687258a7110000#post_53c2dd2763687258a7110000\r\n\r\nOn February 3, 2002, a video surfaced allegedly showing Kelly engaging in sex with, and urinating on, an underage girl. The story, which was released by an unknown source, was sent to the Chicago Sun-Times, the newspaper that broke the story on February 8, 2002. This news surfaced as Kelly was to perform at the opening ceremony of the 2002 Winter Olympics. In interviews with WMAQ television of Chicago and MTV News, Kelly said that he was not the man in the video. In June 2002, Kelly was indicted in Chicago on 21 counts of having sex with a minor, which were later reduced to soliciting a minor for child pornography, seven counts of videotaping the acts, and seven counts of producing child pornography. That same month, authorities searched Kelly's house in Davenport, Florida. During the search officers also obtained pictures of an allegedly underage woman on a digital camera – wrapped in a towel in a duffel bag. Kelly was arrested in January 2003 on those charges. In March 2004, these charges were dropped due to a lack of probable cause for the search warrants.\r\n\r\nAfter a number of delays, on October 27, 2006, a Cook County, Illinois court hearing for pre-trial motions set the date of the actual trial to February 7, 2007. On the date of the trial, Kelly's lawyer informed the court that his client was unable to attend because he was \"undergoing surgery for a burst appendix\". He also announced that Kelly was \"in good condition and was expected to be released from the hospital later in the day.\" Kelly's attorney stated that Kelly (who pleaded not guilty) would be in attendance on the next trial date of February 21, 2007. It had previously been announced by the court that the videotape that allegedly showed Kelly performing sex acts with an underage woman would be publicly shown as evidence in the trial. The trial, however, was delayed due to disputes over when the tape was made and to give medical recuperation time to the sitting judge following a fall resulting in broken bones. Later the case was set for a September 17 date. It took more than six months for the case to go to trial. Jury selection began on May 9, 2008, and the trial officially started on May 20 with opening statements from the prosecution and defense. After two weeks, the prosecution's case wrapped on June 3 while the defense's wrapped six days later, on June 9. After less than a day of deliberations, on June 13, 2008, a Chicago jury found Kelly not guilty of all 14 counts.","author":"4fdfbf92945b7075d50036e4"},{"id":"53c2de656368726aa0160000","topic_id":"5161dd617f123bd25900013d","body":"\"@QuasarNova\":/dis/the-time-wasting-thread/post/53c2dd8563687258b7460000#post_53c2dd8563687258b7460000\r\n\r\nwell ok, that was the most bullshitting criminal case of all time.\r\n\r\nnow the next big trial o.j simpson, that i only hear that he killed people with a bronco or some shit.","author":"5154c5237f123bcd580002fc"},{"id":"53c2debd6368727f0e050000","topic_id":"5161dd617f123bd25900013d","body":"\"@twistedmetalero\":/dis/the-time-wasting-thread/post/53c2de656368726aa0160000#post_53c2de656368726aa0160000\r\n\r\n\"This one you need to read on your own, it's a pretty fun ride\":http://en.wikipedia.org/wiki/O._J._Simpson_murder_case","author":"4fdfbf92945b7075d50036e4"},{"id":"53c2e84a6368727acdf50000","topic_id":"5161dd617f123bd25900013d","body":"\"@QuasarNova\":/dis/the-time-wasting-thread/post/53c2debd6368727f0e050000#post_53c2debd6368727f0e050000\r\n\r\n\"ochran's jury summation compared Fuhrman, proven to have repeatedly referred to African-Americans as \"niggers\" and to have boasted of beating young African-Americans in his role as a police officer, to Adolf Hitler\"\r\n\r\n\"Domino's Pizza reported a large rise in pizza sales in the 15 minutes before the verdict. However, when the announcement began, the orders stopped and \"not a single pizza was ordered in the United States for five minutes between 1 o'clock and 1:05\", according to the chain\"\r\n\r\n\"So much work stopped that the verdict cost an estimated $480 million in lost productivity\"\r\n\r\n\"Critics of the not-guilty verdict contend that the deliberation time was unduly short compared to the length of the trial, and that the jurors, most of whom did not have any kind of college education, did not understand the scientific evidence\"\r\n\r\nwtf","author":"5154c5237f123bcd580002fc"},{"id":"53c2e8e563687234947c0000","topic_id":"5161dd617f123bd25900013d","body":"German barbarians were the inspiration for the Berserkers you often see in fantasy.\r\n\r\nExplains a lot","author":"4fe16df67f123b13e400003f"},{"id":"53c2e91063687266a5160000","topic_id":"5161dd617f123bd25900013d","body":"\"@twistedmetalero\":/dis/the-time-wasting-thread/post/53c2e84a6368727acdf50000#post_53c2e84a6368727acdf50000\r\n\r\nI told you it was a blast to read that mess of a case.\r\n\r\nAnd I love the public jury system in common law, specially when they know the people elected for the task aren't going to have the proper knowledge to understand the evidence some of the attorneys present, but instead of, you know, giving them general capacitation and training to understand it, yeah, screw that.","author":"4fdfbf92945b7075d50036e4"},{"id":"53c2ea086368727f60160000","topic_id":"5161dd617f123bd25900013d","body":"mafioso rap\r\n\r\n!http://upload.wikimedia.org/wikipedia/en/f/f5/Reasonable_Doubt_New.jpg!","author":"5154c5237f123bcd580002fc"},{"id":"53c2ef436368727a5f0a0000","topic_id":"5161dd617f123bd25900013d","body":"What happened while I was gone?","author":"5062d6f17f123b3e16001184"},{"id":"53c2eff26368725cf5810000","topic_id":"5161dd617f123bd25900013d","body":"\"@trashboat\":/dis/the-time-wasting-thread/post/53c2ef436368727a5f0a0000#post_53c2ef436368727a5f0a0000\r\n\r\nRelationships and somne hilarious trials","author":"4fdfbf92945b7075d50036e4"},{"id":"53c2f0d56368721dea1d0000","topic_id":"5161dd617f123bd25900013d","body":"I'm doing the thing on Wednesday guys...","author":"4fde4618945b700aa0002fff"},{"id":"53c2f0f8636872264f030100","topic_id":"5161dd617f123bd25900013d","body":"Apparently the leader of Kazakhstan is an ex-Communist party chief from the USSR days","author":"4fe16df67f123b13e400003f"},{"id":"53c2f10f6368727f534a0000","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/53c2f0d56368721dea1d0000#post_53c2f0d56368721dea1d0000\r\n\r\nI find it hilarious that you will have to become a water tap once it's done","author":"4fdfbf92945b7075d50036e4"},{"id":"53c2f1586368721dd83d0000","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/53c2f0d56368721dea1d0000#post_53c2f0d56368721dea1d0000\r\nPray for no tetanus.","author":"513e68eda4c72d4e3b000164"}]}