{"topics":[{"id":"52cdc72c6368723d36dc0000","topic_id":"5161dd617f123bd25900013d","body":"\"@And Brother I Hurt People\":/dis/the-time-wasting-thread/post/52cdc594636872351ccb1300#post_52cdc594636872351ccb1300\r\nWho's to say we still can't? ","author":"50c204917f123b31440000a5"},{"id":"52cdeb5d6368720300818800","topic_id":"5161dd617f123bd25900013d","body":"I don't do enough.\r\n\r\nANd I really want to.\r\n\r\nBut at the same time, I don't.\r\n\r\nUgh.!http://www.burgrr.com/images/icons/burgrr_m_steak.png!","author":"4fddff15945b706cf6000520"},{"id":"52d2476c63687264f7e20000","topic_id":"5161dd617f123bd25900013d","body":"I began \"writing\" for an RP on the site. And I went playing pool with some friends (I lost every game n_n) then poker and closed with dominoes","author":"4fdfbf92945b7075d50036e4"},{"id":"52d273e66368727ad0af0100","topic_id":"5161dd617f123bd25900013d","body":"*I THINK IT'S STORY TIME, GUYS!!!*\r\n\r\n\r\nSo this one time me and a couple of friends were drinking in a park. We were only 14. This fat security guard man comes up to us and basically says \"Alright boys, dump out the beer.\"\r\n\r\n\"No,\" said I, and we each took a swig.\r\n\r\n\"Then I'm going to call the cops,\" said the security guard.\r\n\r\n\"Go ahead,\" says Flappy (Not his real name, it was a nickname), \"We'll be done by the time they get here.\"\r\n\r\nSo the security guard calls the police and stands there glowering at us while we continue to consume our drinks. Eric, the third of the group gets done first and throws his bottle into the river. I get done next, and throw my bottle into the river. Flappy always talked too much, so he practically had a full bottle to get through, and still had a good third of it by the time the police showed up.\r\n\r\nSo the cop is walking up and is probably within 15 feet of us, when out of nowhere Flappy starts sloshing his beer all over the security guard and drops the empty bottle at his feet. \"Officer!\" he says to the cop, \"You're just in time! Us three just caught this security guard drinking on the job!\"\r\n\r\nSo we all three got loaded into the cop car, laughing every step of the way. It was probably the funniest thing to ever happen to me whilst getting arrested.\r\n\r\n--------------------------\r\n\r\nAnother time, me and my ex were walking through the mall. I was busy chatting him up, and didn't see a fat man in one of those handicapped scooters headed right for me. He didn't slow down, and whaled right into me. I started yelling at the guy, and to my surprise, he totally started yelling right back. I was fucking pissed right off, and _this close_ to hitting him, but Jacky (My ex) stopped me and basically told me how bad it would look for me to hit a crippled guy.\r\n\r\nI reluctantly agreed, and started to walk away.\r\n\r\n\"Va te crosser, Fifi!\" he yells at me (He basically called me a faggot and told me to go fuck myself)\r\n\r\nSo I pushed away from Jacky, came back, and made a fist. He smirked at me, like he _wanted_ me to hit him. I don't know what was going through this guy's head, but I knew then and there I wasn't going to give him the satisfaction.\r\n\r\nSo I pulled the keys out of his scooter and left the fat fuck stranded in the middle of the Fleur de Lys mall. Hearing him yell sacres (It's how French Canadians flip out; just in a random string of vulgarities) at me as I walked away was one of the most satisfying things ever in my life.","author":"4fe24e617f123b7aca0030ac"},{"id":"52d2b15e6368722d57520100","topic_id":"5161dd617f123bd25900013d","body":"\"@DanielTepesKraus\":/dis/the-time-wasting-thread/post/52d273e66368727ad0af0100#post_52d273e66368727ad0af0100\r\n\r\n2edgy4me\r\n\r\n(did you ever give the keys back, or did you just end up keeping them?)","author":"5041b54f7f123b77af00a442"},{"id":"52d2bb5c6368723953980200","topic_id":"5161dd617f123bd25900013d","body":"\"@And Brother I Hurt People\":/dis/the-time-wasting-thread/post/52cdc594636872351ccb1300#post_52cdc594636872351ccb1300\r\nToo bad, lets see how it does in the revival","author":"4ffbfff37f123b072a01bb5b"},{"id":"52d2c8a263687220e18f0100","topic_id":"5161dd617f123bd25900013d","body":"Hey, want to hear a long, boring story ending in how my legs were forcefully spread apart by a horny seventh grader? Of course you do. \r\n\r\nSo I volunteer a lot in my local library, simply because I enjoy the work and the people I work for. My library also happens to have one of the best male librarian in the entire state of New York named Erick, a class act nerd. So when the library expressed a need to bring more young people in - a library's fate often lies in its young blood - of course, Erick was on the case: he decided that what we needed was an after-dark Zombie Hunt in the upstairs portion of the library. Meaning that people would dress up as Zombies and have the ever loving fuck gunned out of them by sixth graders and their nerf guns. If there's anything I learned from this story, it's that nerf collecting teenage boys go hard - one guy there was in a full body Assassin's Creed cosplay, complete with various (fake) knives.\r\n\r\nSo, of course, I had to volunteer for this event, partly because I knew most of the kids coming and partly because, hey, Zombie Hunt. I was in charge of the snack table, along with my boyfriend, which basically meant \"make sure the kids don't go nuts and steal the entire plateful of butter cookies\".  So ten minutes before the event is starting, Erick tells me to not give out food just yet, because he wants to lay down the ground rules of the event and, well, kids just don't listen when they're shoving their faces with food. So kids are coming by asking for food, and I feel like bit of an asshole saying \"No, you can't have it yet\", so I add \"come back in ten minutes, okay? Sorry.\" Shenanigans of course, ensue: people offer me money for twizzlers, one kid who knows about my interest in MLP points to a corner and says \"Is that Rainbow Dash?\" and pretends to make off with ten twizzlers. But it's all in good fun, nobody _really_ tries to steal anything, and it looks like it's gonna be a great night. Welp, here's where things turn a bit sour.\r\n\r\nSo this kid with a mole the size of a nickel - I'll call him John - comes strolling up to the table, and I already know that shit's going to hit the fan because this guy causes trouble at every event he attends, not to mention the first time I met him he a) followed me around for an entire night, looking at me with sultry eyes and whispering \"come with me to comic con\" and b) shoved a Hatsune Miku plushie down my cleavage. So he asks for food, and I give the same shtick: \"Can't yet, sorry. Come back in ten minutes, then you can.  Sorry\" (I'm very apologetic, can you tell?). Well, John throws a fucking fit, because life just ain't fucking fair for him. And then he proceeds to grab a handful of twizzlers, to which I lightly grab his hand because hey, I don't want to get in trouble for giving out food. As my boyfriend is trying to get the twizzlers out of his hand, Johny Boy is absolutely screaming obscenities toward me. \r\n\r\n\"You fucking bitch! You're such a whore! Let the fuck go of me! _I hate you!\"_\r\n\r\nYou'd think someone would come over to help, but it was so loud - the turnout was huge - that no one probably heard.\r\n\r\nSo they're finally out, and I have no fucking clue what to do. But apparently, he's over it, because he looks at my boyfriend and says \"Hey, are you Spanish?\" To which my boyfriend, who has one of the most stereotypical Hispanic names to ever exist, says yes.\r\n\r\nSo John starts grinding on the wheelchair ramp (I think he yelled \"imma dance\" before doing so, he actually said \"imma), singing \"Grind on me\" _all while yelling out Spanish curses._ To this day, I have to give him credit for accomplishing this impressive feat. My boyfriend is fucking loosing his shit, probably because the second hand embarrassment is so strong, that you can cut it with a knife. So finally, John leaves, and I can give out food. \r\n\r\nAfter everybody takes food and the event starts, my duties are pretty much done. So I'm talking to my boyfriend, talking to some of the sixth graders who are waiting their turn to go upstairs and use their nerf guns. There's a small John incident where he insults my \"weave\" (???) and talking like a stereotypical black woman; he's giggling and shit so I assume he's fucking around, so I play his game and talk like that to him right back, to which he runs off upset. Whatever. Now, me and my boyfriend are approached by a small girl, about the same age as John and the complete polar opposite too, who was brought there by her older brother so he could help her shoot down zombies with his nerf gun collection. Kinda sweet, actually, but that's besides the point. So she's this small little thing, right? Sweet, caring, albiet bit of a doormat, but hey, she's in the seventh grade. Anyway, she says very quietly \"Are you two dating?\" And she's really sweet about it and all, so I'm like \"Yeah, yeah we are.\" And she's really excited, asking these completely innocent questions (\"Have you guys ever held hands?\" \"When did you meet?\"), that we both feel totally comfortable with this girl and answer her questions. And that's when I hear a satanic shriek from behind me. \"YOU'RE DATING?\"\r\n\r\nShit. _Shit._ _*Shit.*_\r\n\r\nSo when I say John fucking leaps over my head to get in front of me, I mean he fucking leaps over my head to get in front of me. Turning around, he looks at my boyfriend, making a point to not acknowledge me, and says \"Have you tapped it yet?\"\r\n\r\nWell, if I was going to answer his questions before, now I certainly wasn't. You really can't expect to treat me as nothing more than the library backdrop and then expect me to answer sexual questions which, by the way, he had more of now. He shoved a packet of paper in front of the little girl's face, almost pushing her off of the raised surface she was standing on, and moved his face so close to mine that he could have kissed my nose.\r\n\r\nSo now I'm just pissed, and I tell him to fuck off, because there's no librarians around to report him to and besides, I really could give less of of shit about my reputation now, this kid is absolutely mortifying my boyfriend, and I don't deal with that shit. To which he gets mad, and you guessed it, starts spewing curses directed at me. I'm about to say something, when I feel a blast of wind kiss my genitals.\r\n\r\nAnd this kid has his hands on my kneecaps, spreading my legs apart and staring at my mound with glorious wonder. \"Hey, look at this!\" he says, poking my boyfriend. I try to close my legs, and he forces them apart again.\r\n\r\nI _shriek._ I'm surprised I wasn't elected as an honorary siren that night. And still, it is not heard because it's that damn loud. My boyfriend literally has no idea what just happened. By the time I say \"he just forced my legs apart\", the imp is gone. So I see a librarian in the corner, and I'm about to go to her when John decides to top everything off with a cherry: he comes behind me, and digs his sharp little fingernails into my skull and runs away giggling.\r\n\r\nI tell one of the librarians what this kid is up to. She pulls him aside, yells at him, and bans him from the Zombie Hunt, and for the rest of the night, he mopes on his Iphone, telling his daddy how he was framed or some shit.\r\n\r\nWhat I won't forget is how a few minutes later, he had a ring of girls _literally surrounding him at his feet,_ as he pumped them with some sob story, pointing at me. The smug little bastard's face as he stared at me pissed me off so much, that I did something I never fucking do as a volunteer: I tattled to his precious father, who said in the damn manliest voice I ever fucking heard, I quote, _\"This will never happen *again.*\"_\r\n\r\nHe got banned from the library by his father, and if he ever comes back, now that literally every librarian knows the story - the librarian I told is a good friend of mine, she was mortified and told everyone about it, I don't really care - he will never go anywhere without being watched like a hawk.\r\n\r\nBam.","author":"5041b54f7f123b77af00a442"},{"id":"52d2d3c9636872531c7d0300","topic_id":"5161dd617f123bd25900013d","body":"\"@And Brother I Hurt People\":/dis/the-time-wasting-thread/post/52d2c8a263687220e18f0100#post_52d2c8a263687220e18f0100\r\n\r\nWow, what a bitch... then again it was in New York, where being a jackass is a prerequisite for most people (obvious expcetions aside)\r\n\r\n","author":"4fdfbf92945b7075d50036e4"},{"id":"52d2d4166368724a7f190000","topic_id":"5161dd617f123bd25900013d","body":"\"@QuasarNova\":/dis/the-time-wasting-thread/post/52d2d3c9636872531c7d0300#post_52d2d3c9636872531c7d0300\r\n\r\nMakes it worse that we were in Long Island at the time.\r\n\r\nBut seriously, who expects a tiny seventh grader to act like a sexual animal in public? ...oh, wait.","author":"5041b54f7f123b77af00a442"},{"id":"52d2d4666368724cc4100000","topic_id":"5161dd617f123bd25900013d","body":"\"@And Brother I Hurt People\":/dis/the-time-wasting-thread/post/52d2d4166368724a7f190000#post_52d2d4166368724a7f190000\r\n\r\nMale? check \r\nPuberty at the front door? Check\r\nCaring about nothign except getting laid when you can't even pass a basic math course? Check, and check","author":"4fdfbf92945b7075d50036e4"},{"id":"52d2d5006368724a45350000","topic_id":"5161dd617f123bd25900013d","body":"\"@QuasarNova\":/dis/the-time-wasting-thread/post/52d2d4666368724cc4100000#post_52d2d4666368724cc4100000\r\n\r\nI dunno, it's just that so many of the kids that go to these events aren't like that, or are at least good at not being outward about it, which is probably what caught me off guard.\r\n\r\nIt's actually kinda nice. Yeah, they're obnoxious brats, but they're young; I wouldn't really expect anything less.","author":"5041b54f7f123b77af00a442"},{"id":"52d30afd6368722383090200","topic_id":"5161dd617f123bd25900013d","body":"\"@And Brother I Hurt People\":/dis/the-time-wasting-thread/post/52d2c8a263687220e18f0100#post_52d2c8a263687220e18f0100\r\nHoly fuck. Young or not, I'd have beaten that guy's ass so bad he'd have to pee sitting down the rest of his life.","author":"4fe24e617f123b7aca0030ac"},{"id":"52d30c57636872324bc80200","topic_id":"5161dd617f123bd25900013d","body":"I have no Idea what to do here...\r\n\r\nDoes anyone here watch Mecha? (I mean real mecha, Not entry level mecha like Evangelion, Big O, Gundam wing, And Gurren lagann I.e Anything aired on Toonami, Also, I know that EVA And TTGL Didn't air on Toonami)","author":"5062d6f17f123b3e16001184"},{"id":"52d30dd86368721080250100","topic_id":"5161dd617f123bd25900013d","body":"\"@DanielTepesKraus\":/dis/the-time-wasting-thread/post/52d30afd6368722383090200#post_52d30afd6368722383090200\r\n\r\nI'm not one for violence. \r\n\r\nBesides, based on what I saw of him, I have a good feeling that merely being reprimanded by his Dad was enough to scar him. ","author":"5041b54f7f123b77af00a442"},{"id":"52d312a26368727b97b60000","topic_id":"5161dd617f123bd25900013d","body":"\"@And Brother I Hurt People\":/dis/the-time-wasting-thread/post/52d30dd86368721080250100#post_52d30dd86368721080250100\r\nIt's an important life lesson for some kids though. They think they're unstoppable because nothing has ever happened to stop them before, and many of these kids don't respond to emotional punishment.\r\n\r\nSo giving them a good beating can (emphasis on _can_, not will) show them that they're not unstoppable and they have to behave better around other people.","author":"4fe24e617f123b7aca0030ac"},{"id":"52d3140e636872792f2a0000","topic_id":"5161dd617f123bd25900013d","body":"\"@DanielTepesKraus\":/dis/the-time-wasting-thread/post/52d312a26368727b97b60000#post_52d312a26368727b97b60000\r\nI honestly wish that always worked.","author":"4fddff15945b706cf6000520"},{"id":"52d3162063687242b8510000","topic_id":"5161dd617f123bd25900013d","body":"\"@DanielTepesKraus\":/dis/the-time-wasting-thread/post/52d312a26368727b97b60000#post_52d312a26368727b97b60000\r\n\r\nExcept it's not my kid, and I don't feel comfortable with hitting people. If I was in a life or death situation, of course, I wouldn't think twice, but I just don't put my hands on people.","author":"5041b54f7f123b77af00a442"},{"id":"52d318e56368724ca9380000","topic_id":"5161dd617f123bd25900013d","body":"\"@PonyPon\":/dis/the-time-wasting-thread/post/52d3140e636872792f2a0000#post_52d3140e636872792f2a0000\r\n\r\nsame. I got suspended because I beat the shit out of a classmate (long story) and instead of thinking he wasn't unstoppable and someone could step up to him, instead, he decided that I humiliated him and as soon as I came back he immediately kept challenging me to fight him every day until we graduated. He even dared to go into my house and yelled at me to come out. (When my parents where out, what does that tell you?)\r\n\r\nIt wasn't until I took a different measure that I managed to get him off my ass.","author":"4fdfbf92945b7075d50036e4"},{"id":"52d322536368724063110100","topic_id":"5161dd617f123bd25900013d","body":"I don't like my brother.\r\n\r\nI once told him he was a combination of Deadpool, Rigby from Regular Show (fitting as his dynamic with Mordecai has some shocking similarities to our own), and The Annoying Orange.\r\n\r\nAnd he agreed with me.\r\n\r\nHe's also an anti-zombite.","author":"4fddff15945b706cf6000520"},{"id":"52d3234a6368727f0d1b0100","topic_id":"5161dd617f123bd25900013d","body":"\"@PonyPon\":/dis/the-time-wasting-thread/post/52d322536368724063110100#post_52d322536368724063110100\r\nAre you implying that Deadpool is annoying?","author":"5062d6f17f123b3e16001184"},{"id":"52d323756368721b510b0000","topic_id":"5161dd617f123bd25900013d","body":"\"@trashboat\":/dis/the-time-wasting-thread/post/52d30c57636872324bc80200#post_52d30c57636872324bc80200\r\nYou and me i think are the only mecha fans\r\n\r\nAnyone here watches obscure trippy experimental anime films like Cat Soup, Tamala 2010, and Night on the Galactic Railroad, cause i know im not the only anime hipster out there","author":"4ffbfff37f123b072a01bb5b"},{"id":"52d323936368721b511f0000","topic_id":"5161dd617f123bd25900013d","body":"\"@trashboat\":/dis/the-time-wasting-thread/post/52d3234a6368727f0d1b0100#post_52d3234a6368727f0d1b0100\r\n*SUPER ANNOYING.*","author":"4fddff15945b706cf6000520"},{"id":"52d323b8636872668e620000","topic_id":"5161dd617f123bd25900013d","body":"\"@MoogSourceVermona\":/dis/the-time-wasting-thread/post/52d323756368721b510b0000#post_52d323756368721b510b0000\r\nI saw Cat Soup.\r\n\r\nAnd Doggy Poo.\r\n\r\nNever again.","author":"4fddff15945b706cf6000520"},{"id":"52d3240263687229b80e0000","topic_id":"5161dd617f123bd25900013d","body":"\"@MoogSourceVermona\":/dis/the-time-wasting-thread/post/52d323756368721b510b0000#post_52d323756368721b510b0000\r\nYou're definitely wrong there, Number1pegasus, Astronomus, And A Sad Pony just to name a few are even bigger mecha fans then I am (They've definitely seen more)","author":"5062d6f17f123b3e16001184"},{"id":"52d324316368727ec2850000","topic_id":"5161dd617f123bd25900013d","body":"Anyone here ever watch \"There She Is!!\"?","author":"5041b54f7f123b77af00a442"}]}