{"topics":[{"id":"53607b9063687235c3320000","topic_id":"5161dd617f123bd25900013d","body":"YouTube suggests for me this song: \"http://youtu.be/M0nMHBFZc_E\":http://youtu.be/M0nMHBFZc_E\r\n\r\nI scroll down through the comments to find: \"i am perpetually experiencing a new orleans withdrawal.\"\r\n\r\n\r\nUMMMMFFFFF, WHY DO YOU GOT TO MAKE IT HARDER FOR ME BITCH. GOD DAMMIT","author":"4fe4bf947f123b175b000001"},{"id":"53607c95636872460b510000","topic_id":"5161dd617f123bd25900013d","body":"So my comp like restarts session every once in a while, probably not letting bleach finish.\r\n\r\nAt this point it might be a hard ware problem and just send it to be repaired","author":"5154c5237f123bcd580002fc"},{"id":"53607d2763687248b3910000","topic_id":"5161dd617f123bd25900013d","body":"\"@twistedmetalero\":/dis/the-time-wasting-thread/post/53607c95636872460b510000#post_53607c95636872460b510000\r\nHmm, I don't know at this point.\r\n\r\nI've had that problem before, but it was due to something else.","author":"38b55cdf63616403d7560600"},{"id":"53607e3763687277193f0000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/53607d2763687248b3910000#post_53607d2763687248b3910000\r\n\r\nThis is making me crazy, all these problems and glitches I just wanted to sit and play but this whole week has been a struggle to make it wok,rk, but my hopes get thinner and thinner.\r\n\r\nAt this point ill just come tomorrow see if someone responded that w7 thread, if it fixes or just send it back with the warranty so the guys can just like dismantle it, give it a look and get it like repaired or a replacement.","author":"5154c5237f123bcd580002fc"},{"id":"536088f96368727e40590000","topic_id":"5161dd617f123bd25900013d","body":"So it finally happened.\r\n\"Korean dub of FiM episode 1\":https://www.youtube.com/watch?v=RJbFkXSzMcE","author":"4fde5cee945b700a970060fc"},{"id":"53609cbf6368723703d30000","topic_id":"5161dd617f123bd25900013d","body":"Here's a bit of good news for people living in the usa; you know how banks have been essentially giving regulators the middle finger going, \"haha you can't arrest me! I'm too big to fail.  You can't arrest me!\" the last two decades whereas regulators have been going, \"Please sir, don't hurt me\"?  Well here's some good news, the department that regulates banks has figured out how to criminally prosecute banks and ceos without revoking their charters.\r\n\r\nThe old way was to just straight up gut a bank and kill it; what they're thinking of doing now is essentially freezing a bank's access to the stock exchange on top of fees as well as freeze their rights to exchange money in certain cases.  Basically the reason why there was no criminal prosecutions for the housing crash was that bank side justice followed old west justice of just popping a cap in someone's face; the new idea is to essentially kick them in the balls until they pass out.\r\n\r\nThe reason why this is a big deal is that let's say you're one of the biggest banks in the world and you buy and sell stocks on the stock market; what this would do is essentially freeze your access to the stock market.  You would still have your money, minus fines, but you would blacklisted from the stock market *FOREVER*.  You as a bank still are worth tons of money, no one is taking your money away and you are still in business, you're just blacklisted essentially.\r\n\r\nEven if you plead guilty to try get a lesser sentence for banks it's still a extremely severe punishment and while we probably won't see anyone going to prison for the housing crash it will prevent the people who caused it from doing it again.\r\n\r\nTl:dr;\r\n!http://static.comicvine.com/uploads/original/14/148979/3660230-3568764363-i-am-.jpg!\r\n","author":"38b55cdf63616403d7560600"},{"id":"53609eb46368725869f70000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/53609cbf6368723703d30000#post_53609cbf6368723703d30000\r\nI just heard a beautiful sound, as if a thousand bankers just shit themselves in terror.","author":"4f41ee04945b701c41002af7"},{"id":"53609fd46368721517770000","topic_id":"5161dd617f123bd25900013d","body":"\"@gasmaskangel\":/dis/the-time-wasting-thread/post/53609eb46368725869f70000#post_53609eb46368725869f70000\r\n[bq=\"gasmaskangel\"]\"@uc9\":/dis/the-time-wasting-thread/post/53609cbf6368723703d30000#post_53609cbf6368723703d30000\r\nI just heard a beautiful sound, as if a thousand bankers just shit themselves in terror.[/bq]\r\nThe two banks that are getting prosecuted almost literally shat themselves in terror.\r\n\r\nThey did not contest it.\r\nThey did not plead innocent.\r\nThey did not try to prove their innocence.\r\nThey did not try to weasel out of it.\r\nThey did not pull strings in washington.\r\nThey did not threaten the regulators.\r\nThey did not do any of that.\r\n\r\nWhat they did do is they immediately plead guilty and outright metaphorically started begging on their hands and feet for a lesser sentence.","author":"38b55cdf63616403d7560600"},{"id":"5360a4396368722ea9e90100","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/53609fd46368721517770000#post_53609fd46368721517770000\r\nOn the one hand as libertarian I dislike government regulation of anything, if for no other reason than their poor track record at doing so. However still as a libertarian but also as a realist I know that the crony capitalists (a description that applies to most all banks) must be brought to task for their bullshit for a real free market to arise.\r\n\r\nIn this capacity government force is uniquely suited and even to be desired for many banks have behaved no better than bandits.","author":"4f41ee04945b701c41002af7"},{"id":"5360a6c06368723dc0030000","topic_id":"5161dd617f123bd25900013d","body":"\"@gasmaskangel\":/dis/the-time-wasting-thread/post/5360a4396368722ea9e90100#post_5360a4396368722ea9e90100\r\nI think this is one of the few occasions a lot of people can agree that this is for the better.\r\n\r\nI may like it for different reasons, but yeah cronies that upright don't give a shit about whether or not they cause a economic collapse for a quick dollar really need to answer for their bullshit.\r\n\r\nThis has really good long term positive effects when you think about it.  If a banker helped caused the housing crash and wants to do the same thing again:\r\nPerson/group/bank, \"Come on it will only be a little smidgen of a economic collapse\"\r\nHBC, \"*YOU SHALL NOT PASS!*\r\n\"Come on man!  It will only last a couple years!\"\r\n\"Nope.avi\"\r\n\"Please?  It'll only effect the poor\"\r\n\"Patrolling the Mojave almost makes you wish for a nuclear winter\"\r\n\r\n\r\nAt the very least it will help prevent future recessions.","author":"38b55cdf63616403d7560600"},{"id":"5360a8b56368725a75700000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5360a6c06368723dc0030000#post_5360a6c06368723dc0030000\r\nNot gonna lie, the shit the 1% gets up makes me want to start brewing molotov cocktails.\r\n\r\nOn the subject of libertarianism I feel that the biggest failing is that assholes are allowed to co opt the philosophy to shout essentially \"we should be allowed to do whatever we want to because we're rich!\" and nothing else. My challenge to my fellow libertarians is this: we must build a world that deserves a free market. More than anyone we should be championing charity, accountability, stamping out crony capitalism and in general making a world that deserves a free market. My philosophy is one that demands personally working to make the world a better place because of the belief that legislated morality is not moral and if we are unwilling to do what we can to make things better then others will.\r\n\r\nLibertarians have no right to bitch about welfare if they have nothing to replace it with.","author":"4f41ee04945b701c41002af7"},{"id":"5360aab06368724da4090200","topic_id":"5161dd617f123bd25900013d","body":"\"@gasmaskangel\":/dis/the-time-wasting-thread/post/5360a8b56368725a75700000#post_5360a8b56368725a75700000\r\nI think this is the first time a libertarian and a socialist have ever agreed on something.\r\n\r\nBefore you ask I'm not the, \"death to capitalism\" kind, but the \"roads are important\" kind.","author":"38b55cdf63616403d7560600"},{"id":"5360ad1d6368724da44c0300","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5360aab06368724da4090200#post_5360aab06368724da4090200\r\nI'm probably this way because most of my friends are socialists. In general I tend to get most worked up about the social stuff like gay rights and right to privacy because these are fundamentally moral issues. The economic stuff can have a moral component but except in the case of people where I smell a definite conflict of interests I tend to assume that everyone is working from the same impulse to do good and that our differences are on how it should be done.\r\n\r\nBecause of this I do not share the loathing for Obama that many other so called \"libertarians\" do. I will never fault a liberal for following their convictions. My objections stem more from his expanding the invasion in Afghanistan, his toleration of the NSA's bullshit which even if it does not violate the letter of the Constitution and Bill of Rights certainly violates the spirit and the fact he had to \"evolve\" on gay rights instead of taking the obvious moral stand that all people deserve to be treated with basic human dignity and that anti GBLT legislation is a stain on our country's character.","author":"4f41ee04945b701c41002af7"},{"id":"5361354b636872642f420000","topic_id":"5161dd617f123bd25900013d","body":"I got 19 acces denied errors in bleach last scan.","author":"5154c5237f123bcd580002fc"},{"id":"53613d8d6368721d48c70000","topic_id":"5161dd617f123bd25900013d","body":"\"@twistedmetalero\":/dis/the-time-wasting-thread/post/5361354b636872642f420000#post_5361354b636872642f420000\r\n[bq=\"twistedmetalero\"]I got 19 acces denied errors in bleach last scan.[/bq]\r\nDon't worry; that's just to make sure you don't accidentally overwrite something you need.  Don't touch those files cause they may or may not be important.","author":"38b55cdf63616403d7560600"},{"id":"53613deb6368722364e40000","topic_id":"5161dd617f123bd25900013d","body":"I'm kind of surprised that Yahtzee doesn't watch south park","author":"5062d6f17f123b3e16001184"},{"id":"536141e563687205e4bf0000","topic_id":"5161dd617f123bd25900013d","body":"\"@gasmaskangel\":/dis/the-time-wasting-thread/post/5360ad1d6368724da44c0300#post_5360ad1d6368724da44c0300\r\n[bq=\"gasmaskangel\"]\"@uc9\":/dis/the-time-wasting-thread/post/5360aab06368724da4090200#post_5360aab06368724da4090200\r\nI'm probably this way because most of my friends are socialists. In general I tend to get most worked up about the social stuff like gay rights and right to privacy because these are fundamentally moral issues. The economic stuff can have a moral component but except in the case of people where I smell a definite conflict of interests I tend to assume that everyone is working from the same impulse to do good and that our differences are on how it should be done.\r\n\r\nBecause of this I do not share the loathing for Obama that many other so called \"libertarians\" do. I will never fault a liberal for following their convictions. My objections stem more from his expanding the invasion in Afghanistan, his toleration of the NSA's bullshit which even if it does not violate the letter of the Constitution and Bill of Rights certainly violates the spirit and the fact he had to \"evolve\" on gay rights instead of taking the obvious moral stand that all people deserve to be treated with basic human dignity and that anti GBLT legislation is a stain on our country's character.[/bq]\r\nWhat's ironic when you think about it is that for the past what five years people have been criticizing him for these sorts of reasons and now that obama's now called the drone daddy mass media got their head out of the previous asshole and went straight to the next asshole and shoved their head up going, \"See guys, I'm trendy too\".\r\n\r\nIf I had to summarize the 24/7 news and mass media in a nutshell is that; someone that occasionally takes their head out of someone's ass and then finds a not so dried up asshole to shove their head up again.","author":"38b55cdf63616403d7560600"},{"id":"536143516368721b11f90000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/536141e563687205e4bf0000#post_536141e563687205e4bf0000\r\nThat is a pretty apt summary of the 24/7 news channels. I'm pretty sure they're less credible than us just spitballing around here because at least when one of us is being a stupid asshole everyone else will try to call them out on it.","author":"4f41ee04945b701c41002af7"},{"id":"536146666368720446210000","topic_id":"5161dd617f123bd25900013d","body":"\"@gasmaskangel\":/dis/the-time-wasting-thread/post/536143516368721b11f90000#post_536143516368721b11f90000\r\nPersonally I think Obama is *JUST* going to be remembered as the first african american president, as \"drone daddy\" and for obamacare and that's it.  Why?  Cause on the topic of gay marriage and glbt rights the usa is moving so quickly towards being for glbt rights that if there is a presidential candidate that is against glbt rights it's going to cost their party the election.  Not a maybe, not a possibly, but a definitively will cost their party the election.  He's not going to be remembered as the first president to support glbt rights, cause the country is going to be so far for glbt rights that both parties will have to kick any candidate against glbt rights out so they won't cost them the election.\r\n\r\nI may be super liberal, but I can't wait until he's out of office cause we need someone better.\r\n\r\nWhat's probably going to wind up happening 2016 is one candidate supports glbt rights and the other doesn't; election will be over within the first hour and the candidate that doesn't support glbt rights will be picking their teeth off the ground from the severe ass kicking.","author":"38b55cdf63616403d7560600"},{"id":"536149b76368722dccf90000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/536146666368720446210000#post_536146666368720446210000\r\nExcept no one will have the grace to admit it and the whole affair will be dragged out and tortured as all elections are and I'll have a nervous break down.","author":"4f41ee04945b701c41002af7"},{"id":"53614aef6368725917980000","topic_id":"5161dd617f123bd25900013d","body":"\"@Number1pegasus\":/dis/the-time-wasting-thread/post/536051486368724bda2c0200#post_536051486368724bda2c0200\r\n\r\nI guess that there's no way to fix it...?","author":"5041b54f7f123b77af00a442"},{"id":"53614c086368727b715f0000","topic_id":"5161dd617f123bd25900013d","body":"\"@gasmaskangel\":/dis/the-time-wasting-thread/post/536149b76368722dccf90000#post_536149b76368722dccf90000\r\nThe funny thing is this is 100% true, cause during 2012 even though obama had already won they were still waiting on florida saying that it could change who wins even though the election was officially over.\r\n\r\nThat's like a sports announcer saying that a game isn't over even after everyone in the stadium has left and the teams have gone home.","author":"38b55cdf63616403d7560600"},{"id":"53615a716368720b50ae0200","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/53614c086368727b715f0000#post_53614c086368727b715f0000\r\nI just hope the republicans can actually field a decent candidate this election. Not because I'd vote for them, I doubt I'll ever do that but because dear God the last couple have just been goddamn embarrassing. It almost makes me feel sorry for them.\r\n\r\nTangentially related to Politics, Obama is the first president in our lifetime to really show just how much that fucking job ages you.\r\n2008 Obama\r\n!http://static2.businessinsider.com/image/4bfd3dd17f8b9aaa21230100-1200/barack-hussein-obama-2008-present-5-million-net-worth.jpg!\r\n\r\n2014 Obama\r\n!http://cdn2-b.examiner.com/sites/default/files/styles/image_content_width/hash/e7/f7/e7f7d258c3c99291ebc417387ccfb9c6.jpg?itok=lmhNrsSf!","author":"4f41ee04945b701c41002af7"},{"id":"53615abc63687268c8710000","topic_id":"5161dd617f123bd25900013d","body":"^ Obama is a greedy jerk.","author":"50884a9b7f123b4053000d18"},{"id":"53615b276368726e81920000","topic_id":"5161dd617f123bd25900013d","body":"\"@gasmaskangel\":/dis/the-time-wasting-thread/post/53615a716368720b50ae0200#post_53615a716368720b50ae0200\r\nProbably not.  Christie was the only potential candidate that could have defeated hillary and well there went the neighborhood.\r\n\r\n\r\nYeah being president really stresses you out.","author":"38b55cdf63616403d7560600"}]}