{"topics":[{"id":"536161666368722863520000","topic_id":"5161dd617f123bd25900013d","body":"\"@And Brother I Hurt People\":/dis/the-time-wasting-thread/post/53614aef6368725917980000#post_53614aef6368725917980000\r\nSadly from what I can see, Nope.\r\n\r\nWe're gonna have to use watch later and Like a fuck lots of things now if we want to see them again later.","author":"50c204917f123b31440000a5"},{"id":"536168526368724d977f0000","topic_id":"5161dd617f123bd25900013d","body":"This is awesomely cool!\r\nhttps://www.youtube.com/watch?v=SObzNdyRTBs\r\n\r\n3D printing houses is officially here.  Imagine how much cheaper houses and buildings could be this way.","author":"38b55cdf63616403d7560600"},{"id":"536169bb636872797b760000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/536168526368724d977f0000#post_536168526368724d977f0000\r\nthen government will keep it down so as not to make people lose jobs.\r\n\r\nTHIS IS YOUR DEMOCRACY AHAHAHAHAHAHA!","author":"4fe16df67f123b13e400003f"},{"id":"53616aab6368721de1230000","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/536169bb636872797b760000#post_536169bb636872797b760000\r\nAnyone else find it ironic that the usa constantly goes on about \"free market capitalism\" and yet freaks the fuck out whenever a new technology comes in and potentially change everything?","author":"38b55cdf63616403d7560600"},{"id":"53616b85636872285d560000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/53616aab6368721de1230000#post_53616aab6368721de1230000\r\nThe US is one of the least free economies in the western world. That is ironic.","author":"4fe16df67f123b13e400003f"},{"id":"53616ce56368724c8d540000","topic_id":"5161dd617f123bd25900013d","body":"This technology while it can't make electrical components or such can make things like skyscrapers' structure, the body and interior of cars, roads, bridges, houses, furniture and so forth.\r\n\r\nImagine how much cheaper that will make things.  If you can just make a skyscraper's structure this way holy crap that's going to be cheaper.","author":"38b55cdf63616403d7560600"},{"id":"53617a8263687270ad710100","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/53616ce56368724c8d540000#post_53616ce56368724c8d540000\r\n\"I want a mansion with an Olympic sized swimming pool, a large garden, 15 bedrooms, two kitchens on the east and west wings, a grand staircase, a rollercoaster, lots of bathrooms, an arcade and entertainment room, a garage full of Porches and Ferraris, a fountain, a library and a coffee table.\"\r\n\r\n\"That will be 20,000 dollars, cash only.\"\r\n\r\n\"Damn, that's cheap!\"","author":"4fe1b9f47f123b13df002976"},{"id":"536181ee6368724988bc0000","topic_id":"5161dd617f123bd25900013d","body":"\"@HJSDGCE\":/dis/the-time-wasting-thread/post/53617a8263687270ad710100#post_53617a8263687270ad710100\r\nAlthough massively sarcastic that kind of is what it could do costs wise.  A lot of costs when it comes to building large buildings is constructing everything, transporting it onto site, laying down the concrete and a lot of stuff.  While it won't make hundreds of millions dollar houses something you can buy it would massively reduce the sticker price.\r\n\r\n\r\n\r\nOh hey another win for glbt rights in the usa:  Transgender rights in schools are now protected under title 9.\r\n\r\n\r\n\r\nAlso a bit of politics:\r\n2014 midterm elections in the usa are not as big of a deal as how much it's getting played out to be.  Short version is we're in for the same shit the next two years in congress.  Only 6 senate seats are contested; republicans aren't going to gain control of senate cause the probability of them gaining all six contested seats is too low.  It would be like having to hit six home runs in winnie the pooh's homerun derby against christopher robin in a row.  There I just saved you months worth of hearing about this on the news.\r\n\r\nMost likely outcome of the 2014 elections summarized in one sentence:\r\nBetween 53 to 51 for democrats and 47 to 49 for republicans.","author":"38b55cdf63616403d7560600"},{"id":"53618cd36368725621580100","topic_id":"5161dd617f123bd25900013d","body":"remember those times when you were a kid and you were afraid of the devil, the boogeyman, goblins skeletons n stuff?\r\n\r\nits funny how once you grow up you learn to fear more your own kin.\r\n\r\nfuck urban legends, ufos, ghost and that stuff, im more afraid of a thief or a guerrila attack.","author":"5154c5237f123bcd580002fc"},{"id":"5361903863687269fd740000","topic_id":"5161dd617f123bd25900013d","body":"\"Glowing plants, anyone\":http://www.glowingplant.com/?","author":"50b70eeb7f123b1a02000097"},{"id":"5361905563687269fd830000","topic_id":"5161dd617f123bd25900013d","body":"\"@twistedmetalero\":/dis/the-time-wasting-thread/post/53618cd36368725621580100#post_53618cd36368725621580100\r\nyoure never exposed to the darker side of humanity until youre older so when youre younger you create your own things to be afraid of","author":"4ffbfff37f123b072a01bb5b"},{"id":"53619065636872697c680000","topic_id":"5161dd617f123bd25900013d","body":"\"@MoogSourceVermona\":/dis/the-time-wasting-thread/post/5361905563687269fd830000#post_5361905563687269fd830000\r\n#sodeep","author":"4ffbfff37f123b072a01bb5b"},{"id":"53619bda63687248b90f0000","topic_id":"5161dd617f123bd25900013d","body":"so i dont know what the fuck happened, but after running bleach bit my local disc are just FILLED, i mean my disc d was in 400 now its in 200 gb.\r\n\r\nall i know is i got these really big tmp and random letter blank files, which im deleting.","author":"5154c5237f123bcd580002fc"},{"id":"53619c3a6368724861300000","topic_id":"5161dd617f123bd25900013d","body":"\"@twistedmetalero\":/dis/the-time-wasting-thread/post/53619bda63687248b90f0000#post_53619bda63687248b90f0000\r\nThat's cause bleachbit has to fill those areas then delete them to overwrite them.\r\n\r\nIf you interrupted it then you're going to have to rerun it again and do NOT interrupt it.  That's why I said to not interrupt it, cause in order to overwrite unused space and delete deleted files that just have their registry. . . Short easy version is you don't want to interrupt bleachbit otherwise you'll have this problem, rerun it, don't interrupt it and fixed.  It has to 100% complete uninterrupted so it doesn't cause this problem.\r\n\r\nTl:dr; This problem is cause it was interrupted, just rerun it, wait until it says \"Done\" then fixed.","author":"38b55cdf63616403d7560600"},{"id":"53619d476368722101470100","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/53619c3a6368724861300000#post_53619c3a6368724861300000\r\n\r\nbut i left it overnight.\r\n\r\ngoddamit.","author":"5154c5237f123bcd580002fc"},{"id":"53619d6d63687269e35d0000","topic_id":"5161dd617f123bd25900013d","body":"\"@twistedmetalero\":/dis/the-time-wasting-thread/post/53619d476368722101470100#post_53619d476368722101470100\r\nYour computer probably timed out and restarted, or your computer updated and restarted.","author":"38b55cdf63616403d7560600"},{"id":"53619ddb63687248333c0100","topic_id":"5161dd617f123bd25900013d","body":"!http://www.everydaynodaysoff.com/wp-content/uploads/2009/12/556-AK-100-round.jpg!\r\n\r\n!http://i.imgur.com/ldwm6.jpg!\r\n\r\n\"Sometimes real life is a cartoon.\" -my friend when he sent me these photos.","author":"4fe4bf947f123b175b000001"},{"id":"53619e3d6368724861590100","topic_id":"5161dd617f123bd25900013d","body":"\"@AaronMk\":/dis/the-time-wasting-thread/post/53619ddb63687248333c0100#post_53619ddb63687248333c0100\r\nIn case of zombie apocalypse have him on your survivor team.","author":"38b55cdf63616403d7560600"},{"id":"53619ea6636872094a2c0000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/53619e3d6368724861590100#post_53619e3d6368724861590100\r\n\r\nHe's more or less in the military so he'd be default if he wasn't in Maryland.","author":"4fe4bf947f123b175b000001"},{"id":"53619f916368722662210000","topic_id":"5161dd617f123bd25900013d","body":"\"@HJSDGCE\":/dis/the-time-wasting-thread/post/53617a8263687270ad710100#post_53617a8263687270ad710100\r\nWhile that may sound good, think of the consequences of that. If everyone can have a cheap house that means for more people will have houses which means far more crowding. Not to mention people who already can have a house can now have a much bigger one. Land will be used up fast. In my area a place that used to be untouched wilderness is now a suburb full of yuppies. A place where I liked to go to take walks and fish and such is now someones backyard poisoned with fertilizer and pesticides which run of in the rain into what little of the wilderness is left.\r\n\r\nAlso think of what that will do to apartment owners. Landlords will lose tenets who can now afford a house and thus may have to raise prices for the people that choose to stay. Property prices will go up quickly as more land becomes scarce also.","author":"5010fa077f123b1e4f00104e"},{"id":"5361a2496368726ace3e0000","topic_id":"5161dd617f123bd25900013d","body":"\"@someguy111\":/dis/the-time-wasting-thread/post/53619f916368722662210000#post_53619f916368722662210000\r\nOkay, I have to correct something here; if house prices are slashed by a third then while yes people want bigger houses, but apartments and skyscrapers as well become much cheaper as well.\r\n\r\nThe biggest effect this would have on the economy is people would have more disposable income.  Say your current house/apartment costs $1000.00/month and the next apartment you move into only costs $666.66/month then that $233.33 extra a month in your pocket is going into the economy.\r\n\r\nAlso people are moving more and more into cities, not into the country.\r\n\r\n\r\nThe biggest problem this would cause is millions of homes would go without owners until they finally fall down due to being abandoned for so long. . Oh wait, cause of the housing crash we already have that problem.","author":"38b55cdf63616403d7560600"},{"id":"5361a4b363687256dcb80100","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5361a2496368726ace3e0000#post_5361a2496368726ace3e0000\r\nTrue, but it will also increase mortgage rates because the lower prices mean the same percent will yield less interest for the banks. People looking to buy an existing house will now have to pay a higher rate to make up for the loss of interest. Also property taxes will go up as the overall value of a property includes what the house is worth. Let's say the a property is worth 150k with the property it self worth 10k and the other 140 for the house. if the property tax is 4mils that's 600 dollars per year. Now if the price dropped on the house from 140 to say 50, the total cost would be 60. At 4mils that would be 240 dollars a year. The city would have to raise the property tax to get back the money it would lose. That means that everyone in the area would have to pay more. Not to mention property prices will increase as well as more land used up.","author":"5010fa077f123b1e4f00104e"},{"id":"5361a4b36368721872730000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5361a2496368726ace3e0000#post_5361a2496368726ace3e0000\r\nTrue, but it will also increase mortgage rates because the lower prices mean the same percent will yield less interest for the banks. People looking to buy an existing house will now have to pay a higher rate to make up for the loss of interest. Also property taxes will go up as the overall value of a property includes what the house is worth. Let's say the a property is worth 150k with the property it self worth 10k and the other 140 for the house. if the property tax is 4mils that's 600 dollars per year. Now if the price dropped on the house from 140 to say 50, the total cost would be 60. At 4mils that would be 240 dollars a year. The city would have to raise the property tax to get back the money it would lose. That means that everyone in the area would have to pay more. Not to mention property prices will increase as well as more land used up.","author":"5010fa077f123b1e4f00104e"},{"id":"5361a6bd6368725cac4c0000","topic_id":"5161dd617f123bd25900013d","body":"\"@someguy111\":/dis/the-time-wasting-thread/post/5361a4b363687256dcb80100#post_5361a4b363687256dcb80100\r\nOkay, let me stop you here.  There's 25 houses for every homeless person in the usa; we have so many unused houses that detroit is outright giving people houses for near free rather than having to pay the demolition costs.  We already have this problem.\r\n\r\nAll these new houses would do is cause the exact same problem at the exact same rate _just_ in a different manner.\r\n\r\nIt's like saying puffing carcinogenic aerosol spray cans would give you \"super\" lung cancer vs \"regular\" lung cancer from cigarettes.  Either way you're going to have lung cancer and there is no such thing as \"super\" cancer.","author":"38b55cdf63616403d7560600"},{"id":"5361a81f63687262f9ac0000","topic_id":"5161dd617f123bd25900013d","body":"\"cut your fucking head off and ask where you are headed off too.\r\nget it headed off too?\" ","author":"5154c5237f123bcd580002fc"}]}