{"topics":[{"id":"5361dc486368723d52110000","topic_id":"5161dd617f123bd25900013d","body":"\"@twistedmetalero\":/dis/the-time-wasting-thread/post/5361dbaa636872281d510000#post_5361dbaa636872281d510000\r\nDo you have a windows disk for your computer?","author":"38b55cdf63616403d7560600"},{"id":"5361dc8763687236836e0000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5361dc486368723d52110000#post_5361dc486368723d52110000\r\nno, i only have a motherboard disck, display drivers and lg monitor","author":"5154c5237f123bcd580002fc"},{"id":"5361ddf4636872265d900100","topic_id":"5161dd617f123bd25900013d","body":"Should there be a dinosaur apocalypse game?","author":"50b70eeb7f123b1a02000097"},{"id":"5361de046368724e4c970000","topic_id":"5161dd617f123bd25900013d","body":"\"@twistedmetalero\":/dis/the-time-wasting-thread/post/5361dc8763687236836e0000#post_5361dc8763687236836e0000\r\n. . . . Ughhhhh.  You know the phrase, \"up shit creek without a paddle\"?  Well this is more along the lines of up shit ocean without a paddle.\r\n\r\nI know the work around to this, but it would take a long ass time to fix even if I was there.","author":"38b55cdf63616403d7560600"},{"id":"5361dec76368725bcdb30000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5361de046368724e4c970000#post_5361de046368724e4c970000\r\n\r\nat this point i ahve just given up hope, but whatever.","author":"5154c5237f123bcd580002fc"},{"id":"5361e0ab6368724aca9c0200","topic_id":"5161dd617f123bd25900013d","body":"\"@twistedmetalero\":/dis/the-time-wasting-thread/post/5361dec76368725bcdb30000#post_5361dec76368725bcdb30000\r\nYou could potentially contact microsoft asking for a replacement windows installation disk and go through the steps, it's a pain in the ass and they have to physically mail it to you, or you could go to the people who you bought your computer from asking for help.\r\n\r\nThe \"fast\" way of fixing this at home I'm not going to help you with cause it would be too easy to mess up with even a single typo that requires moderate amounts of computer knowledge and if something does happen then that's it game over.","author":"38b55cdf63616403d7560600"},{"id":"5361e0ee6368720ae0ec0000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5361e0ab6368724aca9c0200#post_5361e0ab6368724aca9c0200\r\n\r\nwell apparently having 32 bits doesnt affect nothing if you have 4gb of ram.\r\n\r\nso ill just give up, and send it to be completely repaired.\r\n\r\nit was fun, except not.","author":"5154c5237f123bcd580002fc"},{"id":"5361e3706368726dc5090000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5361e0ab6368724aca9c0200#post_5361e0ab6368724aca9c0200\r\n\r\nhey, what about this\r\n\r\nhttp://www.pcworld.com/article/248995/how_to_install_windows_7_without_the_disc.html ","author":"5154c5237f123bcd580002fc"},{"id":"5361e496636872553b380100","topic_id":"5161dd617f123bd25900013d","body":"\"@twistedmetalero\":/dis/the-time-wasting-thread/post/5361e3706368726dc5090000#post_5361e3706368726dc5090000\r\n[bq=\"twistedmetalero\"]\"@uc9\":/dis/the-time-wasting-thread/post/5361e0ab6368724aca9c0200#post_5361e0ab6368724aca9c0200\r\n\r\nhey, what about this\r\n\r\nhttp://www.pcworld.com/article/248995/how_to_install_windows_7_without_the_disc.html [/bq]\r\nI've done that before, but using a different method.  If you have a windows 7 iso it should work.\r\n\r\nFor the love of god be extremely careful while doing this.  Also make absolutely sure you have your windows product key.","author":"38b55cdf63616403d7560600"},{"id":"5361e5136368726dc50b0100","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5361e496636872553b380100#post_5361e496636872553b380100\r\nsee, things like that just get me scared, i mean i got the serial, but i dont trust in me enough to know that i will not somehow screw this up even if i print the instructions\r\n\r\ni mean i still got my tablet if that helps, like get isntructions while doing it or something.","author":"5154c5237f123bcd580002fc"},{"id":"5361e5536368721418370000","topic_id":"5161dd617f123bd25900013d","body":"\"This dude...\":http://www.fstdt.com/QuoteComment.aspx?QID=69825.","author":"50b70eeb7f123b1a02000097"},{"id":"5361e5af63687219293a0000","topic_id":"5161dd617f123bd25900013d","body":"\"@Randomosaur\":/dis/the-time-wasting-thread/post/5361e5536368721418370000#post_5361e5536368721418370000\r\n\r\ni feel like logging in and type something like that.","author":"5154c5237f123bcd580002fc"},{"id":"5361e6436368721d9ea80000","topic_id":"5161dd617f123bd25900013d","body":"\"@twistedmetalero\":/dis/the-time-wasting-thread/post/5361e5af63687219293a0000#post_5361e5af63687219293a0000\r\nYou're already logged into here, pothead.","author":"50b70eeb7f123b1a02000097"},{"id":"5361e65f6368721418fd0000","topic_id":"5161dd617f123bd25900013d","body":"\"@twistedmetalero\":/dis/the-time-wasting-thread/post/5361e5136368726dc50b0100#post_5361e5136368726dc50b0100\r\nGo into your control panel and browse around and you should see something along the lines of \"serial key\"; for the love of god write that down first.","author":"38b55cdf63616403d7560600"},{"id":"5361e70c6368723d80310000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5361e65f6368721418fd0000#post_5361e65f6368721418fd0000\r\n\r\nok i dont have a serial number.\r\n\r\nand i just remembered the guy didint put one neither while formatting.\r\n\r\nso what does that mean.","author":"5154c5237f123bcd580002fc"},{"id":"5361e82063687250ca320000","topic_id":"5161dd617f123bd25900013d","body":"\"@twistedmetalero\":/dis/the-time-wasting-thread/post/5361e70c6368723d80310000#post_5361e70c6368723d80310000\r\nDon't touch it.\r\n\r\nGo into your windows control panel and I'm not sure where, but somewhere it should list \"serial key\" or \"product key\".  I'm not on my windows 7 partition right now cause I'm in the process of doing something.  Fidget around with the tabs to try and find it.\r\n\r\nUntil you find out your serial key do not reinstall windows from thumbdrive cause without that serial key you will not be able to reinstall.","author":"38b55cdf63616403d7560600"},{"id":"5361e96d6368725d7eef0000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5361e82063687250ca320000#post_5361e82063687250ca320000\r\n\r\nbut thats how the guy format the pc.\r\n\r\nand he didint put a product key.\r\n\r\nim lost, gonna find it anyway, but if the pc doesnt give me an answer then who does.","author":"5154c5237f123bcd580002fc"},{"id":"5361ebd063687254862d0200","topic_id":"5161dd617f123bd25900013d","body":"\"@twistedmetalero\":/dis/the-time-wasting-thread/post/5361e96d6368725d7eef0000#post_5361e96d6368725d7eef0000\r\nAt this point it's better just to put it in for repairs.","author":"38b55cdf63616403d7560600"},{"id":"5361ec4b6368722b69250000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5361ebd063687254862d0200#post_5361ebd063687254862d0200\r\n\r\nif you say it, then i gues better just give up\r\n\r\nnow its just gonna be like a week where i wish i could enter a coma until it gets repaired.","author":"5154c5237f123bcd580002fc"},{"id":"5361ed4b6368722df7a50000","topic_id":"5161dd617f123bd25900013d","body":"\"@twistedmetalero\":/dis/the-time-wasting-thread/post/5361ec4b6368722b69250000#post_5361ec4b6368722b69250000\r\nIf you try to reinstall windows through a usb drive and don't have the right information it might accidentally brick your computer if the company you bought it from doesn't have the key on record.  If you try to reinstall windows without it and you accidentally brick it and they don't have it either then tough luck buddy.","author":"38b55cdf63616403d7560600"},{"id":"5361ed7f63687202752d0200","topic_id":"5161dd617f123bd25900013d","body":"Does anyone here read \"Lio?\":http://www.gocomics.com/lio/2006/05/15#.U2HtbfldUnM","author":"5062d6f17f123b3e16001184"},{"id":"5361edd16368723201e70000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5361ed4b6368722df7a50000#post_5361ed4b6368722df7a50000\r\n\r\nfine geez i get it.\r\n\r\nignorant dude tries to repair computer, accidentaly bonks it, cries all week.","author":"5154c5237f123bcd580002fc"},{"id":"5361ee8b63687244ad990000","topic_id":"5161dd617f123bd25900013d","body":"\"@twistedmetalero\":/dis/the-time-wasting-thread/post/5361edd16368723201e70000#post_5361edd16368723201e70000\r\nI'm not calling you ignorant; I just realize a lot of people aren't familiar with computers and don't want you to accidentally brick it.","author":"38b55cdf63616403d7560600"},{"id":"5361fce86368726078700100","topic_id":"5161dd617f123bd25900013d","body":"Really interesting computer related long post:\r\n\r\nOh before I go to bed I had a talk with my brother today that was pretty interesting; I'll spare you the boring bits though.\r\n\r\nSteamOS may become the default home computer operating system on most home computers. . . Hold on let me explain.\r\n\r\nThe benefits for linux is that it's customizable where you are allowed to make programs and such for it without getting a legal bitchslap to the face, it's free and it's a stable operating system, *BUT* it's not user friendly.\r\nThe benefits for mac is that it's stable and user friendly, *BUT* you have to jump through a ass load of legal hoops to get your products on it otherwise you may get a court ordered bitchslap from apple.\r\nThe benefits for windows is that you are allowed to make programs and such for it openly, it's user friendly, *BUT* it's not stable and has a ton of viruses.\r\n\r\nBig name companies are always going to use windows due to licensing and such.  Your computer at work will always either be windows or potentially a mac.  The home market on the other hand is a different thing though.  If steam makes steamos a user friendly operating system then chances are in ten years time you're office computer will still be using windows, but your home computer will be using steamos.\r\n\r\nMicrosoft is always going to be a huge company; it's just that there may be a contender for the home computer market.\r\n\r\nDon't get steamos yet; they're still massively working on it.  It's doing a lot better, but there's still a lot of things that need fixing.\r\n\r\nLinux to use a metaphor is like one of those insanely old trucks that even though no one has maintained it properly in years and has been rusting away it still works.  Right now what valve is doing is basically cleaning off all the bird crap, giving it a new body shell, replacing the broken tail lights, checking to see what need to be replaced, what is fine, replacing the brakes and just giving it a bunch of tender loving care that it deserves.  Don't install steamos yet cause valve isn't done yet fixing linux; if you install it now you're just going to wind up sitting in a pile of bird crap.  I like what linux can do, but it needs some serious work before it's road worthy.\r\n\r\n\r\nOne of the biggest things that might probably happen in 2-4 years is that the default operating system installed on home computers when you buy it might be steamos.  Why?  Cause why pay microsoft for every copy of windows they need to install on the computers when you can have a free operating system that functions the same?  If you're wondering what I mean by this is that for every computer you buy computer companies have to pay for every single serial key for every computer.  Sure they all use the same install disc and sure they bargain with microsoft for lower prices, but that's still a lot of money when you factor in how many computers are made annually worldwide.\r\n\r\n\r\nTl:dr; SteamOS may become your home computer operating system cause businesses are cheap and will want to save money; windows will always be your business office operating system though.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nThe second thing me and my brother were talking about is consoles and yeah there's a potential big change we're going to see the next couple of years with gaming consoles.  You know how I've been going on about portable consoles?  That probably is going to be the future of console gaming.  A console that you can plug into your tv or take it on the go and game.  Short version of why since this is already a long post is that nintendo has a problem with their console, whereas sony can't make a successful handheld and microsoft wants to try, but they don't know how.  We're reaching the point in gaming where by the time it's time for the next console having a cheap portable console is a reality without sacrificing gameplay.","author":"38b55cdf63616403d7560600"},{"id":"536200726368723d730e0100","topic_id":"5161dd617f123bd25900013d","body":"so what do you do when a folder its like 10 times bigger than its content inside?","author":"5154c5237f123bcd580002fc"}]}