{"topics":[{"id":"53670d2563687239968b0100","topic_id":"5161dd617f123bd25900013d","body":"(Continue watching Bakemonogatari and into the episode with the catgirl)\r\nCatgirl goes, \"Nyahaha. Is this what they mean by 'a cat is fine too'?\"\r\n\r\nOh shit!  They actually went there!  They actually did go there.","author":"38b55cdf63616403d7560600"},{"id":"53671b1263687244e32a0000","topic_id":"5161dd617f123bd25900013d","body":"\"Nazi UFO conspiracy theory\":http://en.wikipedia.org/wiki/Nazi_UFOs ","author":"50b70eeb7f123b1a02000097"},{"id":"53671b7c63687277778c0100","topic_id":"5161dd617f123bd25900013d","body":"\"@Randomosaur\":/dis/the-time-wasting-thread/post/53671b1263687244e32a0000#post_53671b1263687244e32a0000\r\n\r\nthey couldnt even make the v3 weapon right, they think they can actually make an ufo better than how the americans got it?","author":"5154c5237f123bcd580002fc"},{"id":"53672cd56368726d3d1f0000","topic_id":"5161dd617f123bd25900013d","body":"\"@Randomosaur\":/dis/the-time-wasting-thread/post/53671b1263687244e32a0000#post_53671b1263687244e32a0000\r\nIron Sky was actually a documentary.","author":"5007bbdf7f123b112f00023a"},{"id":"5367367063687242d22e0000","topic_id":"5161dd617f123bd25900013d","body":"Man this thread gets boring at night.\r\n\r\n\r\n\r\n\r\n[spoiler]I've been thinking, hey it's what I primarily do, and a while back I posted that I utterly felt like shit cause of what's going on in my life right now and I actually feel a lot better today now that I've thought things through.  In case you weren't here basically my family and past friends are fucking insane to the point I've broken contact with all my past friends, burned a ton of bridges and the only family I keep in contact with is my immediate family.  I was having a huge nervous breakdown cause I realized I was never allowed to \"be myself\", but after thinking things through I don't actually have a \"self\" in the traditional meaning.  What I mean by this is a couple days ago I was freaking out that I realized that I was for so long forced to like/not like things and behave in certain ways.  In other words, \"You HAVE TO like/not like/hate/love <insert something here>\".\r\n\r\nIronically I'm feeling a hell of a lot better today cause I realized I don't have the traditional version of a \"self\".  What I mean by this is that I realized that one of the biggest problems for me psychologically for the past few years wasn't the id or the ego, but the superego.  I think the last few psychological problems I've been having I just overcame the last couple of days because I realized that my superego was under the belief that in order to overcome something that you have internalize every component and think on it; aka the stages of acceptance.  Ironically for me that's a huge ass lie cause the more and more I thought about it I just straight up don't care about certain things.\r\n\r\nTo make it short; I realized that I was taught that the only way to deal with things was to lie to myself until I believed them which has been causing me stress cause that directly contradicts my actual personality.  Ironically I'm feeling better tonight cause I realized I don't have any real thoughts upon things I care about.  In other words I don't care about my old friends and unlike most people I don't have any other real ways to describe my personality other than the basics.  I don't have a favourite music band/music genre/movie/movie/genre/news source/political party/food/drink/icecream/car/artist/youtuber/etc, nor do I have many actual likes or dislikes, nor do I have any actual motivation in life, nor do I have any real reason for undertaking any action. . . nor do I have any real wishes or desires.  It wasn't out of spite or anything, but out of their being so high strung all the time believing that *EVERYTHING* must always be going at 100 miles an hour and that you need to say/think/like/dislike this, that and so forth in order to get anywhere.  (I have thoughts on a lot of things, but I don't actually have many actual likes or dislikes in actuality)\r\n\r\nI'm feeling much better tonight cause I realized what's been massively stressing me out the last couple of years is external stress caused by individuals trying to force me to act in a completely different manner to my actual personality under the belief that everything must be always high strung and going 100 miles an hour worrying about how every little thing will permanently effect your life.[/spoiler]\r\n\r\nTl:dr; I'm finally going to get some sleep tonight cause I realized my family and friends are way too high strung to the point they need medication just to calm down enough to sleep and that they've been so high strung 24/7 to the point that it's been effecting me emotionally and psychologically. . . No seriously, I'm the only person in the family that doesn't have a almost outright panic attack if I'm a minute late to leave somewhere.\r\n\r\nTl:dr; of Tl:dr; I've been stressed cause I'm like if you put a sloth in a extremely stressful situation.","author":"38b55cdf63616403d7560600"},{"id":"5367379b6368725851240000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5367367063687242d22e0000#post_5367367063687242d22e0000\r\nGood job dude.\r\nYeah, sometimes life can be very stressful.\r\nWait, did I say sometimes? \r\nI meant all the time.\r\n\r\n","author":"4fe1b9f47f123b13df002976"},{"id":"53673cfa6368724ea9060000","topic_id":"5161dd617f123bd25900013d","body":"\"@HJSDGCE\":/dis/the-time-wasting-thread/post/5367379b6368725851240000#post_5367379b6368725851240000\r\nIt's kind of weird how good the animal analogy works.  My family is like a bunch of rabbits, anyone that has owned rabbits knows how stressed they can get, whereas I'm like a sloth.  If you put a sloth in a group of a bunch of rabbits even though they mean no harm it's going to freak the sloth out.\r\n\r\nThey mean no harm, but it's extremely stressful to be around people that are practically always having panic attacks and that everything and anything must have a set schedule and organization down to the letter.  For april fools I would pull pranks on them as simple as something like hiding their glasses somewhere or putting dvds in the wrong cases, but I have a feeling that would give them heart attacks.","author":"38b55cdf63616403d7560600"},{"id":"5367433d63687242da560000","topic_id":"5161dd617f123bd25900013d","body":"\"Shameless self-promotion\":https://derpibooru.org/rp/the-living-fossils-possible-nsfw-violence","author":"50b70eeb7f123b1a02000097"},{"id":"53676c086368722518110000","topic_id":"5161dd617f123bd25900013d","body":"So I just got my Copy of Tatsunoko Vs. Capcom Back!","author":"50c204917f123b31440000a5"},{"id":"53677a7a6368723378a00000","topic_id":"5161dd617f123bd25900013d","body":"It seems i can't stand sunlight anymore. I have to wear sunglasses when outside or my eyes hurt, even in overcast weather. \r\n\r\nNow i just need a coffin to sleep in.","author":"5007bbdf7f123b112f00023a"},{"id":"53677e116368726f73350100","topic_id":"5161dd617f123bd25900013d","body":"\"@PaskaNaakka\":/dis/the-time-wasting-thread/post/53677a7a6368723378a00000#post_53677a7a6368723378a00000\r\nOh my god, _IT'S DIO!_","author":"50c204917f123b31440000a5"},{"id":"53677f3c63687229e8240000","topic_id":"5161dd617f123bd25900013d","body":"Oh god I forgot how Bad the Internet to the Wii is.\r\n\r\nI've been sitting around waiting for a match for like 30 minutes now.","author":"50c204917f123b31440000a5"},{"id":"536783e563687279cdda0000","topic_id":"5161dd617f123bd25900013d","body":"\"@Number1pegasus\":/dis/the-time-wasting-thread/post/53677f3c63687229e8240000#post_53677f3c63687229e8240000\r\n50 Minutes","author":"50c204917f123b31440000a5"},{"id":"5367abe7636872045ba20000","topic_id":"5161dd617f123bd25900013d","body":"\"@PaskaNaakka\":/dis/the-time-wasting-thread/post/53677a7a6368723378a00000#post_53677a7a6368723378a00000\r\n[bq=\"PaskaNaakka\"]It seems i can't stand sunlight anymore. I have to wear sunglasses when outside or my eyes hurt, even in overcast weather. \r\n\r\nNow i just need a coffin to sleep in.[/bq]\r\n(pulls out a highlander sword)\r\nThere can only be one!","author":"38b55cdf63616403d7560600"},{"id":"5367acba63687225dc2a0000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5367abe7636872045ba20000#post_5367abe7636872045ba20000\r\nDo Highlanders and vampires have that much n common?\r\nAnd on a somewhat related note, I just finished marathoning Supernatural.\r\nThat was a waste of a month.","author":"4fde4618945b700aa0002fff"},{"id":"5367af156368722381e00100","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/5367acba63687225dc2a0000#post_5367acba63687225dc2a0000\r\nDid you like the show?\r\n\r\n\r\n\r\nAlso a bit of cool news:\r\nYou know how they've been 3d printing organs in the medical field?  They've figured out how to have blood vessels in the organs thus making 3d printed organs for everyday use more of a reality.\r\n\r\nThe most likely current outcome is for testing medicine before it reaches human testing.  Basically much safer medication in the long run.  While you probably won't be getting a 3d printed heart for a couple years you will get medicine that is much less likely to accidentally harm you and these medicines will reach market much faster.  So basically speeding up medical research into medicine and it much less likely to cause adverse reactions.","author":"38b55cdf63616403d7560600"},{"id":"5367afab63687251c2db0000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5367af156368722381e00100#post_5367af156368722381e00100\r\nShort answer: Not really.\r\nMy boyfriend is obsessed with it, probably because Dean is hot.","author":"4fde4618945b700aa0002fff"},{"id":"5367b2a76368723252020000","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/5367afab63687251c2db0000#post_5367afab63687251c2db0000\r\nSooooo what are your thoughts on destial?","author":"38b55cdf63616403d7560600"},{"id":"5367b37363687230f2a30000","topic_id":"5161dd617f123bd25900013d","body":"Anyone play Warframe?\r\nCome on, it can't just be me.","author":"4fe1b9f47f123b13df002976"},{"id":"5367b4e16368725de33c0000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5367b2a76368723252020000#post_5367b2a76368723252020000\r\nMeh.","author":"4fde4618945b700aa0002fff"},{"id":"5367b70563687209906d0000","topic_id":"5161dd617f123bd25900013d","body":"You know is it just me or has horror movies in hollywood lately taken a huge nosedive in quality?  They should make a scp movie instead.","author":"38b55cdf63616403d7560600"},{"id":"5367b84f6368722bbb730000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5367b70563687209906d0000#post_5367b70563687209906d0000\r\nNone of their movies scary me anymore. Just grotesque.","author":"4fde5cee945b700a970060fc"},{"id":"5367cdf7636872395f720000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5367b70563687209906d0000#post_5367b70563687209906d0000\r\n\r\nwatch as hollywood makes movies out of creepypastas.\r\n\r\n\"next summer sonic.exe, the movie, out now\"","author":"5154c5237f123bcd580002fc"},{"id":"5367e7e463687236c84c0000","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/5367b84f6368722bbb730000#post_5367b84f6368722bbb730000\r\n[bq=\"SeraphimDawn\"]\"@uc9\":/dis/the-time-wasting-thread/post/5367b70563687209906d0000#post_5367b70563687209906d0000\r\nNone of their movies scary me anymore. Just grotesque.[/bq]\r\nSame with _most_ video games and so forth.\r\n\r\nCrap polio is back.\r\n\r\n\r\n\r\n\r\n\r\nYou know the more I read about the news I have to say karl marx was right about the proletariat distractions away from actually important information to trivial matters.  What I mean by this is to use a example foxnews outright cut off obama during a press report because no one was asking him about benghazi.  When you get right down to it the single biggest function of the news is to make it seem like they're not inept or biased politically so as to generate a profit.\r\n\r\nIn others words the \"news\" and a lot of high profile individuals focus on \"Benghazi\", \"Obamacare death camps\" and so forth instead of actual information because when you get right down to it they're not actually doing it out of spite, but rather the vast majority of them are essentially stupid and inept.  Out of all the 24/7 news reporters there's only a handful of them that actually know what the hell they're talking about.\r\n\r\nAnother example of this is the nsa.  The director of the nsa doesn't know what the hell he's doing; the only people that actually know what they're doing is the people who actually run the servers and if they open their mouths on how to do it more efficiently they'll straight up get fired.  \"What do you mean storing this amount of information doesn't actually work?!  What do you mean using pattern recognition software is more effective at predicting attacks and crimes?! *YOU'RE FIRED!*\"  Oh wait that's what happened to snowden; he opened his mouth, was ignored, blew the whistle on the nsa and is now considered a war criminal.\r\n\r\nIf I had to give a reason why the world is a better world today than a hundred years ago is that for the most part those in charge of the world only got there out of who they were related to/they bought their way in/they were buddies with someone in group.\r\n\r\nIt makes sense really, because if you have a bunch of dumb people in charge of a company/organization and giving orders to the smart people who actually run the company/organization then no matter how much effort by those lower on the totem pole the group will eventually falter and massively fuck up.  We've all worked at companies like that were the boss doesn't work, just doesn't know what he's doing and all he does is bark orders expecting the orders to somehow magically happen.\r\n\r\n\r\n\r\n\r\n\r\nTl:dr;  Most of the world is ran by idiots.\r\nhttps://www.youtube.com/watch?v=BKorP55Aqvg\r\nThe last time a country had a leader that was effective and knew how to run his country correctly Alexander conquered the entire *known* world.  You can say, \"Oh <insert here> did just a good as a job also\", but can you really say anyone has ever gone that far as to conquer the entire *known* world?","author":"38b55cdf63616403d7560600"},{"id":"5367f51e6368725387030100","topic_id":"5161dd617f123bd25900013d","body":"You know, Gizoid has gotten me thinking, There should be a crossover between \"Goshogun\":http://www.youtube.com/watch?v=1E0091gTeRg and Megas XLR\r\n\r\nThey're both affectionate Parodies of Mecha that are good in their own right","author":"5062d6f17f123b3e16001184"}]}