{"topics":[{"id":"52f5935d6368723c2fe90200","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/52f592ba63687241ff410200#post_52f592ba63687241ff410200\r\nYou don't like the laws of one jurisdiction, go to another.\r\nThe internet should remain a common meeting ground for ideas from all over.","author":"4fde5cee945b700a970060fc"},{"id":"52f5937d6368723fcd560300","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/52f5935d6368723c2fe90200#post_52f5935d6368723c2fe90200\r\n\r\nWhen it's local, good idea.\r\n\r\nFederal on the other hand...","author":"4fdfbf92945b7075d50036e4"},{"id":"52f59548636872443d030000","topic_id":"5161dd617f123bd25900013d","body":"Ever wonder why Europeans lead the world in progress for many years, and China didn't? Despite how sophisticated China was back during the time Europeans were dealing with the _Dark Ages_, China was too centralized, the Emperor had unprecedented power over his people, and decided to close the nation off to the rest of the world for centuries, halting exploration all together for centuries. No one dared to question Imperial authority. While in Europe, you had many cultures and nations with different ideas trying to trump each other. That, gave Europeans incentives to innovate and explore the world. Those nations that decided to think beyond the box thrived, while those that isolated themselves rotted away. \r\n","author":"4fde5cee945b700a970060fc"},{"id":"52f59623636872450a810000","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/52f5935d6368723c2fe90200#post_52f5935d6368723c2fe90200\r\nYou do realize I was making a joke about how unfortunately so many people worldwide think every nation has to follow their laws. . A primary example of this is when it comes to porn and how anti-porn people go, \"It's illegal/immoral here so you have to take it down\".\r\n\r\nYeah well the countries in which it's projected for the new internet users are going to come from have anti-porn laws, anti-sodomy laws, anti-blasphemy laws and all sorts of laws.\r\n\r\nImagine how fun it's going to be when angry people on the internet are telling you \"That blasphemy is illegal in my country so take it down\" are going to be on the internet.\r\n\r\nA prime example of a current example of this is the russian olympics, hold on I'm just using it as a example so let's avoid going further, russia has anti-gay laws to where you're not allowed to post glbt \"propaganda\", but other countries servers are in other countries so they can't do shit to stop people on the internet from saying things they don't like.\r\n\r\nIt's going to be fun in a, \"Well time to tear their ass a new one\" sense in that you know all those morally fucked up countries that we all like to make fun of?  Yeah imagine their populace having access to the internet and we having free reign to tear them apart.\r\n\r\n\r\nIn other words six years from now hate how uganda criminalizes being gay and punishes them with death?  Well congratulations they're going to have fresh access to the internet in which they haven't learned yet that their anti-freedom of speech laws don't mean shit on the internet and that no amount of threatening to report them to their local police will stop people from disagreeing with them.\r\n\r\nImagine six years from now when new pakistan internet users are threatening to call the cops on you for saying anything against islam.\r\n\r\n\r\nTl:dr; A trolls wetdream come true.","author":"38b55cdf63616403d7560600"},{"id":"52f5989b63687244593f0100","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/52f59623636872450a810000#post_52f59623636872450a810000\r\nSome people are just better off without internet access.\r\n\r\nThat's why it's essential for us to defend our rights against overarching Governments, Religion, organizations, corporations, and etc especially on home front. Defend our rights against anyone or anything that tries to take it away from us.","author":"4fde5cee945b700a970060fc"},{"id":"52f599426368724978d10100","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/52f5989b63687244593f0100#post_52f5989b63687244593f0100\r\nThink about how much fun the internet is going to have.  We're talking countries where people have never ever had to deal with anyone ever disagreeing with them cause where they are it's illegal to disagree.  Now imagine them for the first time in their life having to actually defend their views.\r\n\r\nThat's why I say give them internet access and prepare the popcorn waiting for the inevitable hilarity.","author":"38b55cdf63616403d7560600"},{"id":"52f59a80636872440aa00200","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/52f599426368724978d10100#post_52f599426368724978d10100\r\nImagine arguing with North Koreans.\r\nThe scary thing is, these countries are rising economic powers. While, we, the western world is decaying. That can't be good for our rights.\r\n","author":"4fde5cee945b700a970060fc"},{"id":"52f5a0876368724a38090100","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/52f59a80636872440aa00200#post_52f59a80636872440aa00200\r\nActually I remember something on this cause I had to write a political paper on it.  The short version is that developing into a first world country and access to the internet has a democratization effect.\r\n\r\nI'd have to search for it again, cause it was two years ago, but the more people have access to the internet and as their quality of life increases that has a progressive effect on people's viewpoints.  It's why countries like the usa and most developed countries are becoming more progressive cause as a populace have greater ability to access information that increases their ability to access information that directly contradicts their current viewpoints.  For older generations the effect is less, but for younger generations that are not yet set in their way this has a big impact on them.\r\n\r\nIt's why countries like china and such are slowly pulling out of constantly dicking freedom of speech and religion and such, cause as a country becomes more developed the more and more likely people are not going to put up with it.\r\n\r\nAnother example of this is Iran; the current prime minister is nothing like the previous one cause the younger generations have gotten tired of the shit going on are far more progressive than their parents.\r\n\r\nNorth Korea on the other hand almost had a civil war, which is why Un executed his uncle, if Un hadn't executed his uncle chances are we would be hearing about Syria 2.0 right about now.\r\n\r\n\r\nI'd have to find this again, but I remember a lot about it cause I read up on the subject for months.\r\n\r\nBasically countries as they modernize and become first world countries as well as gaining access to the internet start to see a progressive effect in their society.\r\n\r\n\r\nI really need to find this thing again, cause as a country becomes a first world country the effect compounds on itself and isn't just something slow and subtle like so many people think; societal drift just charges through your concrete wall like the kool-aid man going, \"surprise motherfucker!\".\r\n\r\n\r\n\r\n\r\nIf someone here is a political science major or something it's a really good way to get a A+, cause I titled it, \"the liberalization effect of modernization and the internet\" and even though my professor was conservative he went, \"Damn, guess you're right\".\r\n*edit\r\nYou would think finding a hundred eighty pages would be easier to find.","author":"38b55cdf63616403d7560600"},{"id":"52f5a4fe63687248aa6c0200","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/52f5a0876368724a38090100#post_52f5a0876368724a38090100\r\nAhh the good ole' Market Place of Ideas. Nothing kills bad ideas like good ones because on some level we all know the bad ideas are bullshit. This is at least partially why the adherants to really bad ideas tend to be super touchy and defensive, and also violently oppose the introduction of any idea that contradicts them.","author":"4f41ee04945b701c41002af7"},{"id":"52f5a9dc636872763c850000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/52f5a0876368724a38090100#post_52f5a0876368724a38090100\r\nso, in simpler words. Introducing wider internet access to these developing nations can be a good and a bad thing. Depending on who uses it, and how it's used. Some people seek freedom from oppression, others may seek to oppress others.\r\n\r\nThose peole who you speak of, who'd abuse the internet to spread hatred and misinformation, tend to be from the more privileged demographics of their countries. Why those at the bottom tend to seek freedom for better lives.","author":"4fde5cee945b700a970060fc"},{"id":"52f5c2bb636872742c030000","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/52f5a9dc636872763c850000#post_52f5a9dc636872763c850000\r\nPretty much.  Also I did finally find the paper.\r\n\r\nThe only problems in the long run is that countries that change too rapidly will probably have shit go down.  What I mean by that is we'll probably see countries start to go, \"well all I did was brutally rape and murder my kid for losing his morals cause of the internet; was that so wrong?\"  Unfortunately there's far too many countries that operate on morals like these.  They just call it a \"honor killing\" or to kill someone in the belief that killing a person is better than the person losing their honor.\r\n\r\nI would not be surprised if in the next couple of years we see a massive spike in honor killings cause of how much society is going to change in developing nations.  Unfortunately we're already seeing such a spike happen.\r\n\r\nTo far too many countries brutally killing your children is considered perfectly acceptable.\r\n\r\nImagine what will happen if said countries now have access to information that tells them, \"no that's not okay\" and the younger generations' morals change?  What I mean by that is take uganda; they have laws to imprison glbt, now imagine what's going to happen when younger generations have access to information that directly contradicts these laws morally and what how much their parents will not like that their kids' morals are changing in ways they don't like? . . Yeah. . shit's gonna hit the fan in a big way.","author":"38b55cdf63616403d7560600"},{"id":"52f5c56c6368722a26530000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/52f5c2bb636872742c030000#post_52f5c2bb636872742c030000\r\nThat is where the internet comes in handy. The internet is a powerful tool that can bring more awareness of the issue to  wider demographics around the world. Honor Killing may continue, but it is increasingly more difficult to do so behind the backs of the world. The more people condemn them, the more potential pressure would be place onto the government and people of those countries to change.","author":"4fde5cee945b700a970060fc"},{"id":"52f5c7166368722aa2d50000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/52f5c2bb636872742c030000#post_52f5c2bb636872742c030000\r\nShit that already happens in microcosm in countries where the Taliban hold sway. They go out of their way to destroy schools and attack people, particularly girls, who try to educate themselves.","author":"4f41ee04945b701c41002af7"},{"id":"52f61cfc6368722a06ab0000","topic_id":"5161dd617f123bd25900013d","body":"I never really understood the word \"sellout\". If I became an internet famous animator and I decided to go for a professional career, what would that make me(I am neither internet famous nor an animator).","author":"50d9a3aea4c72dc9b3000120"},{"id":"52f62553636872762e900300","topic_id":"5161dd617f123bd25900013d","body":"\"@NotYourAverageLurker\":/dis/the-time-wasting-thread/post/52f61cfc6368722a06ab0000#post_52f61cfc6368722a06ab0000\r\nThe idea of a sellout is someone who trades their integrity for money. That said the word is misused to apply to anyone who makes tradeoffs for financial success.","author":"4fe16df67f123b13e400003f"},{"id":"52f6adae63687259a3620200","topic_id":"5161dd617f123bd25900013d","body":"\"http://steamcommunity.com/sharedfiles/filedetails/?id=225929496\":http://steamcommunity.com/sharedfiles/filedetails/?id=225929496\r\n\r\nMe fucking gusta","author":"4fe4bf947f123b175b000001"},{"id":"52f6b367636872793b290000","topic_id":"5161dd617f123bd25900013d","body":"\"@AaronMk\":/dis/the-time-wasting-thread/post/52f6adae63687259a3620200#post_52f6adae63687259a3620200\r\nSniping's a good job, mate. It ain't as easy as people think it is though.","author":"513e68eda4c72d4e3b000164"},{"id":"52f6b96663687277d6800100","topic_id":"5161dd617f123bd25900013d","body":"You know I just realized something. . . Companies really fucking stupid when it comes to the internet.\r\n\r\nI don't mean that in just how they operate websites thinking it's traditional media and think that business tactics that working in the 1500's will somehow magically work in 2014; rather I mean that when it comes to online reviews, spying on people and such.  Think about it for a second, companies spend billions of dollars to try to squash any negative reviews and troll websites that post bad things about them.  Seriously think about that for a second, billions of dollars for large companies are being wasted to hire full time employees to create sock puppet accounts and troll sites like 4chan just cause someone said something negative about one of their products.  They're not even subtle about it either, cause sock puppet accounts on websites are really obvious.  You know how we occasionally get spam threads by someone going, \"try new bullcrapproduct.com\" someone is paying a individual right then to either post the thread or paying them to create a spam bot to create the thread.","author":"38b55cdf63616403d7560600"},{"id":"52f6ba2b63687243054b0000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/52f6b96663687277d6800100#post_52f6b96663687277d6800100\r\nI know, it's stupid. Sometimes, it's like these companies couldn't decide whether they like money or not.","author":"4fde5cee945b700a970060fc"},{"id":"52f6c36b63687203f6af0000","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/52f6ba2b63687243054b0000#post_52f6ba2b63687243054b0000\r\nEven if it's just a bot I genuinely feel sorry for the programmers who their bosses are telling them to do this.\r\n\r\n\"Hey boss, I just finished up fixing the problems customers were talking about.  What's this new project you want me to do?\"\r\n\"Yeah Carl\"\r\n\"My name's Mark\"\r\n\"Yeah so Carl them 4chan's been saying bad things about our products.  I want you to delete that.\"\r\n\"It's a website that we don't own.\"\r\n\"Well then I want you to make them stop saying bad things.\"\r\n\"It has hundreds of thousands of users and I'm only one person\"\r\n\"Well then make a whatchamathingy to post positive things on their thingamajingy\"\r\n\"You mean create a bot to post positive reviews?\"\r\n\"Don't speak smartsamathings to me, just do it\"\r\n\"[crying internally intensifies]\"","author":"38b55cdf63616403d7560600"},{"id":"52f6c48a6368724a1c050000","topic_id":"5161dd617f123bd25900013d","body":"\"@Ore-O\":/dis/the-time-wasting-thread/post/52f6b367636872793b290000#post_52f6b367636872793b290000\r\n\r\nI am rather surprised that I am basically scoring two points an hour for sniper.\r\n\r\nAnd then there's my medic play-time. Which is no surprise.","author":"4fe4bf947f123b175b000001"},{"id":"52f6c7426368724c6a4c0000","topic_id":"5161dd617f123bd25900013d","body":"\"@AaronMk\":/dis/the-time-wasting-thread/post/52f6c48a6368724a1c050000#post_52f6c48a6368724a1c050000\r\nI blame Turtling Engineers and Bad Spies.","author":"513e68eda4c72d4e3b000164"},{"id":"52f6dd0b6368726c2cb10000","topic_id":"5161dd617f123bd25900013d","body":"\"@Ore-O\":/dis/the-time-wasting-thread/post/52f6c7426368724c6a4c0000#post_52f6c7426368724c6a4c0000\r\nI have to disagree on the spy part.  The spy has been hit with the nerf hammer so many times he's the weakest out of all them.","author":"38b55cdf63616403d7560600"},{"id":"52f6de2f6368725c8de90200","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/52f6b96663687277d6800100#post_52f6b96663687277d6800100\r\nSock puppets and spam bots are some of the best free entertainment I've seen on the web though.","author":"4f41ee04945b701c41002af7"},{"id":"52f6ee0b6368727c5e490000","topic_id":"5161dd617f123bd25900013d","body":"\"And then this happened today.\":http://cloud-4.steampowered.com/ugc/3298062012299962291/C2F02298A7B246C4FBAABF778BBD6D1DBA9BADA1/\r\n\r\nWe went to play CP_5Gorge, and on the second round the spawns broke and stayed closed for everyone. We did a vote to restart, which was denied.\r\n\r\nFortunately, it was fixed when someone RTV'd again and we switched maps.","author":"4fe4bf947f123b175b000001"}]}