{"topics":[{"id":"5369acfa6368721a451f0100","topic_id":"5161dd617f123bd25900013d","body":"\"@trashboat\":/dis/the-time-wasting-thread/post/5369ac4863687233e10b0000#post_5369ac4863687233e10b0000\r\n*HOLD IT!*\r\n(points finger)\r\nAs the defendant this is clearly a admission of guilt by the accused!","author":"38b55cdf63616403d7560600"},{"id":"5369ad866368724650360000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5369acfa6368721a451f0100#post_5369acfa6368721a451f0100\r\nGaogaigar isn't that obscure, Zambot is Tomino, (Gundam) And Layzner is Takahashi (VOTOMS)","author":"5062d6f17f123b3e16001184"},{"id":"5369ae0d6368724cf84e0000","topic_id":"5161dd617f123bd25900013d","body":"I wonder what would happen if you kept your child in a tiny room for years, with only water to drink and a bowl of food once a week, putting snakes in her room to scare and bite them, and you gave them drugs and alcohol from birth, and then, at the age of 13, you decided to release them? That could be a very interesting rehabilitation story.","author":"50b70eeb7f123b1a02000097"},{"id":"5369aedb6368723d98cc0000","topic_id":"5161dd617f123bd25900013d","body":"\"@trashboat\":/dis/the-time-wasting-thread/post/5369ad866368724650360000#post_5369ad866368724650360000\r\n(anime sweatdrop)\r\n(He's got me there; I need to think fast)\r\n*HOLD IT!*\r\nBut don't you on a regular basis post images of old retro 80's mecha anime in the talking with pictures thread on a regular basis?  Isn't that by proxy considered obscure?\r\n\r\n\"@Randomosaur\":/dis/the-time-wasting-thread/post/5369ae0d6368724cf84e0000#post_5369ae0d6368724cf84e0000\r\nFeral children.\r\n\r\nOn a side note I could never hate snakes; they're just so adorable!","author":"38b55cdf63616403d7560600"},{"id":"5369af106368724cda780000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5369aedb6368723d98cc0000#post_5369aedb6368723d98cc0000\r\n\"This is also interesting.\":http://www.reuters.com/investigates/adoption/#article/part1 ","author":"50b70eeb7f123b1a02000097"},{"id":"5369b0a363687278e1a60000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5369aedb6368723d98cc0000#post_5369aedb6368723d98cc0000\r\n\r\nAs long as i know they aint gonna bite or strangle my ass guess im ok with them.","author":"5154c5237f123bcd580002fc"},{"id":"5369b0ac636872037e5e0000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5369aedb6368723d98cc0000#post_5369aedb6368723d98cc0000\r\nIdeon is still Tomino, Diebuster is Gainax, Gundam X Is gundam, So is Turn A gundam, Getter robo isn't as Mainstream as Gaogaigar, But every Non entry level mecha fan is at least aware of it, Same with Mazinger, Giant robo is not obscure, Neither is Zeorymer (Thought It's slightly more so) Xabungle is Tomino, So is Daitarn","author":"5062d6f17f123b3e16001184"},{"id":"5369b3166368722d54af0000","topic_id":"5161dd617f123bd25900013d","body":"\"@twistedmetalero\":/dis/the-time-wasting-thread/post/5369b0a363687278e1a60000#post_5369b0a363687278e1a60000\r\n[bq=\"twistedmetalero\"]\"@uc9\":/dis/the-time-wasting-thread/post/5369aedb6368723d98cc0000#post_5369aedb6368723d98cc0000\r\n\r\nAs long as i know they aint gonna bite or strangle my ass guess im ok with them.[/bq]\r\n!http://i0.kym-cdn.com/photos/images/original/000/676/972/93a.png!\r\n!http://i0.kym-cdn.com/photos/images/original/000/635/595/5b7.jpg!\r\nSnakes are so cute!","author":"38b55cdf63616403d7560600"},{"id":"5369b35e6368723a277c0000","topic_id":"5161dd617f123bd25900013d","body":"Well today sucked. I went to go cook something and didn't realize one of those little plastic tabs that they use to keep plastics bags with potatoes and apples and such closed was stuck to the bottom of the pan. I lit the stove and I smelled and saw black smoke sure enough the plastic tab was on fire. Now there are all these little ashes from it all over EVERYTHING. It's like soot from a fireplace. I'm worried about how dangerous they are am have tried to clean everything well but I'm not sure if I cleaned enough.","author":"5010fa077f123b1e4f00104e"},{"id":"5369b3ef63687225867c0100","topic_id":"5161dd617f123bd25900013d","body":"\"@someguy111\":/dis/the-time-wasting-thread/post/5369b35e6368723a277c0000#post_5369b35e6368723a277c0000\r\nThe main problem from that is inhalation.  Don't breath that in for obvious reasons.","author":"38b55cdf63616403d7560600"},{"id":"5369b4ae6368725415a60000","topic_id":"5161dd617f123bd25900013d","body":"I have a funny story to tell you guys.\r\n\r\nOne of my relatives visited the doctor for a checkup. When she went to the doctor, her doctor showed her something on the computer saying that (relative's name) died 2 days before at 92. She's in her mid-30s.","author":"50b70eeb7f123b1a02000097"},{"id":"5369b4cd6368726d6d0f0000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5369b3ef63687225867c0100#post_5369b3ef63687225867c0100\r\nYeah I opened the windows immediately to air it out. I didn't breathe much in, I'm just worried about the plastic ashes all over everything. They are about as light as air, much like dust, ad get easily blown around and float in the air and can land on just about anything. I don't want one to land in my food and me unknowingly ingest it or get some ash on my skin that just landed there, I'm pretty sure that's not good to get on skin/ Also since it's basically dust I worry about inhaling it.","author":"5010fa077f123b1e4f00104e"},{"id":"5369b5d56368726e147a0000","topic_id":"5161dd617f123bd25900013d","body":"I just read a story on Reddit. May or may not be true, but if it is, it's hilarious.\r\n\r\n\"Doctor told me I was pregnant. I'm a male 21 and I blatantly had appendicitis. Appendix burst rushed into hospital and unfortunately miscarried my appendix.\"\r\n","author":"50b70eeb7f123b1a02000097"},{"id":"5369b6c663687211423d0000","topic_id":"5161dd617f123bd25900013d","body":"Oh OP, do I have a story for you, your tastes will be satisfied.\r\n\r\nWhen I was just exiting High School me and my twin weren't the best of friends. At the start of High School we did everything together. But towards the end... we started fading, and in 12th grade we were both fighting over a girl and who got to get her and ultimately at the end of 12th grade he got the girl and I wasn't too happy about that.\r\n\r\nI had been friends with this girl since 3rd grade, when she first moved to our area, and he hadn't taken a liking to her since that year. Basically, you could say I was friendzoned.\r\n\r\nMe and my brother looked incredibly alike (We're twins, obviously) and more than once she mistook me for him.\r\n\r\nThey were together that entire summer. It was absolute torture to see my brother and the girl I'd liked since 3rd grade together, kissing, hugging, cuddling. I even heard them having sex once. I'd never been so depressed and jealous in my life. That entire summer was one giant heartbreak.\r\n\r\nNear the end of the summer, mid August or so, I decided that I'd get back at my brother. I decided that one day when he was out doing something I would dress like him, talk like him, and invite the girl over for a little \"fun\". She'd never know the difference.\r\n\r\nThe girl wasn't that attractive to be completely honest... but her personality more than made up for it. To be honest, I don't even know why she wanted to be with him, her interests aligned with mine much more than they did with his, but that's aside the point.\r\n\r\nThe day finally came when my brother went to hang out with his friends and I quickly invited the girl over. The phone conversation was easy enough, I convinced her to come over without any problem. I was nervous she'd notice something was off when she got to the front door though.\r\n\r\nShe came over, I tried to act as natural as I could and open the door. She said hello and gave me a kiss. I'd been waiting for that kiss for 9 years now and it made me feel ecstatic. She picked up on my extra happiness I guess and said jokingly, \"Wow, why are you in such a good mood today?\" I invited her to go up to his room and as planned, we started making out and stripping each other's clothes off.\r\n\r\nThen she stopped suddenly and said, \"You don't kiss like Michael (my brother), It's you Thehealeroftri, isn't it?\" I'm a terrible actor, I couldn't act this one off, I tried to let out a laugh and say something like, \"Haha, yeah right, it's me!\" and try to go back to whatever we were doing. Instead it came out like, \"AHAHA, Yeahhhhhhh hahaaaaaaaa.\" and not nearly as smooth as I had planned. I didn't really know what I said completely because I could feel myself start to shake and sweat.\r\n\r\nI was expecting her to be disgusted, tell my brother, and then we'd all hate each other for the rest of our lives. Instead she just told me, \"I know you've liked me for some time now. I would be with you but I think your brother is more physically attractive than you.\" Instead of trying to explain how we're twins, I just stuttered a bit and nodded. She continued, \"But I won't tell your brother if we get together this once.\"\r\n\r\nAnd with that once sentence all of my fear was gone. I was back in the game with her. We ended up having sex, it wasn't the best, but it felt great. Even more so because I'd wanted to be with her for quite some time now. We layed there for a bit. Eventually I looked up at the clock only to realize 5 hours had passed, my brother would probably be home any second, I jumped out of bed and told her she needed to get going too but instead she layed there and told me to get back in the bed with her.\r\n\r\nI got back in and tried to explain to her that my brother would be home soon but instead she looked at me and said with a happy face, \"I need something from you first...\" Confused, I replied, \"What do you need?\" \"I need about tree fiddy.\" It was around this time I realized that this girl was about 8 stories tall and a crustacean from the paleozoic era. That damned Loch Ness Monster had gotten me again, \"Damnit Monstah, I ain't givin' you no tree fiddy!\" I yelled as she swam away into the distance.\r\nMy brother never did figure out what happened to his girlfriend, I never told him about it and he became a bit sad that she stopped seeing him, but hey, that's life.\r\n\r\ntl;dr: Acted as my twin brother, tried to get with his girlfriend.","author":"5062d6f17f123b3e16001184"},{"id":"5369bd596368721a5c360000","topic_id":"5161dd617f123bd25900013d","body":"\"@trashboat\":/dis/the-time-wasting-thread/post/5369b6c663687211423d0000#post_5369b6c663687211423d0000\r\nFun fact: Crustaceans are arthropods. Due to their breathing systems they cannot grow too large or they will suffocate.\r\n","author":"50b70eeb7f123b1a02000097"},{"id":"5369c08a63687256f3500000","topic_id":"5161dd617f123bd25900013d","body":"Wow, suddenly everything is quiet here and everyone move on to other threads lol ","author":"31bee2686368722a0df23600"},{"id":"5369c0ff63687256f38b0000","topic_id":"5161dd617f123bd25900013d","body":"\"@Gizoid101\":/dis/the-time-wasting-thread/post/5369c08a63687256f3500000#post_5369c08a63687256f3500000\r\nquiet you","author":"4fe16df67f123b13e400003f"},{"id":"5369c14d636872544d900000","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/5369c0ff63687256f38b0000#post_5369c0ff63687256f38b0000\r\n\r\nYou can't quiet me, you punny human.","author":"31bee2686368722a0df23600"},{"id":"5369c33d63687206a9760000","topic_id":"5161dd617f123bd25900013d","body":"You want to go to sleep, relax and function like a normal human being but NOOOOOOOOOO.\r\n\r\nread these like 40 pages, draw a map, prepare an exposition and find the ratio decidendi for tomorrow.\r\n\r\nI hate all particles in the world.\r\n\r\nI barely even read those pages and its for tomorrow.\r\n\r\n","author":"5154c5237f123bcd580002fc"},{"id":"5369c35b6368721505330000","topic_id":"5161dd617f123bd25900013d","body":"\"@Gizoid101\":/dis/the-time-wasting-thread/post/5369c14d636872544d900000#post_5369c14d636872544d900000\r\n>punny\r\nthe only one I made recently was how Russian women tend to be icier than average","author":"4fe16df67f123b13e400003f"},{"id":"5369c54863687234a6590000","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/5369c35b6368721505330000#post_5369c35b6368721505330000\r\n\r\nSpeaking of russians, I watched the news that Putin made a law about banning and prohibit all the bad words and insults in all media. Books, tv, movies, everywhere. Like he said: He declared war to the bad words. That law will be in use in june 1.\r\n","author":"31bee2686368722a0df23600"},{"id":"5369c5d4636872468f410000","topic_id":"5161dd617f123bd25900013d","body":"\"@Gizoid101\":/dis/the-time-wasting-thread/post/5369c54863687234a6590000#post_5369c54863687234a6590000\r\nThat's some fucking shitty as fuck bullshit.","author":"4f41ee04945b701c41002af7"},{"id":"5369cb1263687236f2310000","topic_id":"5161dd617f123bd25900013d","body":"I feel like the purpose of my dad is to be as annoying as possible until i feel like leaving him in a retirement house like abe simpson.\r\n\r\nI literally get stomacaches, so i go to the bathroom, and he wakes up and goes \"why are you awake, why do you take college like a joke, its always the same, its the computer isnt it\", yeah dad i only went to the bathroom solely to spite you, next time ill get a couple of seizures to start my rebelious phase","author":"5154c5237f123bcd580002fc"},{"id":"5369ccf76368726006220000","topic_id":"5161dd617f123bd25900013d","body":"\"@gasmaskangel\":/dis/the-time-wasting-thread/post/5369c5d4636872468f410000#post_5369c5d4636872468f410000\r\n\r\n\"@Gizoid101\":/dis/the-time-wasting-thread/post/5369c54863687234a6590000#post_5369c54863687234a6590000\r\nI can't bring myself to hate him","author":"4fe16df67f123b13e400003f"},{"id":"5369cd366368725d23670000","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/5369ccf76368726006220000#post_5369ccf76368726006220000\r\nHe's like a cartoon super villain, its hard to take him seriously.","author":"4f41ee04945b701c41002af7"}]}