{"topics":[{"id":"52f710ef636872715a890000","topic_id":"5161dd617f123bd25900013d","body":"This shit is insane. Warning, somewhat ideological but I doubt it matters.\r\nIt's too long and I simply skimmed so if anything in there is incendiary I'll simple remove the link but it's too sardonic to pass up\r\n\r\nhttp://radishmag.wordpress.com/2014/02/02/crazy-talk/\r\n","author":"4fe16df67f123b13e400003f"},{"id":"52f7154e63687220ce2c0100","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/52f710ef636872715a890000#post_52f710ef636872715a890000\r\n!http://i.imgur.com/S8Ny4.gif!\r\n","author":"5037a9f87f123b3532002e58"},{"id":"52f7ce976368726181710000","topic_id":"5161dd617f123bd25900013d","body":"God, I suck at running emulators. I've been trying to run Top Skater on a Model 2 emulator for a while, and have no idea what to do. All I can get out of it is that I need to find a directory for Top Skater...and I have no idea what that means or how to find it. I'm no good at this technology stuff. ","author":"5041b54f7f123b77af00a442"},{"id":"52f7cf646368725fe0be0000","topic_id":"5161dd617f123bd25900013d","body":"\"@And Brother I Hurt People\":/dis/the-time-wasting-thread/post/52f7ce976368726181710000#post_52f7ce976368726181710000\r\n\r\nWhich emulator do you have?","author":"4fdfbf92945b7075d50036e4"},{"id":"52f7d084636872651e2b0100","topic_id":"5161dd617f123bd25900013d","body":"\"@QuasarNova\":/dis/the-time-wasting-thread/post/52f7cf646368725fe0be0000#post_52f7cf646368725fe0be0000\r\n\r\nModel 2 Emu.","author":"5041b54f7f123b77af00a442"},{"id":"52f7d14d6368726508510100","topic_id":"5161dd617f123bd25900013d","body":"\"@And Brother I Hurt People\":/dis/the-time-wasting-thread/post/52f7d084636872651e2b0100#post_52f7d084636872651e2b0100\r\n\r\nOk. In my experience it's usually 1 of two options: Either the file of the game is corrputed and you need to download it from another source, or some files in the emulator are the ones missing and you may have to install it again.\r\n\r\nIt's usually one of those. And for what I could gather, Model2Emu is very propense to fail.","author":"4fdfbf92945b7075d50036e4"},{"id":"52f7d1a463687261ad050100","topic_id":"5161dd617f123bd25900013d","body":"\"@QuasarNova\":/dis/the-time-wasting-thread/post/52f7d14d6368726508510100#post_52f7d14d6368726508510100\r\n\r\nReally? I heard a lot of positive stuff about Model2Emu, but hey, who knows. I'll just try downloading the game again, then. Thanks.","author":"5041b54f7f123b77af00a442"},{"id":"52f7d1d263687261817a0100","topic_id":"5161dd617f123bd25900013d","body":"\"@And Brother I Hurt People\":/dis/the-time-wasting-thread/post/52f7d1a463687261ad050100#post_52f7d1a463687261ad050100\r\n\r\nApparently it depends on the system specs (like pretty much every emulator).\r\n\r\nGlad I could help.","author":"4fdfbf92945b7075d50036e4"},{"id":"52f802906368725387080000","topic_id":"5161dd617f123bd25900013d","body":"Will handwraps get the same treatment as fedoras?","author":"50d9a3aea4c72dc9b3000120"},{"id":"52f8033d636872558f520000","topic_id":"5161dd617f123bd25900013d","body":"In which sense?","author":"4fdfbf92945b7075d50036e4"},{"id":"52f804ba6368725541910000","topic_id":"5161dd617f123bd25900013d","body":"Man, I wish Borderlands 2 was free for longer than this Sunday. :T\r\n\r\nLike, you know, for forever.","author":"5041b54f7f123b77af00a442"},{"id":"52f8050c636872592cd00000","topic_id":"5161dd617f123bd25900013d","body":"Get worn by pretentious try-hards to look badass when there's absolutely no other purpose for them to wear them.","author":"50d9a3aea4c72dc9b3000120"},{"id":"52f805c46368725417a80000","topic_id":"5161dd617f123bd25900013d","body":"\"@NotYourAverageLurker\":/dis/the-time-wasting-thread/post/52f8050c636872592cd00000#post_52f8050c636872592cd00000\r\n\r\nThen the same would need to apply towards trenchcoats, scarfs, waistcoats, etc. \r\n\r\nWhen it comes down to clothing I don't like to judge.\r\n","author":"4fdfbf92945b7075d50036e4"},{"id":"52f8082c63687254ca920100","topic_id":"5161dd617f123bd25900013d","body":"So, playing EU4 as France... Go to America and begun colonizing the shit out of it, as well as stomping on a few Native Americans to get a boost on my colonial presence in America before the rest of Europe.\r\n\r\nUK just started colonizing where I was and formed the Thirteen Colonies... Except they're now more than \"Two and a half colonies\" and now the \"One colony\" after I tore half of it away from them in a war not initially relevant to America.\r\n\r\nNew Flandre is best colony","author":"4fe4bf947f123b175b000001"},{"id":"52f92f236368725df6060100","topic_id":"5161dd617f123bd25900013d","body":"I just realized something when it comes to video games.  Video gamers are not as stupid as publishers like EA or console makers like microsoft would like to believe.\r\n\r\nWhat I mean by that is yeah Call of Duty is king, but over the last couple of years their sales has gone down a lot to the point that activision calls the trend, \"troubling\".  Another example is how microsoft tried to pull all that bull with the xboxone and as a result it's floundering to the point that they're already talking about a price cut to try and boost it's sales.\r\n\r\nOther consoles on the other hand that actually care about their products have been around for fucking ages, aka how nintendo survived several market crashes and is still doing well selling plenty of video games.\r\n\r\nAnother example is valve and half-life 1; half-life 1 was released in 1998 and still has plenty of people playing it.  Name one video game that EA published from the 90's that still has millions of players.\r\n\r\nI guess what I'm getting at is companies like EA and capcom are like a olympic sprinter entering a 20k marathon going, \"lol this is going to be easy\" trying to sprint the entire race.  Just look at what's happening to capcom, they're about to go bankrupt.","author":"38b55cdf63616403d7560600"},{"id":"52f93a396368721edada0100","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/52f92f236368725df6060100#post_52f92f236368725df6060100\r\nCapcom, no....\r\nThey made a large part of my childhood.","author":"4fde5cee945b700a970060fc"},{"id":"52f93a7c6368721c63730200","topic_id":"5161dd617f123bd25900013d","body":"Has anyone else here watched The Lego Movie?\r\n\r\n\"Business Business Business, Numbers (Is it working?) yes, YAAAAAAAY!\"","author":"5062d6f17f123b3e16001184"},{"id":"52f93d0a6368721a3db40300","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/52f93a396368721edada0100#post_52f93a396368721edada0100\r\nYeah, but they really ruined a lot of said games the last few years.\r\n\r\nI would not be surprised if the same thing happens to EA in a couple years cause what's been happening the last few years for AAA video game companies is they been making projections of their sales, miss it by a fair amount and then go, \"well we're still making a profit so here's the next quarter projections\".\r\n\r\nWhat I mean by that is it's less of a \"ermagod video games are dying\" and more of AAA companies like microsoft, EA, capcom and such are seeing a continuous slow decline in their sales rates.  I know it's less than the actual amount and that every year it varies, but imagine you have x product and the first year it's profit vs it's projected profit slipped by 5%, then imagine for next year you project it will be the same as your actual profit for this year and in reality it slips another 5%; now imagine it slipping by 5% the next year and the next year and the next year.  Eventually there's not going to be any money left in the bank.  That's what pretty much happened to capcom; they didn't just suddenly start dying of, instead they slowly slipped into where they are now.","author":"38b55cdf63616403d7560600"},{"id":"52f93fb863687221f3250000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/52f93d0a6368721a3db40300#post_52f93d0a6368721a3db40300\r\nI guess even the big players are feeling the pinch. Another VG industry crash may be a good thing. Give them time to re-invent themselves.\r\n\r\nI also find it hilarious when people said that the Television was immortal, never will be obsolete. If we bring those 20th century chumps to this time, they'd have a weird look on their faces. But on other hand, TV as we know it for most of the 20th century, may die out. The television set itself would only be re-purposed for 21st century use. So it won't die out completely ATM. ","author":"4fde5cee945b700a970060fc"},{"id":"52f94d7f6368721bd3f20100","topic_id":"5161dd617f123bd25900013d","body":"\"@trashboat\":/dis/the-time-wasting-thread/post/52f93a7c6368721c63730200#post_52f93a7c6368721c63730200\r\n\r\nYep, loved that movie XD","author":"4fdfbf92945b7075d50036e4"},{"id":"52f96271636872770d640300","topic_id":"5161dd617f123bd25900013d","body":"Speaking of video games you know what mod minecraft needs?  A non-euclidean geometry mod.  You could do it too just by having a one way invisible portal you can see through, but can only go through one side.\r\n\r\n\r\nBasically imagine this in minecraft:\r\n!http://i.imgur.com/DjTV19F.gif!\r\n\r\nIt would make puzzles and mazes in minecraft way fucking harder.  For mazes you could simply have a extremely small maze room that would take hours to solve, or for a extremely small puzzle it would take hours to solve.\r\n\r\n\r\nAlso imagine if someone made a updated version of gravitycraft(gravitycraft is pretty much deader than chris christie's presidential prospects) and making puzzles out of non-euclidean geometry and gravity.  Even the smallest of puzzle maps would be extremely difficult to solve.  The only real problem is that there would need to be redstone wiring so that redstone doesn't just pop off if gravity changes for just mobs.","author":"38b55cdf63616403d7560600"},{"id":"52f987f76368726157b10200","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/52f96271636872770d640300#post_52f96271636872770d640300\r\nYou might be interested in a game called Antechamber. Its the trippy sort of thing you're describing, and the art style is really nice.","author":"4f41ee04945b701c41002af7"},{"id":"52f98c496368726fc29d0000","topic_id":"5161dd617f123bd25900013d","body":"\"@gasmaskangel\":/dis/the-time-wasting-thread/post/52f987f76368726157b10200#post_52f987f76368726157b10200\r\nYeah I know what antechamber is; I was just saying that it would be pretty awesome of a mod for minecraft.","author":"38b55cdf63616403d7560600"},{"id":"52f9b72e63687249ea1c0200","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/52f59548636872443d030000#post_52f59548636872443d030000\r\nI'll see your isolationism and raise you one Dark Ages. Has China had anything like that?","author":"4fe16df67f123b13e400003f"},{"id":"52f9ba6c6368724af4d80200","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/52f9b72e63687249ea1c0200#post_52f9b72e63687249ea1c0200\r\nWhat?","author":"4fde5cee945b700a970060fc"}]}