{"topics":[{"id":"52f9d7c36368727228fb0000","topic_id":"5161dd617f123bd25900013d","body":"\"@gasmaskangel\":/dis/the-time-wasting-thread/post/52f9cf2e6368723359a90000#post_52f9cf2e6368723359a90000\r\nYeah I know; what I meant was the ones that investigations honestly do not know are a good read on a saturday night.  You know, the ones that sound like they came right out of the x-files. (cheesy 1990's music suddenly playing)\r\n\r\nThe fbi has done investigations into ufos and other stuff; only a hand full every year actually don't have explanations to them.  Those are the best reads, cause they make you paranoid as fuck if you're reading it at night without the lights on.","author":"38b55cdf63616403d7560600"},{"id":"52f9d97363687271b15f0100","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/52f9d7c36368727228fb0000#post_52f9d7c36368727228fb0000\r\nWait... if the lights aren't on then how would I read? [spoiler]Just giving you a hard time.[/spoiler]\r\n\r\nThose ones are fun in the same way that campfire ghost stories are fun.","author":"4f41ee04945b701c41002af7"},{"id":"52f9da686368727182750200","topic_id":"5161dd617f123bd25900013d","body":"\"@gasmaskangel\":/dis/the-time-wasting-thread/post/52f9d97363687271b15f0100#post_52f9d97363687271b15f0100\r\nYou know what's fun at campfires?  Telling scp to people.","author":"38b55cdf63616403d7560600"},{"id":"52f9db55636872728f580200","topic_id":"5161dd617f123bd25900013d","body":"Some Lovecraft stories have that creepypasta feel to them (his writing style is more or less the basis of how most Creepypastas are written). Def read some of those if interested.","author":"4fde4484945b700aa0002cca"},{"id":"52f9dd0c63687272d7470300","topic_id":"5161dd617f123bd25900013d","body":"On a side note after a geneva convention a unanimous decision I was years ago banned from ever telling any campfire stories, scaring people or having any sort of halloween costumes.\r\n\r\nI don't scare anyone anymore, cause last time I scared someone I literally almost scared them to death.  If I was in charge of a haunted house for halloween they would need a ambulance just in case someone gets a heart attack.","author":"38b55cdf63616403d7560600"},{"id":"52fa9e186368723048c10000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/52f9dd0c63687272d7470300#post_52f9dd0c63687272d7470300\r\nYou should write stories then","author":"4fe16df67f123b13e400003f"},{"id":"52fb047a63687263fd0b0000","topic_id":"5161dd617f123bd25900013d","body":"\"Pictured: the glory of EU4\":http://steamcommunity.com/sharedfiles/filedetails/?id=227134069\r\n\r\nI have succesfully burned the British from the American east coast and have started colonization of Madagascar two-centuries early.\r\n\r\nAs well, India is semi-united in a single mega-state with fairly decent military tech (compared to my expectations) and the Ottomans have a east-heavy empire that scares me.\r\n\r\nMing are also rekt and the Manchus no longer exist. All the while Japan goes full-on Japanese Empire two-hundred years early.","author":"4fe4bf947f123b175b000001"},{"id":"52fb11866368721914a50000","topic_id":"5161dd617f123bd25900013d","body":"\"@AaronMk\":/dis/the-time-wasting-thread/post/52fb047a63687263fd0b0000#post_52fb047a63687263fd0b0000\r\n>Ottomans\r\n>dangerous\r\nHAH!","author":"4fe16df67f123b13e400003f"},{"id":"52fb12e76368722ee80a0100","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/52fb11866368721914a50000#post_52fb11866368721914a50000\r\n\r\nThe fucked up the Austrians twice, which is something I have a hard time doing, even as the top-spot nation.","author":"4fe4bf947f123b175b000001"},{"id":"52fb13d26368727946120000","topic_id":"5161dd617f123bd25900013d","body":"I'm learning Japanese, I haven't noticed just how Far I've gotten until just now (I'm nowhere near Fluent, But still, I know a lot more than I did before I started Rosetta stone)","author":"5062d6f17f123b3e16001184"},{"id":"52fb16526368722f57c20200","topic_id":"5161dd617f123bd25900013d","body":"\"@AaronMk\":/dis/the-time-wasting-thread/post/52fb12e76368722ee80a0100#post_52fb12e76368722ee80a0100\r\n>Austrians\r\n>being relevant \r\nkek","author":"4fe16df67f123b13e400003f"},{"id":"52fb1edc6368720e2d7c0200","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/52fb16526368722f57c20200#post_52fb16526368722f57c20200\r\n\r\nThey're incredibly relevant when they run Antwerp for the greater part of the game and manage to run ass-rape armies all throughout the Holy Roman Empire. Or can recruit more mercenaries than I can afford to muster regulars as France.","author":"4fe4bf947f123b175b000001"},{"id":"52fb2019636872562df70100","topic_id":"5161dd617f123bd25900013d","body":"\"@AaronMk\":/dis/the-time-wasting-thread/post/52fb1edc6368720e2d7c0200#post_52fb1edc6368720e2d7c0200\r\n>France\r\n>not a dirty country of peasants\r\ntop bur","author":"4fe16df67f123b13e400003f"},{"id":"52fb207963687228a8970200","topic_id":"5161dd617f123bd25900013d","body":"o u","author":"4fe4bf947f123b175b000001"},{"id":"52fb21b26368726ef27c0000","topic_id":"5161dd617f123bd25900013d","body":"Some good news in the news for the usa:\r\nEric Holder is expanding gblt rights to the furthest extend of the law on the national level.  What I mean by this is short version he told all the states that ban gay marriage to metaphorically shove it where the sun don't shine cause even if a state bans gay marriage it will still be recognized on the national level and even if your state bans gay marriage you will still be nationally recognized as married regardless.\r\n\r\nEric holder vs anti-gay rights movement\r\nMORTAL KOMBAT!\r\nFLAWLESS VICTORY!\r\n*FINISH HIM!*\r\n!http://i3.kym-cdn.com/photos/images/original/000/696/440/43f.gif!\r\n\"Toasty!\"\r\nEric wins!","author":"38b55cdf63616403d7560600"},{"id":"52fbac6f6368722741020100","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/52fb21b26368726ef27c0000#post_52fb21b26368726ef27c0000\r\nI have to call up some conservative acquaintances of mine to make smug preening noise at them now.","author":"4f41ee04945b701c41002af7"},{"id":"52fbfa6263687212fa800000","topic_id":"5161dd617f123bd25900013d","body":"Why is it that pro-immigration open borders types always argue as if you're in favor of 0 immigration.\r\nI run in tough political circles where they won't even look at you if you believe in positive rights, but nobody believes in \"no immigrants allowed .\"","author":"4fe16df67f123b13e400003f"},{"id":"52fc11356368723d9c8b0100","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/52fbfa6263687212fa800000#post_52fbfa6263687212fa800000\r\nCause there's too many fucking idiots running around with racist signs and calling everyone that's a immigrants things like, \"n****r\", \"w******k\", \"r*****d\" and other shit.\r\n\r\nI don't know what country you're from, but yeah considering how many times in texas I used to see tea party members going around saying, \"I'm not racist, but we need to throw <massively offensive racial slur> back out of the country\" or what's worse is when they go, \"I'm not racist, but we need to send n*****rs back to africa\".\r\n\r\n\r\nPersonally I'm on the fence when it comes to immigration, if it's a large country with a good economy then yeah having lots of immigrants is fine, but I can understand why switzerland is limiting immigration.  It doesn't have anything to do with racism; their economy just can't handle anymore immigrants right now.  Countries like the usa the number of immigrants we have is a drop in the bucket though and if every immigrant was thrown out of the country that would completely fuck up the economy again.  Countries like the usa immigration is good right now, but I understand why people in the EU want to limit immigration.\r\n\r\nThe problem is too many assholes are running around with racist signs and turning what was originally something that could have been handled calmly and peacefully into a hot button issue.  In other words people need to duct tape racists mouths shut and maybe then countries could actually solve immigration problems rationally in a way that pleases everyone.","author":"38b55cdf63616403d7560600"},{"id":"52fc12b66368721427ff0000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/52fc11356368723d9c8b0100#post_52fc11356368723d9c8b0100\r\nI'm more concerned with preserving national character and identity than economics, which is why I'm opposed to mass immigration in Europe. Since those are native European countries with low birthrates, they are quite susceptible to losing their national character.\r\n\r\nThis does get me branded as racist because it acknowledges that one of the symptoms of being a native European is being 'white' among other things.\r\n\r\nTo which I must reply that Sikhs and Christian Arabs are both groups which are not white but pose no threat due to their responsible habits and being relatively small groups. So I can't be all that 'racist.'\r\n\r\nThen the person I'm arguing with has to do what I call \"making shit up\" so they can continue to call me racist, in order to shame my opinions and preserve their self righteous attitude.","author":"4fe16df67f123b13e400003f"},{"id":"52fc142a63687279413a0000","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/52fc12b66368721427ff0000#post_52fc12b66368721427ff0000\r\nWhat's ironic when you think about it is that here in the usa we have no national character cause we're literally a nation of immigrants.  Most of our population are from german descent or irish descent and people of african descent or hispanic descent are on the rise.  We have no clear cultural roots and yet we have people who honestly don't realize that the only true americans are native americans.  That would be like someone from europe moving to asia and then claiming they're a native asian saying that their family originates from asia.","author":"38b55cdf63616403d7560600"},{"id":"52fc16266368726abe570200","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/52fc142a63687279413a0000#post_52fc142a63687279413a0000\r\nwell, I meant to say I mostly agree with you.\r\nI'm not too concerned with America's national character even if I do believe in an enforced border (coupled with reform for the immigration and naturalization process in a spirited attempt to be fair).\r\n\r\nBut Europe is another story. I would be just as opposed to China accepting massive numbers of Non-Chinese immigrants.","author":"4fe16df67f123b13e400003f"},{"id":"52fc17236368725dda110000","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/52fc16266368726abe570200#post_52fc16266368726abe570200\r\nWhy?  What's wrong with being of different cultural origins?\r\n\r\nI'm part puerto rican, part german and part I think part portugal.  Is there something wrong with me for having different origins?  Is there something wrong with people of different cultural origins?","author":"38b55cdf63616403d7560600"},{"id":"52fc17f063687247f5660000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/52fc17236368725dda110000#post_52fc17236368725dda110000\r\nNot necessarily. \r\nThe concern with mass immigration into Europe are 1) too many people coming in 2) they're having too many kids and will replace the natives as the majority and 3) they have their own culture that they prefer to European culture.\r\n\r\nSo the end result is Europeans and European culture being replaced within their own countries with nowhere else for it to go.\r\nKind of a big fuck you when Western Civilization created the modern world.\r\n\r\nAs for America, I don't really care. My enforced border is simply to keep out the bad elements and the reformed immigration process is to help the good elements find a way in.","author":"4fe16df67f123b13e400003f"},{"id":"52fc1859636872528f240200","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/52fc17f063687247f5660000#post_52fc17f063687247f5660000\r\n\r\n\"not necessarily.\"\r\n\r\nlol. You're one of a kind. Actually, unfortunately, you're not.","author":null},{"id":"52fc19356368720e084e0000","topic_id":"5161dd617f123bd25900013d","body":"\"@Background Pony\":/dis/the-time-wasting-thread/post/52fc1859636872528f240200#post_52fc1859636872528f240200\r\nexplain? Are you going to castigate me for racism despite I've never actually said anything expressing disdain for particular groups?","author":"4fe16df67f123b13e400003f"}]}