{"topics":[{"id":"5487fdb863687256a26d0400","topic_id":"5161dd617f123bd25900013d","body":"I really wished I could draw better.\r\nI've been practising for a while now and I can't seem to get the proportions and perspective right.\r\nSome body parts just look to big or too small, plus hair is hard to draw.\r\n\r\nI need to practice more.","author":"4fe1b9f47f123b13df002976"},{"id":"5487ff0863687209a9b00200","topic_id":"5161dd617f123bd25900013d","body":"\"@HJSDGCE\":/dis/the-time-wasting-thread/post/5487fdb863687256a26d0400#post_5487fdb863687256a26d0400\r\nI can only draw somewhat decently when i look at the thing i'm drawing.\r\n\r\nIf i try to draw something without looking at the source material it usually doesn't turn out so great.","author":"5307a92d6368722c6c0d0100"},{"id":"5487ff886368725f136b0000","topic_id":"5161dd617f123bd25900013d","body":"\"@Zak_Inc\":/dis/the-time-wasting-thread/post/5487ff0863687209a9b00200#post_5487ff0863687209a9b00200\r\nThe only time my drawings are actually good is when I'm either depressed or half-awake.","author":"4fe1b9f47f123b13df002976"},{"id":"548800666368720a39300600","topic_id":"5161dd617f123bd25900013d","body":"\"@HJSDGCE\":/dis/the-time-wasting-thread/post/5487ff886368725f136b0000#post_5487ff886368725f136b0000\r\nThe only thing i'm good at while i'm depressed or half awake is sleeping.","author":"5307a92d6368722c6c0d0100"},{"id":"548807b56368720595130500","topic_id":"5161dd617f123bd25900013d","body":"Hi","author":"4fdef063945b700a9d01604f"},{"id":"54880b6863687239ae600200","topic_id":"5161dd617f123bd25900013d","body":"\"@AppleJackFrost\":/dis/the-time-wasting-thread/post/548807b56368720595130500#post_548807b56368720595130500\r\n!http://www.gifbin.com/bin/102011/1319738930_homer_simpson_hides_in_hedge.gif!","author":"4fe1b9f47f123b13df002976"},{"id":"54880d3b6368723c4c220200","topic_id":"5161dd617f123bd25900013d","body":"Mornin'\r\n\r\n\"@Bryon\":/dis/the-time-wasting-thread/post/548792dc636872739ac00000#post_548792dc636872739ac00000\r\nTo answer your question: [spoiler]Yes.[/spoiler]\r\n\"@Too_Offensive\":/dis/the-time-wasting-thread/post/548793156368722476d30000#post_548793156368722476d30000\r\nNAW YE CANNE MAKE ME YA RAGIN GRAVY TUNNEL","author":"515ddf93a4c72d8a1f000d57"},{"id":"5488148b63687259a74e0400","topic_id":"5161dd617f123bd25900013d","body":"\"@ParagonCommander\":/dis/the-time-wasting-thread/post/54880d3b6368723c4c220200#post_54880d3b6368723c4c220200\r\nGravy tunnel is an amazing insult. \r\nAlso it may unfortunately be an accurate description of my digestive system. ","author":"500b587e7f123b1f230014a9"},{"id":"548814b06368724a4cad0100","topic_id":"5161dd617f123bd25900013d","body":"Did you guys hear that Piratebay got shut down?\r\nWell, it would bother me before but since a new video game store just opened, not so much anymore.","author":"4fe1b9f47f123b13df002976"},{"id":"548820966368723080cb0900","topic_id":"5161dd617f123bd25900013d","body":"\"@Too_Offensive\":/dis/the-time-wasting-thread/post/5488148b63687259a74e0400#post_5488148b63687259a74e0400\r\n\"See here for more\":http://youtu.be/wPbZGX_Hpnw?t=33s\r\n\r\nWhen an English guy gets involved, it gets _bizarre_.\r\nEnglish guy: \"There are two poofs on my team and me, let's go!\"\r\nScottish guy: \"Aye, yer dad and yer brother?\"","author":"515ddf93a4c72d8a1f000d57"},{"id":"548829d76368722161950000","topic_id":"5161dd617f123bd25900013d","body":"\"@ParagonCommander\":/dis/the-time-wasting-thread/post/548820966368723080cb0900#post_548820966368723080cb0900\r\n\"Aye ye fockin Ethiopian phonebox\"\r\n\r\nYou live in a land of magic my friend","author":"500b587e7f123b1f230014a9"},{"id":"54882ad963687221615d0100","topic_id":"5161dd617f123bd25900013d","body":"Their national beast is the unicorn. What did you expect?\r\n\r\nAlso, read this.\r\n\r\nA long, long time ago, there was a rich land called Ibalong. The hero Baltog, who came from Botavora of the brave clan of Lipod, came to this land when many monsters were still roaming in its very dark forests. He decideed to stay and was the first to cultivate its field and to plant them with gabi.\r\nThen one night, a monstrous, wild boar known as Tandayag saw these field and destroyed the crops. Upon knowing this, Baltog decided to look for this boar with all his courage and patience. At last, as soon as he saw it, he fearlessly wrestled with it, with all his might. Baltog was unafraied. He was strong and brave. Though the Tandayag had very long fangs, he was able to pin down the monstrous, wild boar and break apart its very big jawbones. With this, Tandayag fell and died.\r\nAfter this fight, Baltog went to his house in Tondol, carrying the Tandayag's broken jawbones. Then, he hung it on a talisay tree in front of his house. Upon learning of the victory of their Chief Baltog, the people prepared a feast and celebrated. The very big jawbones of the dead boar became an attraction for everyone. Thus, came the tribes of Panikwason and Asog to marvel at it.\r\nThe second hero who came to the land of Ibalong was Handyong. Together with his men, he had to fight thousands of battles, and face many dangers to defeat the monsters. As warriors, they first fought the one-eyed monster with three necks in the land of Ponong. For ten months, they fought without rest. And they never stopped fighting until all these monsters were killed.\r\nHandyong and his men made their next attack against the giant flying sharks called Triburon which had hardy flesh and sawlike teeth that could crush rocks. They continued fighting until the defeat of the last Triburon.\r\nThey tamed the wild carabaos. They even drove away the giant and very fierce Sarimao which had very sharp fingernails. And using their spears and arrows, they killed all the crocodiles which were as big as boats. With all these killings, the rivers and swamps of Ibalong turned red with blood. It was at this time that the savage monkeys became frightened and hid themselves.\r\nAmong the enemies of Handyong and his men, the serpent Oryol was the hardest to kill. Having a beautiful voice, Oryol could change its image to deceive its enemies. To capture it, Handyong tried different ways. But Oryol escaped every one of it and disappeared.\r\nSo, alone and unafraid, Handyong decided to look for Oryol in the heart of the forest. He followed the beautiful voice and was almost enchanted by it in his pursiut. Days and nights passed until Oryol came to admire Handyong's bravery and gallantry. Then, the serpent helped the hero to conquer the monsters, thus restoring peace to the entire Ibalong.\r\nIn one of the areas of Ibalong called Ligmanan, Handyong built a town. Under his leadership and his laws, slaves and masters were treated equally. The people planted rice and because of their high regard of him, they named this rice after him. He built the first boat to ride the waves of Ibalong's seas. Through his good example, his people became inspired and came up with their own inventions. There was Kimantong who made the plow, harrow, and other farming tools; Hablom who invented the first loom for weaving abaca clothes; Dinahong, an Agta, who created the stove, cooking pot, earthen jar, and other kitchen utensils; and Sural who brilliantly thought of the syllabary and started to write on a marble rock. This was a golden period in Ibalong.\r\nThen suddenly, there came a big flood caused by Unos, with terrifying earthquakes. The volcanoes of Hantik, Kulasi and Isarog erupted. Rivers changed their direction and the sea waves rolled high. Destruction was everywhere. Soon, the earth parted, mountains sank, a lake was formed, and many towns in Ibalong were ruined.\r\nThen, appeared the giant Rabot, half-man and half-beast, with awesome and terrifying powers.\r\nPeople were asking who will fight against Rabot. So, Bantong, the third hero was called. He was a good friend of Handyong. He was ordered to kill the new monster in Ibalong. To do this, he took with him a thousand warriors to attack Rabot's den. But using his wisdom against Rabot, he did not attack the giant right away. He first observed Rabot's ways. Looking around the giant's den, he discovered that there were many rocks surrounding it, and these were the people who were turned into rocks by Rabot.\r\nBantong also learned that Rabot loved to sleep during the day and stayed awake at night. So, he waited. When Rabot was already sleeping very soundly, Bantong came hear him. He cut the giant into two with his very sharp bolo and without any struggle, Rabot died, So, Ibalong was at peace once more.","author":"52f0834d63687261cba90300"},{"id":"54882d4463687206e5b60300","topic_id":"5161dd617f123bd25900013d","body":"I dunno what to post here, so I'm gotta post a kicking\r\n!http://static.fjcdn.com/large/pictures/e9/e3/e9e351_3421134.jpg!\r\noff a tower.","author":"5446fcfc6368723ec21a0000"},{"id":"54882e0563687253d4b60700","topic_id":"5161dd617f123bd25900013d","body":"\"@Albus Fahrenheits\":/dis/the-time-wasting-thread/post/54882ad963687221615d0100#post_54882ad963687221615d0100\r\n!http://i3.kym-cdn.com/photos/images/newsfeed/000/793/427/b19.gif!","author":"515ddf93a4c72d8a1f000d57"},{"id":"548833a46368724973c10500","topic_id":"5161dd617f123bd25900013d","body":"\"@Albus Fahrenheits\":/dis/the-time-wasting-thread/post/54882ad963687221615d0100#post_54882ad963687221615d0100\r\nAll I can say is that the names are funny.","author":"4fe1b9f47f123b13df002976"},{"id":"5488346f6368726935170700","topic_id":"5161dd617f123bd25900013d","body":"\"@HJSDGCE\":/dis/the-time-wasting-thread/post/548833a46368724973c10500#post_548833a46368724973c10500\r\nFilipino tribals come up with the some of the weirdest names.","author":"52f0834d63687261cba90300"},{"id":"548835a36368724539920600","topic_id":"5161dd617f123bd25900013d","body":"\"@Albus Fahrenheits\":/dis/the-time-wasting-thread/post/54882ad963687221615d0100#post_54882ad963687221615d0100\r\n>Rabot\r\n>half man, half beast\r\n>nothing mechanical\r\n\r\nSeems legit.","author":null},{"id":"548837016368721d1c1f0000","topic_id":"5161dd617f123bd25900013d","body":"\"@Background Pony #FBDC\":/dis/the-time-wasting-thread/post/548835a36368724539920600#post_548835a36368724539920600\r\nIt's the summary of The Epic of Ibalong. The shortest epic in the world. Also, now I can't unsee Rabot as cyborg Tirek.","author":"52f0834d63687261cba90300"},{"id":"54884b94636872342fb60700","topic_id":"5161dd617f123bd25900013d","body":"Oh god, I placed my laptop on my thighs and now I'm on fire.","author":"4fe1b9f47f123b13df002976"},{"id":"5488529163687233c6ce0900","topic_id":"5161dd617f123bd25900013d","body":"\"@Albus Fahrenheits\":/dis/the-time-wasting-thread/post/54882ad963687221615d0100#post_54882ad963687221615d0100\r\n!http://i2.kym-cdn.com/photos/images/original/000/173/659/3bb.gif!","author":"505696b47f123b37e800effa"},{"id":"548875026368723263180500","topic_id":"5161dd617f123bd25900013d","body":"Hi I'm here and I don't know what to say so have something \"Mystery Skulls related\":http://mysterybensmysteryblog.tumblr.com/post/104800978703/nkalmar-my-final-for-animation-ii-probably","author":"9ba2e84e636164642cc03200"},{"id":"54887a446368723094170000","topic_id":"5161dd617f123bd25900013d","body":"im on a death grips mood.\r\n\r\ndid you guys know death grips decided NOT to go to their  Lollapalooza show, and instead hung a banner with a suicide note from a fan?\r\n\r\n!http://images.rapgenius.com/26fd2cdc1f1dbc65e76026a5ceaa7395.608x342x1.jpg!","author":"5154c5237f123bcd580002fc"},{"id":"54887f226368724acac80100","topic_id":"5161dd617f123bd25900013d","body":"_Like eighty-three mermaids in Brooklyn Zoo_\r\n\r\nwow, a Jimi Hendrix AND OL' Dirty Bastard references in a row\r\n\r\ni love this song","author":"5154c5237f123bcd580002fc"},{"id":"54887f7e63687270036f0200","topic_id":"5161dd617f123bd25900013d","body":"\"@ParagonCommander\":/dis/the-time-wasting-thread/post/54880d3b6368723c4c220200#post_54880d3b6368723c4c220200\r\n\r\nSo it _IS_ a [spoiler]a girl[/spoiler]?? Just checkin'.","author":"5056c9e87f123b37f6012a34"},{"id":"5488839e6368726c69790000","topic_id":"5161dd617f123bd25900013d","body":"\"@Bryon\":/dis/the-time-wasting-thread/post/54887f7e63687270036f0200#post_54887f7e63687270036f0200\r\nYes.\r\n[spoiler]and no.[/spoiler]","author":"515ddf93a4c72d8a1f000d57"}]}