{"topics":[{"id":"52fc19a46368721694c40200","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/52fc19356368720e084e0000#post_52fc19356368720e084e0000\r\n\r\nOh no, you're totally not racist. Some of your best friends are black or immigrants I'm sure. Anyone who would accuse you of such a thing is ridiculous. I don't know why anyone would ever arrive at the notion.","author":null},{"id":"52fc1a9c6368720bf4890000","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/52fc17f063687247f5660000#post_52fc17f063687247f5660000\r\nStupid question time:\r\nIf you had your way then what would happen to people like me who are of mixed ethnic origins?  In other words lets a illegal immigrant has a child with a native european, what would you do with the child?  Where would you put us \"mutts\"?  Yes that is the racial slur against people of different ethnic origins and I have been called a mutt before.","author":"38b55cdf63616403d7560600"},{"id":"52fc1bbb6368720e29f70000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/52fc1a9c6368720bf4890000#post_52fc1a9c6368720bf4890000\r\nI'm not going to do anything to you. However the tide of new arrivals has to stop or the demographic shifts are going to be irreversible.\r\n\r\nThe fact is that the labor parties of Europe brought in these immigrants because the immigrants would vote for them. So they stole political power in the democratic system from their actual constituents for their own benefit.\r\n\r\n\"@Background Pony\":/dis/the-time-wasting-thread/post/52fc19a46368721694c40200#post_52fc19a46368721694c40200\r\n>hurr you're racist for being critical of politically motivated immigration\r\nwe're done here","author":"4fe16df67f123b13e400003f"},{"id":"52fc1c546368720c15270100","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/52fc1bbb6368720e29f70000#post_52fc1bbb6368720e29f70000\r\n\r\nOh no! We're done here? How else will I get to here about the purity of a race or culture being maintained in the face of the \"coloured tide?\"\r\n\r\nDo you at least have a newsletter I can subscribe to to keep informed? I checked out stormfront but they didn't have your articles yet.","author":null},{"id":"52fc1dac636872470d2a0100","topic_id":"5161dd617f123bd25900013d","body":"\"@Background Pony\":/dis/the-time-wasting-thread/post/52fc1c546368720c15270100#post_52fc1c546368720c15270100\r\nYou are obviously unaware of the present demographic shifts. You are unaware of the political nature of these changes. And I said nothing of 'racial purity' (as evidenced by my statements 'no one is against any immigrants' and complimenting the Sikhs and Christian Arabs)\r\nWhich is why you're engaging in fallacious strawmanning, buzzwords, guilt by association (hurr nazis thought this too according to my High School History class) among others.\r\n\r\n","author":"4fe16df67f123b13e400003f"},{"id":"52fc1f5463687246e8950100","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/52fc1dac636872470d2a0100#post_52fc1dac636872470d2a0100\r\n\r\nKeep talking man. I'm sure the more you type this the smarter you'll seem to people. You are definitely proving the assertions against you quite wrong. Why, by the time this is over you'll be given a triumphant position in the board of multiculturalism.\r\n\r\nAfter all, you mentioned a token example in passing and seem to come to the conclusion that immigration is more about numbers and demographics than it is about race or culture. So, bearing that in mind, it's quite obvious that the best way to preserve a culture is to maintain it's demographics. That will never, EVER be a racial distinctions. In fact, I'm sure those who are against immigration are practically color blind.","author":null},{"id":"52fc202c6368723660560000","topic_id":"5161dd617f123bd25900013d","body":"\"@Background Pony\":/dis/the-time-wasting-thread/post/52fc1f5463687246e8950100#post_52fc1f5463687246e8950100\r\nYou're using logical fallacies called Appealing to Consequences and Slippery Slope.\r\nThe Slippery Slope is that \"No more Mass Immigration will lead to racial discrimination, always\" and the Appeal to Consequences says that \"because this consequence could happen and is undesirable, then your statements are automatically wrong\" which is not an appropriate burden of proof.","author":"4fe16df67f123b13e400003f"},{"id":"52fc211a6368726b91000000","topic_id":"5161dd617f123bd25900013d","body":"For anyone else. Copied from a message sent to uc9.\r\n\r\nIt goes without saying that I do not advocate anything he said I did (as he said it without proof)and my concerns are not that \"brown people be inferior\" but simply that Europe’s native population is susceptible to replacement due to low birth rates and the political motivations behind mass immigration.\r\n\r\nAs I said, I hold no such opinions about America since it is not a native White country, in fact I would be willing to cede territory to Native Americans since we did relocate them.","author":"4fe16df67f123b13e400003f"},{"id":"52fc22486368726c5a6b0000","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/52fc202c6368723660560000#post_52fc202c6368723660560000\r\n\r\n_Appeal to Consequences says that \"because this consequence could happen and is undesirable, then your statements are automatically wrong\" which is not an appropriate burden of proof. Appeal to Consequences says that \"because this consequence could happen and is undesirable, then your statements are automatically wrong\" which is not an appropriate burden of proof._ \r\n\r\nSo, explain how immigration is bad without using such an appeal yourself.\r\n\r\nOr better yet, don't use cellophane rhetoric to construct your cause. It's pretty clear to anyone reading your words you are xenophobic at best and almost certainly racist. I do implore you to keep going though. Anyone who can read between the lines of your ever shrinking argument can easily infer where you stand.\r\n\r\n\"But, but- I'm not racist! I'm not like that at all. Umm- Slippery slope. I'm just saying all of the *other kinds* should keep out to retain the purity of our nation and identity. I mean, there's nothing hostile or racist about that at all. Cultures have to be preserved by keeping others out of it and drawing very clear, distinct cultural lines. That's totally not hatred guys. It is preservation.\"\r\n\r\nEveryone can see through you.","author":null},{"id":"52fc233c63687211eb2a0000","topic_id":"5161dd617f123bd25900013d","body":"I don't think there's anything wrong with trying to preserve one's culture. That's just my two scents.","author":"5037a9f87f123b3532002e58"},{"id":"52fc23486368720946560000","topic_id":"5161dd617f123bd25900013d","body":"\"@Background Pony\":/dis/the-time-wasting-thread/post/52fc22486368726c5a6b0000#post_52fc22486368726c5a6b0000\r\n>explain how immigration is bad\r\nI'm not anti-immigration. I'm anti mass european immigration because it was done simply for political reasons. Tony Blair's old speechwriter admitted this.\r\n\r\n>anyone who can read between the lines\r\nFunny how I said in any earlier post \"the person I'm arguing with has to resort to making shit up\"\r\n\r\n>\"But, but- I’m not racist! I’m not like that at all.\r\nTrying to characterize me as a blubbering twit\r\n\r\n>hurr racial purity\r\nnever said that.\r\nI've even said things that go against that.\r\n\r\n>Cultures have to be preserved by keeping others out of it and drawing very clear, distinct cultural lines.\r\nNo they don't. Again, never said that. I said to stop the mass immigration because too many are coming in with too high a birth rate.\r\n\r\nWhich will mean more non native kids, eventually making the natives a minority.\r\nAnd in a democratic system this will also mean the natives, as a group, will have less political power in their own countries.","author":"4fe16df67f123b13e400003f"},{"id":"52fc3b2063687227d30a0000","topic_id":"5161dd617f123bd25900013d","body":"As much as I support multiculturalism. I think there also must be a way to help preserve and assert native cultures and ideas in their own nations.","author":"4fde5cee945b700a970060fc"},{"id":"52fd37106368723b87d50100","topic_id":"5161dd617f123bd25900013d","body":"I just beat Akinator three times in a row. Either he's getting soft, or I've gone too deep.\r\n\r\nI used Dora, Jane Saw (both from Ayakashi Ghost Guild) and \"Laru Mine,\":http://utau.wikia.com/wiki/Laru_Mine the Shark-Dragon hybrid UTAU.","author":"5041b54f7f123b77af00a442"},{"id":"52fd37836368726477860100","topic_id":"5161dd617f123bd25900013d","body":"Thought about adding them in so that others can't cheat?","author":"513e68eda4c72d4e3b000164"},{"id":"52fd37a86368724fe3090000","topic_id":"5161dd617f123bd25900013d","body":"\"@Ore-O\":/dis/the-time-wasting-thread/post/52fd37836368726477860100#post_52fd37836368726477860100\r\n\r\nIf you're talking to me, I already added them to the database, yup.","author":"5041b54f7f123b77af00a442"},{"id":"52fd64d563687230a1320000","topic_id":"5161dd617f123bd25900013d","body":"\"I'm seriously considering joining this RP\":http://www.minecraftforum.net/topic/2382378-true-loves-broken/ so I can harpoon it in the side with some well-needed insanity.\r\n\r\nIf I can get my way, I'll be steering my character's arch down a very Condemned: Criminal Origins route, with some surreal comedy when the police make underground raids dressed as the Village People, and with YMCA playing in the background.","author":"4fe4bf947f123b175b000001"},{"id":"52fed1246368726f09a30200","topic_id":"5161dd617f123bd25900013d","body":"If you have ever looked at Dwarf Fortress and wondered why in god's name anyone would play it, this comic accurately explains it.\r\n!http://dwarffortresswiki.org/images/4/40/FunComic.png!","author":"4f41ee04945b701c41002af7"},{"id":"52feeadb63687275eb8f0100","topic_id":"5161dd617f123bd25900013d","body":"I know it's a slowpoke thing to say, but I just noticed it.\r\n\r\nApparently Valve, in their infinite wisdom allowed user-added tags to be put on games.\r\n\r\nMmmm I can't see anything going wrong with that at aaaaalll.","author":"500757fd7f123b75a90003b1"},{"id":"52feed546368727297980200","topic_id":"5161dd617f123bd25900013d","body":"!http://www.smashbros.com/images/character/little_mac/screen-10.jpg!\r\nWow, Little mac Sure is Short","author":"5062d6f17f123b3e16001184"},{"id":"52feefcf636872767abb0300","topic_id":"5161dd617f123bd25900013d","body":"\"@trashboat\":/dis/the-time-wasting-thread/post/52feed546368727297980200#post_52feed546368727297980200\r\nLittle Mac mugging the camera.","author":"505696b47f123b37e800effa"},{"id":"52fef35a63687224597a0000","topic_id":"5161dd617f123bd25900013d","body":"\"@Princess♠Molestia\":/dis/the-time-wasting-thread/post/52feeadb63687275eb8f0100#post_52feeadb63687275eb8f0100\r\nI just noticed that today as well.","author":"4f41ee04945b701c41002af7"},{"id":"52fef39163687226cbbe0000","topic_id":"5161dd617f123bd25900013d","body":"\"@gasmaskangel\":/dis/the-time-wasting-thread/post/52fef35a63687224597a0000#post_52fef35a63687224597a0000\r\n\r\nGotta love the tags.\r\n\r\nDmc is my favorite. \"TooEdgy4U\"","author":"500757fd7f123b75a90003b1"},{"id":"52fef476636872255ee10000","topic_id":"5161dd617f123bd25900013d","body":"\"@Princess♠Molestia\":/dis/the-time-wasting-thread/post/52fef39163687226cbbe0000#post_52fef39163687226cbbe0000\r\nI gotta look through the games in my library and find the ones with the best tags. Right now I'm looking at VTM Bloodlines and the only tags that stand out are \"DON'T OPEN IT!\" and \"erotic.\"\r\n\r\nOh and, \"Nanomachines, son\" on Metal Gear Rising.","author":"4f41ee04945b701c41002af7"},{"id":"52fef4d66368722334d00000","topic_id":"5161dd617f123bd25900013d","body":"I like the tags for Rome 2: Total War\r\n\r\n\"Rome Wasn't Patched in a Day\"","author":"4fe4bf947f123b175b000001"},{"id":"52fef64d63687221117a0100","topic_id":"5161dd617f123bd25900013d","body":"Has anyone here heard of Dr. Slump?","author":"5062d6f17f123b3e16001184"}]}