{"topics":[{"id":"54a63b936368725b13100600","topic_id":"5161dd617f123bd25900013d","body":"\"@Carcass Strife\":/dis/the-time-wasting-thread/post/54a6362e636872169b382100#post_54a6362e636872169b382100\r\nNight.\r\n\r\n\r\n\"@Albus Fahrenheits\":/dis/the-time-wasting-thread/post/54a63ac66368723714590100#post_54a63ac66368723714590100\r\nThat's sweet of her.\r\n\r\n\r\n\"@Albus Fahrenheits\":/dis/the-time-wasting-thread/post/54a6399b63687207fa3a0100#post_54a6399b63687207fa3a0100\r\nI like the game's plotline.","author":"4fde5cee945b700a970060fc"},{"id":"54a63bd36368725b133f0600","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/54a63b8363687242f9d71f00#post_54a63b8363687242f9d71f00\r\nIs your grandmother's home not a fun place to visit?","author":"500757fd7f123b75a90003b1"},{"id":"54a63c2a636872650ccb0400","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/54a63b8363687242f9d71f00#post_54a63b8363687242f9d71f00\r\nthis late at night?","author":"4fe3df367f123b517900066a"},{"id":"54a63c58636872324d3d0500","topic_id":"5161dd617f123bd25900013d","body":"\"@Princess♠Molestia\":/dis/the-time-wasting-thread/post/54a63bd36368725b133f0600#post_54a63bd36368725b133f0600\r\nIt's not that, I love my grandma.\r\nBut when your little sister shows up at your apartment and yells \"Go with me or I'm not leaving\" at midnight...\r\nI get a little grumpy.","author":"4fde4618945b700aa0002fff"},{"id":"54a63c816368721c37ea1200","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/54a63c58636872324d3d0500#post_54a63c58636872324d3d0500\r\nAaaaah.","author":"500757fd7f123b75a90003b1"},{"id":"54a63cb16368727e4a572900","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/54a63c58636872324d3d0500#post_54a63c58636872324d3d0500\r\nthat's annoying","author":"4fe3df367f123b517900066a"},{"id":"54a640516368723627560300","topic_id":"5161dd617f123bd25900013d","body":"\"@Albus Fahrenheits\":/dis/the-time-wasting-thread/post/54a6399b63687207fa3a0100#post_54a6399b63687207fa3a0100\r\nPersonally I'm not all that big on the genre, but I do have to give Metro a high mark; they're one of the few franchises that doesn't depict radiation like the force from star wars.  What I mean by this is that most of the time in post apocalyptic settings they treat radiation as though no matter how much shielding or such there is the radiation will leak through no matter what.  Metro may have given the surface survivors telepathy, but 99.9999% of the people on the surface died; chances are if there was a nuclear war that .0001% that doesn't die will have massive genetic mutations over time to allow them to adapt.  What I mean by this is that look at chernobyl, even though initially a lot of the animals and such died they've adapted and sure they have tons of tumors, but the animals that do survive are still thriving.  If nuclear war was to break out sure 2 billion people would die in the hit areas, but you would have hundreds of thousands of people still surviving in areas with so much radiation that you and I would be within seconds puking our guts out.  Those people that do survive would have tons of tumors and such, but would be able to live long enough to reproduce.\r\n\r\nSide note: I honestly hate how much of science fiction treats apocalypse because even a optimal scenario of a nuclear war would only kill 2 billion people.  The reason being is that you have to take into account air currents, population density, optimal locations and such.  If there was a nuclear war and instead of going \"take out the targets\" the reaction was \"nuke every populated city even if it's our own\" the highest death count would be 2 billion.  In order to reach that 2 billion mark the usa would have to start nuking it's own cities, which honestly I *highly* have to doubt.  If there was a nuclear war the majority of the usa would be fucked, china would be fucked, india would be fucked, pakistan would be fucked, the middle east(specifically the region around Israel) would be fucked, russia would be fucked, europe would be fucked, japan would be fucked, but if you lived in say australia/south america/middle americas/africa or such you would be fine.\r\n\r\nChances are there will eventually be a nuclear war, but it's not going to be no end of the world scenario; rather chances are it's going to be two rogue nations nuking each other and nobody else getting involved.  If NobodyGivesAFuckistan and NeverHeardOfTheFuckingPlaceistan nuke each other and neither of the countries have military backing from the world powers I *highly* have to doubt anyone that says other nations would get nuclear weapon involved.  My money is on if there ever is nukes used it'll probably be like ISIS or somebody like that somehow getting their hands on a nuke(yes I know the probability of this is low; I'm just using it for analogy sakes cause it's 1am here and I'm multitasking and focusing on something else) and nuking Baghdad or such; anyone that says the world is going to end cause of ISIS or other terrorist organizations I *highly highly* have to doubt.\r\n\r\nSide note: if you live in the usa and are wondering where would be a safe place to be during a nuclear war the answer is simple; Oregon’s coast, there's nothing important to nuke there and the air currents wouldn't bring in irradiated air.\r\n\r\nAlso if you're going \"well China, Japan, India, Russia, Europe and USA's populations exceed 2 billion\" I'm talking about all those country's economies would be completely destroyed for decades.  It would take at least fifty years for the world's economy to make a come back.  The USA's economy would be just completely destroyed.","author":"38b55cdf63616403d7560600"},{"id":"54a64143636872189d3b0800","topic_id":"5161dd617f123bd25900013d","body":"I'm just going to say that Gundam X is probably one of the better depictions of an Apocalypse IMO.","author":"5062d6f17f123b3e16001184"},{"id":"54a6414663687279c64b0600","topic_id":"5161dd617f123bd25900013d","body":"\"The Komondor!\":https://www.youtube.com/watch?v=NXFFdH-hTYs\r\n!http://retrieverman.files.wordpress.com/2011/07/komondor.jpg!\r\nSeriously, this thing looks like a mop.","author":"4fde5cee945b700a970060fc"},{"id":"54a6452763687270c7e60c00","topic_id":"5161dd617f123bd25900013d","body":"\"@trashboat\":/dis/the-time-wasting-thread/post/54a64143636872189d3b0800#post_54a64143636872189d3b0800\r\nI massively disagree here.\r\n\r\nYour best options for a apocalypse is:\r\n1)A virus or such that can be easily transmitted from animals to humans and only shows symptoms in humans that way the animals transmit it easily, but the problem with this scenario is that almost all militaries are trained for this.\r\n2)A asteroid.  The thing is though that the blocked sunlight would cause every country in the world to focus all their effort on synthesized food negating the famine.\r\n3)Supernova's charged particles impacting the earth.  This would just fuck the ecosystem.  Basically a near earth supernova would change the earth's atmosphere to such drastic levels and create a massive amount of nitrates; basically a ice age on crack cocaine.\r\n\r\nOther potential risks that while can't be described as a apocalypse are dangerous:\r\n1)A solar storm of I believe it would take a negative charge hitting the earth.  It wouldn't be \"ermagod the world's ending\" but a metric fuck ton of transformers being blown.  This wouldn't be world ending, rather replacing all the transformers in say the USA would take a lot of money and chances are you would be without electricity for anywhere from months to years.\r\n2)Space junk debris; this is economically a problem to the point NASA is working on a way of removing space junk.  Basically if there was a chain reaction for space junk imagine the economic effects of the majority of satellites being taken out or even if it's just a small portion.\r\n\r\nThe thing is though that the probability of a asteroid like the one that killed the dinosaurs hitting soon is incredibly small and we're mapping all the asteroids in our solar system; so unless one pops out of nowhere we're okay for now.\r\nViruses and such are way harder than science fiction depicts to kill all humans.\r\nA supernova hitting the earth which while it would be a problem isn't just people dropping dead so much as famine which could be fixed with synthesized food.\r\n\r\nEven if we're talking about a asteroid the size of the one that killed the dinosaurs hitting the ocean sure it would create tsunamis so large that it would go hundreds of miles inland, but we're talking about 2/3 of the human race wiped out and not 100%.","author":"38b55cdf63616403d7560600"},{"id":"54a6456663687210a3a71800","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/54a6414663687279c64b0600#post_54a6414663687279c64b0600\r\nLooks it's Hairty.","author":"505696b47f123b37e800effa"},{"id":"54a6475c6368726a9c092a00","topic_id":"5161dd617f123bd25900013d","body":"sleepy time\r\nnight all","author":"4fe3df367f123b517900066a"},{"id":"54a6479363687214e9ae1500","topic_id":"5161dd617f123bd25900013d","body":"\"@igotnopicks\":/dis/the-time-wasting-thread/post/54a6456663687210a3a71800#post_54a6456663687210a3a71800\r\n!https://img0.derpicdn.net/img/view/2012/7/15/45346__safe_rarity_animated_bridle+gossip_hairity.gif!\r\nMind Blown!\r\n\r\nHere is a Puli.\r\n!http://images.akc.org/breeds/action_images/puli.jpg!","author":"4fde5cee945b700a970060fc"},{"id":"54a64e786368723ab8610400","topic_id":"5161dd617f123bd25900013d","body":"Something: apparently Anonymous and Lizard Squad are fighting each other.\r\n\r\n200% meh.","author":"38b55cdf63616403d7560600"},{"id":"54a64eb0636872168a680000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/54a6452763687270c7e60c00#post_54a6452763687270c7e60c00\r\nI meant in how people would be like after one rather than how effective of an apocalypse it would be.","author":"5062d6f17f123b3e16001184"},{"id":"54a652f66368724c31bb4200","topic_id":"5161dd617f123bd25900013d","body":"Where's everyone suddenly?","author":"4fde5cee945b700a970060fc"},{"id":"54a65391636872324d450b00","topic_id":"5161dd617f123bd25900013d","body":"\"@trashboat\":/dis/the-time-wasting-thread/post/54a64eb0636872168a680000#post_54a64eb0636872168a680000\r\nNot really; basically the problem fundamentally with apocalypse fiction is the assumption that if societies and governments just randomly fall apart for no reason.  Most developed countries have contingencies for everything. . and I mean everything and yes there are contingencies for zombies even.  If say for instance there was a nuclear war the usa government would still exist; the number one priority of the government would be evacuating people to less irradiated cities and such, but the government would still exist.  Before you ask even if there was a nuclear war you would still have to pay your taxes.\r\n\r\nIf say there was a nuclear war then chances are afterwards you would be thrown onto a train with the trains over packed for days/weeks and once you were at a safe place everyone thrown off the train as soon as possible; all the dead bodies hurled off as soon as possible and then the train turn right back around and get more people.  You wouldn't be allowed to carry anything other than your clothes and chances are once you were kicked off the train they would rip that off also and spray you down with a hose.  Why?  Cause there wouldn't be any time to fuck around; there wouldn't be time to say goodbye to the dead, just chunk them off the side of train; no time for being kind to the survivors just rip off their clothes, hose them down and move onto the next person.  Chances are next to train tracks there would be tens of millions of people just chucked off the side of those who died due to radiation while being evacuated.\r\n\r\nWhy are such contingencies in place?  Cause if the world was ending there would be no time for humanly treating the dead or such.","author":"38b55cdf63616403d7560600"},{"id":"54a658b66368726eb2520500","topic_id":"5161dd617f123bd25900013d","body":"\"AAAAAAAAAAAAAAAHHHHHHHHHHHHHHHH AHAHAHAAAAAAAAAAAAAAAAAAAAAHHHHHHHHHHHHHHHHHH!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\":https://www.youtube.com/watch?v=jrsp80zRx6A","author":"4fde5cee945b700a970060fc"},{"id":"54a65b5563687219b4e60000","topic_id":"5161dd617f123bd25900013d","body":"There should be a video game protagonist who is based on \"Fu Hao\":http://en.wikipedia.org/wiki/Fu_Hao. A *female military general* from Shang Dynasty China.","author":"4fde5cee945b700a970060fc"},{"id":"54a65b5f6368726193280500","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/54a65391636872324d450b00#post_54a65391636872324d450b00\r\nPost-Apocalyptic Gundam is awesome. Your argument is invalid.","author":"5062d6f17f123b3e16001184"},{"id":"54a65c946368724c31c84300","topic_id":"5161dd617f123bd25900013d","body":"Bedtime.","author":"4fde5cee945b700a970060fc"},{"id":"54a65f086368727ab5930800","topic_id":"5161dd617f123bd25900013d","body":"!http://i.imgur.com/ILHO95b.jpg!","author":"5154c5237f123bcd580002fc"},{"id":"54a6618f6368724569a40300","topic_id":"5161dd617f123bd25900013d","body":"[spoiler]!https://scontent-a-pao.xx.fbcdn.net/hphotos-xfa1/v/t1.0-9/10304977_325583824261796_1147028529728333211_n.jpg?oh=ca8630faa8590f540f0d94ba711fd140&oe=552F44E6![/spoiler]","author":"5154c5237f123bcd580002fc"},{"id":"54a662716368726a9c432e00","topic_id":"5161dd617f123bd25900013d","body":"\"@Twisty\":/dis/the-time-wasting-thread/post/54a6618f6368724569a40300#post_54a6618f6368724569a40300\r\nThat's like the mythology of the Minotaur's birth.","author":"4fe1b9f47f123b13df002976"},{"id":"54a66366636872189d0b0f00","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/54a658b66368726eb2520500#post_54a658b66368726eb2520500\r\n[bq=\"SeraphimDawn\"]\"AAAAAAAAAAAAAAAHHHHHHHHHHHHHHHH AHAHAHAAAAAAAAAAAAAAAAAAAAAHHHHHHHHHHHHHHHHHH!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\":https://www.youtube.com/watch?v=jrsp80zRx6A\r\n[/bq]\r\n\"These two are way better\":https://www.youtube.com/watch?v=addvBQyiBtQ\r\n\"East new sound is amazing\":https://www.youtube.com/watch?v=Aqs20Zw-hoY\r\n\"Almost forgot this classic\":https://www.youtube.com/watch?v=pDWiBHtM0Y0","author":"38b55cdf63616403d7560600"}]}