{"topics":[{"id":"54a69c7f6368725ff83f0000","topic_id":"5161dd617f123bd25900013d","body":"\"@AppleJackFrost\":/dis/the-time-wasting-thread/post/54a69a146368724c31b05400#post_54a69a146368724c31b05400\r\nThat's a bad thing?","author":"38b55cdf63616403d7560600"},{"id":"54a69cab6368725e6adf2100","topic_id":"5161dd617f123bd25900013d","body":"\"@Carcass Strife\":/dis/the-time-wasting-thread/post/54a699e563687207fab71600#post_54a699e563687207fab71600\r\nI see I see!\r\n\r\n\r\n\"@AppleJackFrost\":/dis/the-time-wasting-thread/post/54a69a146368724c31b05400#post_54a69a146368724c31b05400\r\nYou must have a good friend. No one can run away from the Anime. ","author":"50c204917f123b31440000a5"},{"id":"54a69d836368721d8b7d1e00","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/54a69c7f6368725ff83f0000#post_54a69c7f6368725ff83f0000\r\n\r\n\"@Number1pegasus\":/dis/the-time-wasting-thread/post/54a69cab6368725e6adf2100#post_54a69cab6368725e6adf2100\r\nIt just means I try to look for episodes to download instead of looking at the screen until something happens.","author":"4fdef063945b700a9d01604f"},{"id":"54a69ec963687216c7c50500","topic_id":"5161dd617f123bd25900013d","body":"Well, I must sleep now. Tomorrow we're going to Embarcadero.","author":"52f0834d63687261cba90300"},{"id":"54a69ee063687269dfc82000","topic_id":"5161dd617f123bd25900013d","body":"\"@Number1pegasus\":/dis/the-time-wasting-thread/post/54a6986863687202d1693e00#post_54a6986863687202d1693e00\r\n[bq=\"Number1pegasus\"]\"@uc9\":/dis/the-time-wasting-thread/post/54a68def6368721fdd273b00#post_54a68def6368721fdd273b00\r\nI didn't know japan doesn't let men Crossdress? \r\n\r\nWhen the hell did that even happen? [/bq]\r\nShort version is that Japan's older generations are extremist socially conservative and as a result the country is socially conservative.  Chances are that's going to eventually change in a decade or so because of the younger generations becoming larger and larger portion of the adult population and the older generations getting on in age but until then-","author":"38b55cdf63616403d7560600"},{"id":"54a69efa636872199a881c00","topic_id":"5161dd617f123bd25900013d","body":"\"@Albus Fahrenheits\":/dis/the-time-wasting-thread/post/54a69ec963687216c7c50500#post_54a69ec963687216c7c50500\r\nKnight Albus","author":"4fdef063945b700a9d01604f"},{"id":"54a69fb76368725ff8550200","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/54a69ee063687269dfc82000#post_54a69ee063687269dfc82000\r\nThat's pretty fucked up.\r\n\r\nI literally had no idea that it was that dumb over there with that kind of stuff. \r\n\r\n\r\n\r\n\"@Albus Fahrenheits\":/dis/the-time-wasting-thread/post/54a69ec963687216c7c50500#post_54a69ec963687216c7c50500\r\nNight man. ","author":"50c204917f123b31440000a5"},{"id":"54a6a25763687242a1621600","topic_id":"5161dd617f123bd25900013d","body":"\"@Albus Fahrenheits\":/dis/the-time-wasting-thread/post/54a69ec963687216c7c50500#post_54a69ec963687216c7c50500\r\nNight.","author":"5446fcfc6368723ec21a0000"},{"id":"54a6a29d63687216c7fa0700","topic_id":"5161dd617f123bd25900013d","body":"\"When do you want your pizza?\"\r\n\"Asuna possible.\"\r\n-YAY BAD PUNS-","author":"5446fcfc6368723ec21a0000"},{"id":"54a6a2f26368725a94791200","topic_id":"5161dd617f123bd25900013d","body":"\"@Carcass Strife\":/dis/the-time-wasting-thread/post/54a6a29d63687216c7fa0700#post_54a6a29d63687216c7fa0700\r\n!http://cdn.myanimelist.net/images/characters/14/47264.jpg!","author":"4fdef063945b700a9d01604f"},{"id":"54a6a7cf6368721b72720000","topic_id":"5161dd617f123bd25900013d","body":"\"@AppleJackFrost\":/dis/the-time-wasting-thread/post/54a6a2f26368725a94791200#post_54a6a2f26368725a94791200\r\n....\r\n-Don't get it.-","author":"5446fcfc6368723ec21a0000"},{"id":"54a6cc1a6368721ce7520800","topic_id":"5161dd617f123bd25900013d","body":"So that shitstorm going on with Scalise in the USA congress has gone a interesting turn.  A KKK leader has now threaten to out other congressmen with supremacist ties.  Do it you pansy!","author":"38b55cdf63616403d7560600"},{"id":"54a6d07d6368721c13f01600","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/54a6cc1a6368721ce7520800#post_54a6cc1a6368721ce7520800\r\nWhot's all this?","author":"500b587e7f123b1f230014a9"},{"id":"54a6d19d6368725d4bbf0900","topic_id":"5161dd617f123bd25900013d","body":"\"@Too_Offensive\":/dis/the-time-wasting-thread/post/54a6d07d6368721c13f01600#post_54a6d07d6368721c13f01600\r\nTo make it as quick as humanly possible the Republican whip speaker(aka No. 3 on the chain of command) spoke at a white supremacist convention in 2002 and a year later said that he agrees with their beliefs and needless to say now that the news has found out they're having a field day.  The KKK responded by saying they're going to out other congressmen that have ties with supremacist groups if people continue to criticize them.  I hope they do out the other congressmen with ties to supremacist groups as retaliation cause that'll be fun to watch.","author":"38b55cdf63616403d7560600"},{"id":"54a6d3a76368721f7ba50500","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/54a6d19d6368725d4bbf0900#post_54a6d19d6368725d4bbf0900\r\nOoh!\r\n!media.giphy.com/media/RHiD0K65NxxLO/giphy.gif!","author":"500b587e7f123b1f230014a9"},{"id":"54a6d4af636872637ae53300","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/54a6d19d6368725d4bbf0900#post_54a6d19d6368725d4bbf0900\r\nNeat.","author":"505696b47f123b37e800effa"},{"id":"54a6de0a63687214fe270400","topic_id":"5161dd617f123bd25900013d","body":"\"@Too_Offensive\":/dis/the-time-wasting-thread/post/54a6d3a76368721f7ba50500#post_54a6d3a76368721f7ba50500\r\n\"@igotnopicks\":/dis/the-time-wasting-thread/post/54a6d4af636872637ae53300#post_54a6d4af636872637ae53300\r\nWhat's even more hilarious is that apparently the congressmen in question  have even shown up to the guy's kid's birthday parties and such.  Scalise is having a hard time defending himself; watching congressmen defend themselves after them getting outted as going to KKK leader's family gatherings and such is going to be a hell of a lot harder to do.","author":"38b55cdf63616403d7560600"},{"id":"54a6de76636872309ee00700","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/54a6de0a63687214fe270400#post_54a6de0a63687214fe270400\r\nAnd this is why Politics are bad.","author":"505696b47f123b37e800effa"},{"id":"54a6e62a636872199a412900","topic_id":"5161dd617f123bd25900013d","body":"Hey now, who wants to hear a cautionary tale about abortion? \r\n\r\nTruth be told, I had to write this out for a Tumblr blog that posts stories about awkward experiences, and I figured that I would get my money's worth out of this piece by posting it here and seeing your reactions as well. It's long, but hey, what can you do?\r\n\r\nI have adored the atmosphere of a public library ever since I was a little kid. It's not just the wealth of books that gets me excited, it's the studious air and interesting people. And my local library had to be - and continues to be - one of the best around. It's larger than the average library and is separated into three parts, the most relevant to this story being the Young Adult library. Having visited this section literally every weekday for a year, I had grown close to one of the librarians, Shawn. Shawn was, in the most blatant of words, a huge fucking nerd. He cosplayed, loved Dungeons and Dragons-esque games, and had a particular affinity for the horror genre. Our library's administration was pretty chill and had decided to let Shawn run an event after library hours called \"SITE ZERO\" in which an awkward mixture of sixteen year olds and Shawn's thirty something year old friends (one of which who used to be a makeup artist for the Walking Dead!) would scare the shit out of preteens by dressing like zombies and popping out of library shelves and the like. The kids, armed with nerf guns, found it their responsibility to shoot the incoming zombies in order to train for an inevitable Armageddon. Of course, the underbelly of our local middle school was stoked when word of the event broke loose, and signups came in left and right. Seeing as up until this date I had volunteered for practically every event the library had offered, Shawn asked me to help out. Of course, I gladly accepted. This was my first step into meeting the middle schooler I shall only refer to as \"Mole Kid\", as my friends continue to lovingly dub him to this day.\r\n\r\nThe night of the event came, and I had come thirty minutes earlier than my call time. I figured Shawn would need all the help he could get, so we went around doing minor things, like setting up tables and making sure the cables to the movie screen on the stage - the YA library was lucky enough to have an alcove in which a stage and TV hooked up to Xbox could be found - were in working condition. The few kids that had prematurely arrived were relatively well behaved, and I only had to confront them a few times when they were unwittingly annoying patrons and pretending to be turtle while hiding under a storage box. Normal preteen stuff. I had told Shawn that I would work the snack table that night, and he had given me instructions to not let kids eat until another librarian had laid out the rules of the event. After all, they should be listening to the librarian, not focusing on obtaining food. That's basic Community Service 101. My boyfriend arrived and decided to help me at the snack table, which was good, because the wave of kids was starting to arrive and head straight for our humble table. I must have said \"Sorry, you have to wait about ten minutes before you eat\" a hundred times along with my boyfriend, who we'll call Paco. Most kids were relatively understanding, even though it was easily nine thirty and most of them had probably eaten their last meal hours ago. One kid, who I had previously struck up a conversation with because we were both fans of My Little Pony, yelled \"Is that Rainbow Dash?!\" and as I was \"distracted\", pretended to steal a Twizzler, much to the hilarity of his friends. Still, that was in good fun. Mole Kid, evidently, had never heard of good fun.\r\n\r\nAs Mole Kid started to head toward our table, I didn't feel dread, but annoyance. I had previous encounters with this kid at other events, such as when he snatched a book from my hand, screamed \"IS THIS TWILIGHT?!\" (it wasn't even close) and proceeded to blow a raspberry in my face and run off. There  was also the time where he pretended to be one of the \"officers\" of an event and proceeded to boss everyone around (who believed him!) until I told him off and sent him back to his actual position, being an actual officer. This might explain why he had bit of a vendetta against me, but who knows. I could go on about his appearance, but all I really have to tell you is imagine what a child molester must have looked like when they were thirteen, and there you have it. And as his name suggests, yes, he had a mole about the size of a nickel on his face, but I'm not going to rag on him for something he can't control, I'm going to rag on him for his behavior. \r\n\r\nHe approaches our table, and I go into my little \"wait\" spiel. He stares blankly at me, sneers, and grabs three twizzlers before attempting to make a dash for it. Paco, with his quick reflexes, grabs the kid's hand gently but firmly. Keep in mind that we're not trying to be the bad guys here, but if a kid is walking around with food when we were specifically told to not hand it out, that could get us in trouble. Meanwhile, Mole Kid is screaming a stream of curses, all directed at me even though I'm not the one holding him. Nasty stuff, too - he's calling me a bitch, a slut, a whore…Finally, he drops the twizzlers, and leaves. The librarian finally gives her speech on the rules, the snack table is literally decimated afterwards, and everyone leaves the previously mentioned alcove, where the table is located, to hang out with their friends and wait for their turn to shoot zombies in the library's upstairs. I finally think I have a moment of silence with my boyfriend when Mole Kid comes trotting back to the table. Joy. He turns to Paco.\r\n\r\n\"Hey, you speak Spanish, right?\" It's kind of a weird question, but seeing as his real name is literally one of the most stereotypical Hispanic names out there (I guess not as bad as Paco, but just a little below that still), it's not entirely out of left field. \r\n\r\n\"Yes.\" he replies. \r\n\r\n\"Oh, good, because I've been learning it! Can we have a conversation?\"\r\n\r\nSo Paco speaks some elementary Spanish, probably something along the lines of \"how are you\". Mole Kid's response, naturally, is to start screaming what I assume to be a stream of Spanish insults and curses, judging by the look on Paco's face. Then Mole Kid starts twerking, actually turning around so we could see the outline of his asscheeks clap together, and starts grinding on the wheelchair ramp nearby while juggling singing some pop song about sex and continuously cursing in Spanish. The kid's got talent. Nobody can hear or even see all of this happening because so many kids have turned up that the noise level  is ungodly, and nobody is bothering to look toward the alcove because they're preoccupied with their friends. Shawn is upstairs directing the kids, and the only other librarian is standing at a faraway door making sure nobody runs out. He finally bores of his dance, laughs, and runs away. Peace at last, right?\r\n\r\nNext to the wheelchair ramp is two sets of stairs. One is abysmally narrow, the other is extremely wide. It sounds weird, I know, but it's a better design choice in person. Me and Paco sit on the narrow staircase, figuring that there's more than enough room to the right for kids to pass comfortably. With our duties fulfilled and at least a good hour left in the event, we take the time to talk. A small girl walks up to us ten minutes in, and Paco immediately recognizes her as his best friend's little sister, Samantha. She's a sweet little thing, and shyly asks us questions about our relationship. Cute innocent stuff like \"How long have you been together\" (I thought she was going to die when I replied \"almost two years\"), \"Where do you go on dates\", the like. But all was ruined when I hear a familiar voice shriek \"WAIT, WHAT?\", loud enough to pierce the veil of the collective tweenagers. I feel something jump quite literally over my head - he should really consider signing up for America's Got Talent or something, clearly he has some skills that need exploiting - and before I can even breathe, he's shoved a thick piece of paper in Sam's face, who is so taken aback that she nearly loses her balance on the stair. I'm barraged with questions by the incipient tween, who is screaming stuff like \"How many times have you fucked?!\" as he leans on my knees and is inches away from my face. I push him off and tell him that it's none of his business. He stands up and starts yelling, again, that I'm a bitch, a slut, a whore…It's so loud once more that nobody hears him, and Paco is so drawn up in comforting the clearly shaken Samantha that he doesn't hear the verbal barrage. I hear Samantha briskly apologizing for her \"friend's\" actions, and I'm about to tell Paco to get this kid away from me when I feel a light breeze in my nether regions. Mole Kid has my legs spread apart, staring intently downwards, and tells my boyfriend (who again, doesn't hear him) to \"get a look at this\". I shriek, firmly close my legs, but he tries to force them open again. He almost does until I scream again and tell him to fuck off. Now Paco hears, but since Mole Kid has briskly let go of me and run off within practically the blink of an eye, he doesn’t see what has happened. I try to explain, but the event has me so shaken that the words don't come out right. \r\n\r\nSo now Paco's dangerously confused, I'm scanning the room for the nearest librarian, and Sam doesn't have any idea how to react to the tense aura she's getting. And like the cherry on top of the ice cream sundae, as I'm about to get up and grab a librarian, I feel sharp nails digging into the top of my head, their owner's arm hidden behind the wheelchair ramp. That does it for me. I tell a librarian what has happened, and while I don't think she handled it as well as she could have, she bans Mole Kid from participating in the event - he hadn't been able to go upstairs yet, his group was supposed to go last - and forces him to sit in the corner of the library. He looks pissed, dialing his brand new Iphone - probably to call his Daddy - and I have a temporary victory. But here's the scariest part of this entire story.\r\n\r\nI walk back to the alcove for a few minutes, and tell Paco what has transpired. As much as I love him, Paco is a bit slow when it comes to processing sudden events, and the heaviness of what has just happened hasn't really sunk in yet. So I turn back around - I don't really remember why - to meet the scariest thing I've ever seen in my life. Mole Kid, sitting in his time out chair, quite literally has a ring of pubescent girls sitting around him criss-cross applesauce style (including darling Sam), all of which are staring very intently at him, as if hanging onto his every word. There was no way that one girl who was his friend came to sit with him and her friends just happened to follow - the looks on their faces, the way they were looking at him, the fact that Mole Kid didn't even need to get up to have all of these girls at his beck and call…it disgusts me even to this day. I didn't hear what he said to them, but suddenly, all of them were looking at me. Not with disgust, not with contempt, just blank looks, like patrons examining a rather average animal at the zoo. \r\n\r\nThe story has a somewhat happy end - my mother raised all hell when she found out, called up the library,  managed to get Mole Kid's father contacted (the only words he said on the matter were \"This will never happen again\"), and now, thanks in part to my relationship with the librarians, Mole Kid can't walk anywhere in the library without every librarian knowing what he did. And Paco, who finally had the brunt of the situation hit him, always draws closer to me when Mole Kid approaches in the library. To be honest, I'm more sad for Mole Kid than I am angry - there's obviously something very wrong with him. To spread someone's legs apart in broad light while right next to their boyfriend isn't being a creep, it's a quite serious lack of boundaries. And let's not even get  into his manipulation of women. The last I saw of him, he's hanging out with a crowd of \"edgy\" eighth graders who look at me funny whenever we see one another. He went to one of Paco's theatrical performances, disrupting the play when Paco, playing Ernie in \"It's a Wonderful Life\" dragged a knocked out police officer off stage followed by Mole Kid yelling \"Yass, work!!\" And as my best friend likes to remind me, he's currently posting videos of himself twerking and imitating Beyonce on Instagram. Yeesh.\r\n\r\n","author":"5041b54f7f123b77af00a442"},{"id":"54a6e650636872581a1b0400","topic_id":"5161dd617f123bd25900013d","body":"\"@AppleJackFrost\":/dis/the-time-wasting-thread/post/54a6a2f26368725a94791200#post_54a6a2f26368725a94791200\r\n[bq=\"AppleJackFrost\"]\"@Carcass Strife\":/dis/the-time-wasting-thread/post/54a6a29d63687216c7fa0700#post_54a6a29d63687216c7fa0700\r\n!http://cdn.myanimelist.net/images/characters/14/47264.jpg![/bq]\r\nFffffffuuuuuuuuck yoooooooooouuuuuuuu Ikutsukiiiiiiiiiiiii!","author":"4fde4618945b700aa0002fff"},{"id":"54a6e6a16368721c03a10700","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/54a6e650636872581a1b0400#post_54a6e650636872581a1b0400\r\n_*NO SPOILERS*_","author":"50c204917f123b31440000a5"},{"id":"54a6e70b6368724137380e00","topic_id":"5161dd617f123bd25900013d","body":"\"@Number1pegasus\":/dis/the-time-wasting-thread/post/54a6e6a16368721c03a10700#post_54a6e6a16368721c03a10700\r\n[spoiler]When I first saw him I didn't trust him.[/spoiler]","author":"4fde4618945b700aa0002fff"},{"id":"54a6e7c46368720cc88c0400","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/54a6e70b6368724137380e00#post_54a6e70b6368724137380e00\r\nI SAID NO FUCKING SPOILERS\r\n\r\n_*SLAPS*_\r\n\r\n!http://stream1.gifsoup.com/view2/20140308/4996139/sol-dragon-install-instant-kill-o.gif!\r\nNOW GO BACK TO THE WOOLIE HOLE OF WHENS YOU CAME! \r\n","author":"50c204917f123b31440000a5"},{"id":"54a6e848636872581af00400","topic_id":"5161dd617f123bd25900013d","body":"*MORNING BAR MATES!!!*","author":"4fde5cee945b700a970060fc"},{"id":"54a6e9036368727e64800000","topic_id":"5161dd617f123bd25900013d","body":"!http://i.imgur.com/NbO7519.png!","author":"5154c5237f123bcd580002fc"}]}