{"topics":[{"id":"5519589e6368721ee4b20c00","topic_id":"5161dd617f123bd25900013d","body":"Potentially drama inducing post:\r\nI had some deep thoughts last night and to make it short I just don't get why western civilization demonizes human sexuality, fetishes and such cause if anything human sexuality helps people find boyfriends/girlfriends that they are more compatible with.\r\n\r\nWe have large scale groups trying to criminalize homosexuality, people that believe that homosexuality is hatred towards women (Thanatos I know this'll probably piss you off but that's why I'm no longer consider myself a classical feminist because one of the new tenants of the movement is that the movement now believes that homosexual males are discriminating against women... and no that's not a exaggeration), we have constant demonization of fetishes (even the vanilla ones), we have constant demonization of sexuality and expression of one's sexuality, we have constant demonization of things outside norms and such, but if anything these things improve relationships.\r\n\r\nIf you don't get what I mean it's okay for women to be tomboys, but it's \"not okay\" for men to be \"sissies\"; it's for people to have sex in missionary position but it's \"not okay\" for people to be sexually attracted to a particular thing about their spouse and so forth.\r\n\r\n\r\nBefore I get twenty replies going, \"why'd you start shit?!\" to simplify it as much as humanly possible:\r\nCompletely 100% hypothetical scenario but let's say your best friend in the whole world gets in a horrible car accident and has to have their arms amputated and as a result their spouse divorces them cause they don't want to have to take care of them; would it really be that \"evil\" for them to use a dating site to find a person that is into amputees or such?  Or hypothetically speaking let's say that best friend of yours instead of losing their arms gets horribly burned and as a result their spouse divorces them cause their spouse thinks they're \"ugly\"; would it really be \"evil\" for them to use a dating site to find people that think that's cute or such?\r\n\r\nIt's kind of sad when you think about it cause mainstream society constantly praddles on about how any sort of sex outside of missionary position for reproduction is \"evil\" and yet this mentality dooms countless individuals to forever being alone and dying alone simply because they're not \"normal\".\r\n\r\n\r\nTo use a less extreme hyperbole okay let's use transgender as a example; spouse abuse against transgender individuals is extremely fucking rampant and I don't mean just a little rampant or such but rather if you're transgender you're looking at about a ballpark estimate of a 1/4 chance of your spouse beating utter living shit out of you.  So your choices are A)use a fetish dating site/go to a gaybar/etc B)risk one day waking up to your spouse bashing in your knees with a baseball bat.\r\n\r\nIn that case is open sexuality, \"promiscuity\", fetishes, dating sites or the hundred or so other things that mass media praddles on about being \"evil\" really that \"evil\" if it helps people find non-abusive relationships?\r\n\r\n\r\n\r\nTl:dr; is what \"moral guardians\" deem to be \"promiscuous\" really that \"evil\" if it helps people find non-abusive relationships?  And what is more \"evil\"; society becoming promiscuous or having large scale cases of spouse abuse?\r\n\r\n\r\n\r\nIf anything I'd argue that promiscuity in society is a good thing cause let's look at the facts, while correlation doesn't mean causation it's a theory and more of a spitball, but since the widespread adoption of the internet rapes and spousal abuse in the usa has dropped like a fucking stone in only two decades.  Up until the internet reached adoption spousal abuse, rape and such was constantly rising at a alarming rate to the point alarmists were totally right but now it's dropping so fucking fast that a lot of organizations are starting to worry about rape and spouse abuse becoming \"too low\".\r\n\r\nBefore someone goes, \"rape and abuse is still a problem!\" or goes on self important moral guardian mode I'm not saying that there aren't problems in the world; rather pre-internet era rape and spousal abuse was sky rocketing so fast that it was rapidly growing so quickly that if that trend continued then today it would have been considered perfectly normal and instead it's now dropping beyond faster than anything we've seen in the last ten thousand years of human civilization.\r\n\r\n*Tl:dr of everything; perverts for a better future!*","author":"38b55cdf63616403d7560600"},{"id":"551959b763687234e2e41600","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5519589e6368721ee4b20c00#post_5519589e6368721ee4b20c00\r\nIndeed that last one :D","author":"505696b47f123b37e800effa"},{"id":"55195f2c636872752b730c00","topic_id":"5161dd617f123bd25900013d","body":"Thinking further on it; I can totally understand third wave feminists, moral guardians and soccer moms' thought processes now.\r\n\r\nA lot of those people grew up in the 80's when rape, spouse abuse and other shit was spiralling out of control and no one could even slow or halt it's rapid increase then all of a sudden *click* the internet and the problem rapidly reversed faster than we've ever seen before.\r\n\r\nIf you grew up during that era it would be hard to believe that the problem reversed so rapidly and it would be harder to believe that the reason was because people's perversion reversed it.  They grew up in the era in which nobody could do anything to stop the rapidly increasing number of cases and they were constantly told that the only way to stop such things was to stop human sexuality.\r\n\r\nIt'd be like living your entire life for a cause hoping that something you can do could do something to stem the increase and then *bam* problem in only a couple years starts rapidly reversing without your help.  I guess when you get down to it moral guardians aren't bad people, rather they what they are guilty of is refusing to admit that their efforts were in vain, but I can't really blame them cause if you live your entire life to try to better the world only to find out that everything you did was in vain and that your entire life meant nothing and that you accomplished nothing that's really hard for people to accept.\r\n\r\n\r\nIf I had to say something profound on this it would have to be don't metaphorically die for a cause rather live for one.  What I mean by this is don't go, \"oh no!  I didn't actually effect the world!  I wasted my life!\" rather go \"woohoo!  The world is a better place regardless!\"","author":"38b55cdf63616403d7560600"},{"id":"55196bb76368720f086b0e00","topic_id":"5161dd617f123bd25900013d","body":"So anyone else here read Order of the Stick?","author":"509f70a87f123b77eb0004fd"},{"id":"55196ec66368724cdaa50900","topic_id":"5161dd617f123bd25900013d","body":"I got Molten Armor set.","author":"5446fcfc6368723ec21a0000"},{"id":"55196f26636872431c620c00","topic_id":"5161dd617f123bd25900013d","body":"\"@Carcass Strife\":/dis/the-time-wasting-thread/post/55196ec66368724cdaa50900#post_55196ec66368724cdaa50900\r\nThe new chapter and a bonus chapter came out yesterday.","author":"5062d6f17f123b3e16001184"},{"id":"5519712e6368721ee4d00d00","topic_id":"5161dd617f123bd25900013d","body":"\"@trashboat\":/dis/the-time-wasting-thread/post/55196f26636872431c620c00#post_55196f26636872431c620c00\r\nJust read them.","author":"5446fcfc6368723ec21a0000"},{"id":"551971df6368727a85e12000","topic_id":"5161dd617f123bd25900013d","body":"\"@Carcass Strife\":/dis/the-time-wasting-thread/post/5519712e6368721ee4d00d00#post_5519712e6368721ee4d00d00\r\n[spoiler]SERIOUS CONSECUTIVE HOPS[/spoiler]","author":"5062d6f17f123b3e16001184"},{"id":"551972e66368727257b01700","topic_id":"5161dd617f123bd25900013d","body":"I think I've figured it out. GaoGaiGar has been pretty episodic so far. Monster shows up, monster does shenanigans, monster gets their ass kicked. I think what makes it unique is how different the episodes truly are. Whether it be working within the limitations if something that happened in a previous episode or something new happening all together each episode is different. It gives the series a sense of continuity despite it's large episodic nature.","author":"4fde4618945b700aa0002fff"},{"id":"551974a56368727603341200","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/551972e66368727257b01700#post_551972e66368727257b01700\r\nYeah, I've noticed that it does the formula pretty well. It helps that there's cool new tech in just about every episode\r\n\r\nApparently shit gets real about half way through the series though And it sort of breaks the formula it started with","author":"500b587e7f123b1f230014a9"},{"id":"55197768636872752b9e1200","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/551972e66368727257b01700#post_551972e66368727257b01700\r\nHey Uc9 wanted you to talk Marc into cosplaying this\r\n!http://promo.na.leagueoflegends.com/assets/dj-sona/img/DJSona-Wallpaper-Kinetic.jpg!\r\n\r\n\r\n\"@Too_Offensive\":/dis/the-time-wasting-thread/post/551974a56368727603341200#post_551974a56368727603341200\r\nI think it was you who was on about that Blackthorne game, played it, it is actually pretty good for it's time,","author":"509f70a87f123b77eb0004fd"},{"id":"551977816368725719e70500","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/551972e66368727257b01700#post_551972e66368727257b01700\r\nA lot of people say that the first half is boring as hell, But I don't agree with them.","author":"5062d6f17f123b3e16001184"},{"id":"551977976368727554c21c00","topic_id":"5161dd617f123bd25900013d","body":"\"@Thanotos Omega\":/dis/the-time-wasting-thread/post/55197768636872752b9e1200#post_55197768636872752b9e1200\r\nHe's too blonde for it.","author":"4fde4618945b700aa0002fff"},{"id":"551977a863687274e81e1900","topic_id":"5161dd617f123bd25900013d","body":"\"@trashboat\":/dis/the-time-wasting-thread/post/551977816368725719e70500#post_551977816368725719e70500\r\nThey're idiots.","author":"4fde4618945b700aa0002fff"},{"id":"551977e66368726a08a40000","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/551977976368727554c21c00#post_551977976368727554c21c00\r\n!http://promo.na.leagueoflegends.com/assets/dj-sona/img/DJSona-Wallpaper-Concussive.jpg!","author":"509f70a87f123b77eb0004fd"},{"id":"5519781a6368727100121d00","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/551977976368727554c21c00#post_551977976368727554c21c00\r\nI think he has a better chance of dressing up like Spiderman than that thing.","author":"505696b47f123b37e800effa"},{"id":"55197837636872706ac50d00","topic_id":"5161dd617f123bd25900013d","body":"\"@Thanotos Omega\":/dis/the-time-wasting-thread/post/551977e66368726a08a40000#post_551977e66368726a08a40000\r\nAnd besides, why would anyone want to cover those beautiful blue eyes of his?","author":"4fde4618945b700aa0002fff"},{"id":"551978976368727554441d00","topic_id":"5161dd617f123bd25900013d","body":"!http://th01.deviantart.net/fs71/PRE/f/2013/287/8/8/onepunch_man___speed_of_sound_sonic_by_miyukiko-d6qfm6z.jpg!","author":"5062d6f17f123b3e16001184"},{"id":"551979056368720f08081100","topic_id":"5161dd617f123bd25900013d","body":"\"@Thanotos Omega\":/dis/the-time-wasting-thread/post/55197768636872752b9e1200#post_55197768636872752b9e1200\r\nI've heard as much. \r\nPrince of Persia with guns sounds pretty good to me. \r\n\r\n\r\n\"@trashboat\":/dis/the-time-wasting-thread/post/551977816368725719e70500#post_551977816368725719e70500\r\nI might be able to see where they're coming from since it could be a little grating To some people if you binge a bunch of episodes in a row\r\n\r\nBut naw, fuck that, I've only ever seen the first half and I still love it. ","author":"500b587e7f123b1f230014a9"},{"id":"5519794c63687272bd521400","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/55197837636872706ac50d00#post_55197837636872706ac50d00\r\nWell he could dress as Spiderman","author":"505696b47f123b37e800effa"},{"id":"551979a263687276038e1300","topic_id":"5161dd617f123bd25900013d","body":"Thanotos Omega suggested Dante Basco For Genos in a possible OPM Dub. I have no idea why I never thought of that.","author":"5062d6f17f123b3e16001184"},{"id":"551979a66368727603901300","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/55197837636872706ac50d00#post_55197837636872706ac50d00\r\nBlind the bastard ","author":"51a2815b7f123be59500049b"},{"id":"551979c16368727603aa1300","topic_id":"5161dd617f123bd25900013d","body":"\"@trashboat\":/dis/the-time-wasting-thread/post/551979a263687276038e1300#post_551979a263687276038e1300\r\nHONOR!!!!!!!","author":"505696b47f123b37e800effa"},{"id":"551979e16368726a089d0100","topic_id":"5161dd617f123bd25900013d","body":"\"@Too_Offensive\":/dis/the-time-wasting-thread/post/551979056368720f08081100#post_551979056368720f08081100\r\nI'm binging the hell out of this show and it's been anything BUT boring.","author":"4fde4618945b700aa0002fff"},{"id":"55197d1b636872704a831500","topic_id":"5161dd617f123bd25900013d","body":"I mean, That's just so perfect.","author":"5062d6f17f123b3e16001184"}]}