{"topics":[{"id":"5521c2c26368723166601200","topic_id":"5161dd617f123bd25900013d","body":"When Looking at french cartoons, They apparently made Totally spies. (Yeah. No surprise.)","author":"5062d6f17f123b3e16001184"},{"id":"5521c3c263687241eead1100","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5521c1866368724418651200#post_5521c1866368724418651200\r\nI think they were raised to be little pussies that can't handle an equal because they were promised a good little wife who would take what ever they gave them, you only need to look at the last couple of generations before ours to see people who were raised to think slapping your wife for back talk or not doing as you say was perfectly normal, ","author":"509f70a87f123b77eb0004fd"},{"id":"5521c71563687269c2ac0200","topic_id":"5161dd617f123bd25900013d","body":"\"@Thanotos Omega\":/dis/the-time-wasting-thread/post/5521c3c263687241eead1100#post_5521c3c263687241eead1100\r\nEven though you are right about how a lot of people think they're entitled to stereotypical spouses the dude raised a point though; if say 90% of men in the usa stop being sexually interested in women that's going to be a problem in the long run.\r\n\r\nObviously I'm not saying that people are entitled to stereotypical \"perfect\" spouses, but that in all probability there's two outcomes to this:\r\nA)People stop reproducing like what is happening to japan and how there's entire generations of people that aren't interested in ever having sex.\r\nB)Men will fill that femininity gap.\r\n\r\n\r\nCall me crazy, but I think both scenarios might happen because look at your average male college student; no girlfriend, no kids and a growing number of them never get either.  While on the surface this sounds good the usa no longer has a stable birth rate and the only reason why we're still growing is due to immigration.  If it wasn't for immigration the usa would be currently up shitter creek without a paddle.\r\nThe second scenario can be presented by using japan as a analogy; even though japanese culture vilifies crossdressing, mtf and such otakus are the majority of the younger generations and a lot of otakus in real life prefer traps over born female individuals.\r\n\r\n\r\nBasically what I'm getting at is that in a purely hypothetical scenario but if we ever reach the point where it's considered socially unacceptable for women to act in a feminine manner I would not be surprised if birth rates in the usa just crash into oblivion instantly.\r\n\r\n\r\nTl:dr; if that ever happened:\r\n24/7 news, \"Congratulations!  Societally women are no longer allowed to be feminine!\"\r\nNext year, \"Birth rates have dropped almost completely!\"","author":"38b55cdf63616403d7560600"},{"id":"5521c89163687252a1880700","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5521c71563687269c2ac0200#post_5521c71563687269c2ac0200\r\n[bq=\"uc9\"]\r\n\r\n\r\nBasically what I'm getting at is that in a purely hypothetical scenario but if we ever reach the point where it's considered socially unacceptable for women to act in a feminine manner I would not be surprised if birth rates in the usa just crash into oblivion instantly.[/bq]\r\nThat's bad...","author":"4fde5cee945b700a970060fc"},{"id":"5521c8d66368724418151800","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5521c71563687269c2ac0200#post_5521c71563687269c2ac0200\r\nThere are a hell of allot of other things effecting those, Japan also has massive depression issues, depressed people don't want social interactions, it's also massively over crowded, so it's not as worth while to reproduce, to put it simply there is a reason you see slower birth rates in first world countries is a complex set of things, and not as big a deal as it would be in say Nigeria where people die younger and more often, we will likely eventually even out at a new lower population since we just don't need as many people as we used to,","author":"509f70a87f123b77eb0004fd"},{"id":"5521c9af6368722c4c851400","topic_id":"5161dd617f123bd25900013d","body":"U sgoudl probably go to sleep\r\n\r\nlol no I wonät remove that, just have to prove that I'm treally rired and can't even typwe right now,.\r\n\r\nGood night everyone.","author":"5012e49c7f123b4012000341"},{"id":"5521ca67636872314f820600","topic_id":"5161dd617f123bd25900013d","body":"\"@ArcticEight\":/dis/the-time-wasting-thread/post/5521c9af6368722c4c851400#post_5521c9af6368722c4c851400\r\nApple Bloom has evolved into Snowdrop!","author":"4fde5cee945b700a970060fc"},{"id":"5521caf76368722c4c131600","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/5521c89163687252a1880700#post_5521c89163687252a1880700\r\nI wouldn't be surprised if it happens eventually cause I know I come off as a sex fiend, but sometimes interesting things are talked about on sex sites cause people are more open about it, the thing is though that more and more men are no longer interested in women.\r\n\r\nI'm looking at a five year old study, but since 1970 the percentage of people currently married or in a relationship has been slowly dropping.  How bad has this gotten?  Over 40% of people in the usa that are adults are not in relationships.... That's very fucking bad.\r\n\r\n*edit*\r\nRuh-roh; I found a more recent study by bloomberg magazine; in 2010 only 40% of the usa was single (cnn) and in 2014 it increased to 50% (bloomberg)... uh-oh\r\n\r\n\"@Thanotos Omega\":/dis/the-time-wasting-thread/post/5521c8d66368724418151800#post_5521c8d66368724418151800\r\nYeah I know; I was just using it as a partial analogy to talk about if you have a entire generation no longer interested in sex that's very bad.","author":"38b55cdf63616403d7560600"},{"id":"5521cbd46368724fe8a40f00","topic_id":"5161dd617f123bd25900013d","body":"\"@ArcticEight\":/dis/the-time-wasting-thread/post/5521c9af6368722c4c851400#post_5521c9af6368722c4c851400\r\nYou have transformed! Into a new being!\r\n\r\nGood night dude! ","author":"50c204917f123b31440000a5"},{"id":"5521cc546368724bffe72800","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5521caf76368722c4c131600#post_5521caf76368722c4c131600\r\nArtificial insemination, most of those people in Japan don't want to get married because they think it's a set back (It is life long single people live longer and happier lives,) but i would be willing to bet many are still interested in having a child, the most likely out come if first world nations stop  reproducing fast enough to sustain themselves is just more immigrants coming in, as when people don't feel worried about over crowding they will more happily accept new arrivals,","author":"509f70a87f123b77eb0004fd"},{"id":"5521ccf963687206aad00200","topic_id":"5161dd617f123bd25900013d","body":"\"@Thanotos Omega\":/dis/the-time-wasting-thread/post/5521cc546368724bffe72800#post_5521cc546368724bffe72800\r\nImmigration is the only thing keeping the usa afloat at this point, but there's still the relationship problem.  IF people stop en masse reproducing that's going to get ugly and fast.  Even if you offset low birth rates with immigration that still causes severe economic problems because currently one of the biggest things people as a whole spend on is children; if people aren't spending money raising their children then they aren't pumping money into the economy; if they aren't pumping money into the economy well you know.\r\n\r\nTo use a hyperbole analogy let's say for example people as a whole just decided to stop paying their loan debts; wouldn't that be a problem economically if people just decided to stop using money?","author":"38b55cdf63616403d7560600"},{"id":"5521ce8b63687276fb9d0800","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5521ccf963687206aad00200#post_5521ccf963687206aad00200\r\nOne thing you are forgetting is there are to many people here, we can't fully mechanize certain jobs because it's still slightly cheaper to use manual labor(look at all the jobs migrant workers do, slowing down progress in those fields by undercutting inovations), as the pool thins it will become more mechanized, Also remember there is a solid chance that the first person to live to 150 years old has already been born, you don't need as many new people when the ones you have can work into the 80-100s","author":"509f70a87f123b77eb0004fd"},{"id":"5521cf186368723c691d0400","topic_id":"5161dd617f123bd25900013d","body":"My Gainax Timeline\r\n\r\n[spoiler]Gunbuster starts - Evangelion happens while the exelion is out in space - Humanity revives from Being tang - Diebuster happens - The Buster machines #1 and #2 return to earth - Humanity gets its ass kicked by the Anti-spiral due to the lack of a working Gunbuster, Topless, and Buster Machine #7 - Gurren Lagann Happens[/spoiler]\r\n\r\nIt's not that great I know.","author":"5062d6f17f123b3e16001184"},{"id":"5521cfae6368723166111f00","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5521ccf963687206aad00200#post_5521ccf963687206aad00200\r\nYou seriously think this will happen?","author":"4fe3df367f123b517900066a"},{"id":"5521d0656368724fe8411400","topic_id":"5161dd617f123bd25900013d","body":"\"@Thanotos Omega\":/dis/the-time-wasting-thread/post/5521ce8b63687276fb9d0800#post_5521ce8b63687276fb9d0800\r\nThe thing is though that we're talking about in the long run dude.\r\n\r\nSure about 70% of the minimum wage workforce is probably going to be mechanized in the next ten years, but the minimum wage workforce is only a small portion of the economy.  It's going to take another 20 to 30 years until the majority of the workforce is mechanized.\r\n\r\nIn a purely hypothetical scenario to illustrate my point let's say that today people in the usa stopped having sex:\r\n2016: \"It's not a problem; there's nothing wrong and we're all okay\"\r\n2025: \"OH GOD!  THE COUNTRY IS TOTALLED!  THE ECONOMY IS IN RUINS!  REPENT!  REPENT! THE END IS NIGH!\"\r\n2035: \"Well that was certainly the worst depression in history!\"\r\n\r\nMy point is that for the next twenty years we need people to keep having sex to prevent a unprecedented economic depression.  If people for some reason in the usa stopped having sex and reproducing that would be very bad economically.\r\n\"@mariomarc\":/dis/the-time-wasting-thread/post/5521cfae6368723166111f00#post_5521cfae6368723166111f00\r\n[bq=\"mariomarc\"]\"@uc9\":/dis/the-time-wasting-thread/post/5521ccf963687206aad00200#post_5521ccf963687206aad00200\r\nYou seriously think this will happen?[/bq]\r\nIt very well could be cause the percentage of the usa that is single is increasing at a terrifying rate.","author":"38b55cdf63616403d7560600"},{"id":"5521d07963687233b6e60e00","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5521caf76368722c4c131600#post_5521caf76368722c4c131600\r\nAnyway for us as a species to reverse the trend? I'm not liking this development one bit. More over, what's causing marriage rate to drop? Economy? Culture shift? Or what?","author":"4fde5cee945b700a970060fc"},{"id":"5521d0c96368721262410500","topic_id":"5161dd617f123bd25900013d","body":"I know someone will blame the internet for all that","author":"4fe3df367f123b517900066a"},{"id":"5521d1696368724fe8541500","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5521d0656368724fe8411400#post_5521d0656368724fe8411400\r\nThey are, This idea of a 90% of a population as large and diverse as our suddenly giving up on having kids isn't likely, Also allot of people are having their kids much later in life, And the fact that 42% of our generation think gay sex is wrong probably means they are going to stick to strait sex,","author":"509f70a87f123b77eb0004fd"},{"id":"5521d1c96368720864071300","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5521d0656368724fe8411400#post_5521d0656368724fe8411400\r\nSingle does not equal not reproducing, odds are that is for Married couples not couples in general,","author":"509f70a87f123b77eb0004fd"},{"id":"5521d1d96368720938711100","topic_id":"5161dd617f123bd25900013d","body":"[spoiler]That timeline does leave a canon 10,000 year gap between the events of Gunbuster and Diebuster where not much happens. (I tried to fit TTGL there, But that raised too many questions.)[/spoiler]","author":"5062d6f17f123b3e16001184"},{"id":"5521d2206368724fe8021600","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5521c71563687269c2ac0200#post_5521c71563687269c2ac0200\r\nThat is the opinion of the manosphere. And probably","author":"4fe16df67f123b13e400003f"},{"id":"5521d267636872623c4e0200","topic_id":"5161dd617f123bd25900013d","body":"\"@Thanotos Omega\":/dis/the-time-wasting-thread/post/5521cc546368724bffe72800#post_5521cc546368724bffe72800\r\nincorrect. Married people live longer and happier lives.\r\n\r\nJapan has commodified all the perks of marriage (hostess clubs so forth) and has a cult-ish corporate environment where people work themselves for their whole lives","author":"4fe16df67f123b13e400003f"},{"id":"5521d2f2636872314f090a00","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/5521d267636872623c4e0200#post_5521d267636872623c4e0200\r\nAssuming the marriage works. Which isn't the case for a lot of young couples nowadays. Divorce rates are high.","author":"4fde5cee945b700a970060fc"},{"id":"5521d30d63687231667e2200","topic_id":"5161dd617f123bd25900013d","body":"!https://38.media.tumblr.com/b8f7d2f903c5337095323736cc49441a/tumblr_mjwsv9VzPY1qzynkdo2_500.gif!","author":"5062d6f17f123b3e16001184"},{"id":"5521d3706368724fe8701700","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/5521d2f2636872314f090a00#post_5521d2f2636872314f090a00\r\nLots of reasons for that.\r\nBut the divorce rate is not 50%. Because that is calculated when you factor the marriages in a year with the divorces in the same year: which skews towards divorce because the divorces could have been from any year prior. ","author":"4fe16df67f123b13e400003f"}]}