{"topics":[{"id":"552ccebd63687269d6f64900","topic_id":"5161dd617f123bd25900013d","body":"\"@Too_Offensive\":/dis/the-time-wasting-thread/post/552ccdd963687245e44b3900#post_552ccdd963687245e44b3900\r\nI prescribe myself as chaotic neutral.\r\n\r\nI legitimately don't believe in any morals, nor do I believe that it is \"good\", nor do I believe that I'm \"making a difference\", nor do I feel good or bad about it.  A chaotic good person would believe that they're doing the right thing; a chaotic neutral would merely look at it from a factual standpoint of \"this hoarder has five hundred tshirts; whereas this person has nothing except the clothes on their back and the hoarder refuses to give any clothing\".\r\n\r\n\r\nFor some reason people act as though if you're asking for them to give a single piece of clothing to someone in need or a blanket as though you're asking for the soul of their firstborn.\r\n\"*GASP!* You want a single piece of clothing for this person who has nothing?! Quick everyone take your cyanide pills!  The end times are upon us!  Pity unto us for we saw the signs of someone might come up to us and ask for some level of compassion for the needy and we did not heed them!  Them asking for the needy when we have plenty will usher in a thousand years of darkness!\"","author":"38b55cdf63616403d7560600"},{"id":"552ccef663687269d66a4a00","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/552ccd1463687269d69c4600#post_552ccd1463687269d69c4600\r\n\r\nThat's still having a moral compass. It boils down to do the right thing based on your own criteria despite  everything else.\r\n\r\nHate to break it to you, but you have a moral, the one of a Buddhistmonk at that. ","author":"4fdfbf92945b7075d50036e4"},{"id":"552cd08c636872511e321a00","topic_id":"5161dd617f123bd25900013d","body":"\"@QuasarNova\":/dis/the-time-wasting-thread/post/552ccef663687269d66a4a00#post_552ccef663687269d66a4a00\r\nIs it really a moral compass though if it's merely a analytically one of goods versus luxury and quantifying it merely as mere numbers without any emotional thought or investment into the situation?  If you're completely emotionally un-invested into it and think of the person's involved as just numbers is that really a moral compass when you're looking at the situation in the same way a person tries to solve a classwork math problem?","author":"38b55cdf63616403d7560600"},{"id":"552cd3766368726bacbb2800","topic_id":"5161dd617f123bd25900013d","body":"!https://41.media.tumblr.com/0e621413b496230405b4165c89486e08/tumblr_nmsablF3ad1qkgvtxo2_1280.png!\r\n!https://41.media.tumblr.com/8f4e90df1a7ccf07b62ee0c1f61877eb/tumblr_nmsablF3ad1qkgvtxo1_540.png!\r\nGenos is such a dork.","author":"5062d6f17f123b3e16001184"},{"id":"552cd39b6368724e38521400","topic_id":"5161dd617f123bd25900013d","body":"\"@trashboat\":/dis/the-time-wasting-thread/post/552cd3766368726bacbb2800#post_552cd3766368726bacbb2800\r\ncurse my backlog, this looks really interesting","author":"9ba2e84e636164642cc03200"},{"id":"552cd414636872385cfa0c00","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/552cd08c636872511e321a00#post_552cd08c636872511e321a00\r\n\r\nIf your decision is based and constructed upon your own experiences and views which resulted on the influence of an outside source, yes.\r\n\r\nYou said it yourself, morality is something that's shaped within us from what we see around us. It's no secret that no matter what you do you will always affect someone positively and negatively, and based on those assumptions you forge what will guide your actions. So in a sense, you could argue there's always a moral since everyone and everything is affected by an outside source and that makes them grow into shape.\r\n\r\nTaking your example of the shirt. The same reason you would give a shirt is not the same someone else would. That doesn't make them more or less amoral, it just makes them different and their view on the world is also different because they lived and were shapes by different circumstances than you did and vice versa.\r\n\r\nYou give it in a utilitarian sense, someone might in an altruistic way. The world isn't just black, grey or white. It's pink, red, briqn, orange, etc. When you see a person making a decision he's unavoidably affecting someone positively and someone negatively, and those affected will have their views on the world shaped by that. Which in turn will make them take a similar decision and so forth.\r\n\r\n There really isn't such a  thing as low or high moral when you see the environment around you. It's just a different result from decision someone else took over that individual that shapes them like that. That's not something to be ashamed of or sad. It's meant to be celebrated because it's a paradox in a way.\r\n\r\nYou mentioned once that free will wasn't real because we all are products of our environment and I just agreed with you, however, that also makes everyone unique still because of the infinite permutations a single decision or event can have on an individual thus, making their vision of the world unique to them.\r\n\r\nDon't know if it makes sense to you, it sounded better in my head. Point I try to get across is, you have a moral code based and shaped on what you saw and experienced.","author":"4fdfbf92945b7075d50036e4"},{"id":"552cd4ac63687269d68a5500","topic_id":"5161dd617f123bd25900013d","body":"I have a question.\r\n\r\nIt involves One Piece and Naruto.\r\n\r\n*clears throat* One Piece is generally more popular in Japan, having the top spot of copies sold overall, of all time. It has more variations in its story, the ever expanding universe it's in and to top it of, to take mediocre subjects and make them interesting in a new way, such as Luffy's rubber abilities which unlike American comics, also has the attributes of a rubber band and a balloon (US comics seem to focus on the stretching parts only).\r\n\r\nNow, for Naruto, a story of ninjas and ninjutsu, it is also widely known and popular but not as nearly as popular as One Piece. At least, in Japan. In Japan, it is below One Piece but in the US, it is the most famous manga, as easily shown in the majority of manga sites online where Naruto still takes the top spot despite had already ended. I mean, Naruto is very awesome, much like One Piece. It has a darker tone than One Piece generally and has more of the tactical views in fiction, like Death Note or Hunter X Hunter. \r\n\r\nMy question would be for the demographic which put sides on East and West. \r\nWhy is One Piece more popular in the East while Naruto is more popular in the West?","author":"4fe1b9f47f123b13df002976"},{"id":"552cd6b163687269d6ca5900","topic_id":"5161dd617f123bd25900013d","body":"\"@HJSDGCE\":/dis/the-time-wasting-thread/post/552cd4ac63687269d68a5500#post_552cd4ac63687269d68a5500\r\n\r\nSame reason why suicide (bare with me on this one) has different connotations in Japan and the US.\r\n\r\nIf you were to take your life in Japan, it would be seen as honorable and you redeemed not just yourself but your entire family. In the US, you're seen as a coward who took the easy route rather than make ammends.\r\n\r\nDifferent morals on different cultures.\r\n\r\nOne Piece is more popular because it embraces the silliness and sense of adventure much like a child would but doesn't shy away from handling more adult themes. However, there's still a sense of victory on the horizon and that everything will be ok no matter how rucked things get.\r\n\r\nNaruto is the same but applied differently. In Naruto every character had something bad happened to then and they act more in a sense of finding out their place in the world and if the sacrifices they make will end up being worth at the end. There's more a sense of uncertainty in that regard in that you don't quite know if things will work out and you just have to keep waking the line to find out. Which hits more to western audiences because the characters are struggling more and the victory isn't as clear as in One Piece.","author":"4fdfbf92945b7075d50036e4"},{"id":"552cd84d6368723feded0900","topic_id":"5161dd617f123bd25900013d","body":"\"@HJSDGCE\":/dis/the-time-wasting-thread/post/552cd4ac63687269d68a5500#post_552cd4ac63687269d68a5500\r\nTactical view of fiction?","author":"4fe16df67f123b13e400003f"},{"id":"552cd8c96368726bacfc2f00","topic_id":"5161dd617f123bd25900013d","body":"\"@EHAN\":/dis/the-time-wasting-thread/post/552cd39b6368724e38521400#post_552cd39b6368724e38521400\r\nGenos is pretty much a typical Angsty revenge-driven Cyborg Superhero.\r\n\r\nAnd Saitama spends his time reading manga and going grocery shopping and stuff. (When not beating monsters with one punch.)","author":"5062d6f17f123b3e16001184"},{"id":"552cd9e86368727a5d200300","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/552cd84d6368723feded0900#post_552cd84d6368723feded0900\r\nTactical views _in_ fiction.\r\n\r\nIn fiction, there are moments where it's less punch-and-grab and more complex which leads to things coming unfold. In short, strategies and tactics, kinda like used in war.\r\n\r\nOne Piece has very little of that. In the Dressrosa arc currently, there is indeed the use of strategy in battle which is a good example. Death Note uses a lot of strategy, from pencil leads in door hinges to fake worldwide news used to lure the murderer, which was only broadcast in the city. The ideas used is what made Death Note very well known.","author":"4fe1b9f47f123b13df002976"},{"id":"552cda1b6368726bacef3100","topic_id":"5161dd617f123bd25900013d","body":"God damn double posts!\r\nWhy does the page stop loading so suddenly, forcing me to reload which only resubmits what I recently posted?!","author":"4fe1b9f47f123b13df002976"},{"id":"552cdb136368723fed9a0c00","topic_id":"5161dd617f123bd25900013d","body":"\"@HJSDGCE\":/dis/the-time-wasting-thread/post/552cda1b6368726bacef3100#post_552cda1b6368726bacef3100\r\nReport site bugs \"here\":https://derpibooru.org/meta/report-site-bugs-here","author":"9ba2e84e636164642cc03200"},{"id":"552cdb996368726bac583400","topic_id":"5161dd617f123bd25900013d","body":"\"@EHAN\":/dis/the-time-wasting-thread/post/552cdb136368723fed9a0c00#post_552cdb136368723fed9a0c00\r\n\r\nI know it probably isn't, but that avatr makes it look like you're mocking him ","author":"4fdfbf92945b7075d50036e4"},{"id":"552cdb9f6368726bac5d3400","topic_id":"5161dd617f123bd25900013d","body":"\"@EHAN\":/dis/the-time-wasting-thread/post/552cdb136368723fed9a0c00#post_552cdb136368723fed9a0c00\r\n\r\nI know it probably isn't, but that avatr makes it look like you're mocking him ","author":"4fdfbf92945b7075d50036e4"},{"id":"552cdbcd6368726bacaa3400","topic_id":"5161dd617f123bd25900013d","body":"\"@QuasarNova\":/dis/the-time-wasting-thread/post/552cdb9f6368726bac5d3400#post_552cdb9f6368726bac5d3400\r\n*claps at posts*","author":"4fe1b9f47f123b13df002976"},{"id":"552cdca6636872385cfd1300","topic_id":"5161dd617f123bd25900013d","body":"\"@HJSDGCE\":/dis/the-time-wasting-thread/post/552cdbcd6368726bacaa3400#post_552cdbcd6368726bacaa3400\r\n\r\nGood cue to cut it and get some rest","author":"4fdfbf92945b7075d50036e4"},{"id":"552cdf8a6368722d45180300","topic_id":"5161dd617f123bd25900013d","body":"\"@EHAN\":/dis/the-time-wasting-thread/post/552cdb136368723fed9a0c00#post_552cdb136368723fed9a0c00\r\nBack to whatever that is I see","author":"4fe16df67f123b13e400003f"},{"id":"552ce0e46368722aa50e0500","topic_id":"5161dd617f123bd25900013d","body":"\"@HJSDGCE\":/dis/the-time-wasting-thread/post/552cd9e86368727a5d200300#post_552cd9e86368727a5d200300\r\nI gotcha.\r\n","author":"4fe16df67f123b13e400003f"},{"id":"552ce98a636872385c1e2600","topic_id":"5161dd617f123bd25900013d","body":"Starting Wolf Children now.","author":"5446fcfc6368723ec21a0000"},{"id":"552cfc1c6368726d90511100","topic_id":"5161dd617f123bd25900013d","body":"[spoiler]I think Sohei likes Yuki >W<[/spoiler]","author":"5446fcfc6368723ec21a0000"},{"id":"552d077263687210df7d0300","topic_id":"5161dd617f123bd25900013d","body":"\"@EHAN\":/dis/the-time-wasting-thread/post/552cd39b6368724e38521400#post_552cd39b6368724e38521400\r\nAnd how many times have you watched the same show.","author":"505696b47f123b37e800effa"},{"id":"552d2c8c6368723c87c90100","topic_id":"5161dd617f123bd25900013d","body":"\"@Carcass Strife\":/dis/the-time-wasting-thread/post/552ce98a636872385c1e2600#post_552ce98a636872385c1e260\r\n!i.imgur.com/odsQdko.gif!\r\nAlso I told my friend about wolf children\r\nHe said he might check it out\r\nWhat have I done","author":"500b587e7f123b1f230014a9"},{"id":"552d30d66368722e154d0300","topic_id":"5161dd617f123bd25900013d","body":"\"Goodbye.\"\r\n!http://25.media.tumblr.com/1c63b3ba7349f2a9f2572ed3120e209a/tumblr_mggi8rU2nC1rwcc6bo1_500.gif!","author":"5446fcfc6368723ec21a0000"},{"id":"552d32ef6368720eb8ac0000","topic_id":"5161dd617f123bd25900013d","body":"\"@Carcass Strife\":/dis/the-time-wasting-thread/post/552d30d66368722e154d0300#post_552d30d66368722e154d0300\r\nI TOLD YOU BRO\r\nI TOLD YOU ABOUT THE FEELS","author":"500b587e7f123b1f230014a9"}]}