{"topics":[{"id":"531d434e63687268ad660100","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/531d41846368724bf1240000#post_531d41846368724bf1240000\r\nScience fiction can get scary at times.\r\n\r\n\"For those who are thinking of getting a cat as a pet\":https://www.youtube.com/watch?v=hcSRRjwqX1M","author":"4fde5cee945b700a970060fc"},{"id":"531d43ab636872357f6e0100","topic_id":"5161dd617f123bd25900013d","body":"It's 10:46 for me, but seems must, if not, everyone on Derpibooru have 12:00 or later","author":"4fdfbf92945b7075d50036e4"},{"id":"531d47b66368726f9f440000","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/531d434e63687268ad660100#post_531d434e63687268ad660100\r\nNot really.  The reason being is that academia just wants to get their grant money at the end of the day and have no reason in investing money towards a homicidal ai.\r\n\r\nI'd be more worried if the military's own programs took off, but right now the military's own program has taken off about as much as final fantasy 13: lightning return's attempt to make a decent plot.\r\n\r\n\r\nBut that's enough of mocking people; the blue brain project is probably going to be first cause unlike the people bashing rocks together trying to make fire blue brain project on the other hand is actually making progress.","author":"38b55cdf63616403d7560600"},{"id":"531d8ee46368725f24480100","topic_id":"5161dd617f123bd25900013d","body":"Stuart Snyder's leaving CN. * hold's back cheering *.  Discuss.\r\n\r\n!http://i2.kym-cdn.com/photos/images/newsfeed/000/712/653/2ed.jpg!","author":"50d9a3aea4c72dc9b3000120"},{"id":"531db7bd6368720504160000","topic_id":"5161dd617f123bd25900013d","body":"\"@NotYourAverageLurker\":/dis/the-time-wasting-thread/post/531d8ee46368725f24480100#post_531d8ee46368725f24480100\r\nAww.... D:","author":"4fe1b9f47f123b13df002976"},{"id":"531db98b63687209edaa0000","topic_id":"5161dd617f123bd25900013d","body":"\"@NotYourAverageLurker\":/dis/the-time-wasting-thread/post/531d8ee46368725f24480100#post_531d8ee46368725f24480100\r\nHeh...","author":"31bee2686368722a0df23600"},{"id":"531deb7863687253470f0100","topic_id":"5161dd617f123bd25900013d","body":"It's a thread about nothing. How does it end?","author":"4fdfbf92945b7075d50036e4"},{"id":"531dec226368725347370100","topic_id":"5161dd617f123bd25900013d","body":"\"@QuasarNova\":/dis/the-time-wasting-thread/post/531deb7863687253470f0100#post_531deb7863687253470f0100\r\nIt ends in whatever way it wants to end.","author":"4fde5cee945b700a970060fc"},{"id":"531dec506368720c52cd0200","topic_id":"5161dd617f123bd25900013d","body":"\"@QuasarNova\":/dis/the-time-wasting-thread/post/531deb7863687253470f0100#post_531deb7863687253470f0100\r\n*music starts playing\r\nThis is the song that never ends\r\nYes it goes on and on my friend\r\nSome people started singing it, not knowing what it was,\r\nand they'll continue singing it forever just because..","author":"38b55cdf63616403d7560600"},{"id":"531df3dc636872772e390100","topic_id":"5161dd617f123bd25900013d","body":"Since I'm on the subject of technology lately I was going through forbes and apparently virtual reality and the oculus rift is going to make video game addiction a life threatening addiction. . . No seriously, apparently the usa air force was studying virtual reality training in soldiers and found that the reason why vr training is so effective is that while using a vr helmet people in the training forget that they're in training thus giving them a higher high from the training.\r\n\r\nIn other words when a person is using a vr helment their reaction to seeing a grenade isn't, \"Oh shit my guy's going to die, but that's okay since this is a video game\" your reaction instead is, \"Oh shit I'm going to die. . Wait, but this is just a video game so it's okay\"\r\n\r\nWhat this means is that when the oculus rift comes out that shit's going to sell like hotcakes, but the problem is people forgetting about their real life. . Wait let me rephrase that; individuals who get so engrossed into the dopamine high that they forget to take off their oculus rift.\r\n\r\nThis is going to end well for the video game industry, but not so much for the people who forget to eat or drink water.","author":"38b55cdf63616403d7560600"},{"id":"531e0d4763687268734b0200","topic_id":"5161dd617f123bd25900013d","body":"note to self: never accept more than 2 city in civ 5, it will screw up your entire game.","author":"5154c5237f123bcd580002fc"},{"id":"531e0faa636872601e940000","topic_id":"5161dd617f123bd25900013d","body":"!http://i.imgur.com/vykEppX.png!\r\n\r\nI've been loosing my shit at this picture of Punpun for five minutes. My stomach hurts.","author":"5041b54f7f123b77af00a442"},{"id":"531e0fd16368725de4500000","topic_id":"5161dd617f123bd25900013d","body":"\"@And Brother I Hurt People\":/dis/the-time-wasting-thread/post/531e0faa636872601e940000#post_531e0faa636872601e940000\r\nWhat....what...WhaT IS THAT!?","author":"500757fd7f123b75a90003b1"},{"id":"531e11ef6368724973370000","topic_id":"5161dd617f123bd25900013d","body":"\"@Princess♠Molestia\":/dis/the-time-wasting-thread/post/531e0fd16368725de4500000#post_531e0fd16368725de4500000\r\n\r\nFunnily enough, you're looking at the protagonist of one of the best, if not one of the darkest, coming-of-age mangas on market, _Oyasumi Punpun._\r\n\r\nThe main character appears to be an animal - he's really a human, but we seem him as some weird bird caricature - but the beauty of his appearance is that his facial expressions can easily be manipulated to show how he's really feeling on the inside (though this is a special case; in the image above he's faking happiness). A tale of love, loss, religion, and, mainly, the steps people take in growing up, it's certainly one of the best mangas.\r\n\r\nOf course, it does have moments like this:\r\n\r\n!https://encrypted-tbn3.gstatic.com/images?q=tbn:ANd9GcRpjcTTvn621Q_tqMusSam8SOz8EXtL6KrqfPi4M7LLMJ_MESFc!\r\n","author":"5041b54f7f123b77af00a442"},{"id":"531e136a636872781df80000","topic_id":"5161dd617f123bd25900013d","body":"\"@Princess♠Molestia\":/dis/the-time-wasting-thread/post/531e0fd16368725de4500000#post_531e0fd16368725de4500000\r\n\r\nlooks like a rip off of worker and parasite.","author":"5154c5237f123bcd580002fc"},{"id":"531e138563687206c3320000","topic_id":"5161dd617f123bd25900013d","body":"\"@And Brother I Hurt People\":/dis/the-time-wasting-thread/post/531e11ef6368724973370000#post_531e11ef6368724973370000\r\nI certainly wouldn't know it from those images.","author":"500757fd7f123b75a90003b1"},{"id":"531e1638636872012c030000","topic_id":"5161dd617f123bd25900013d","body":"\"@Princess♠Molestia\":/dis/the-time-wasting-thread/post/531e138563687206c3320000#post_531e138563687206c3320000\r\n\r\nIt's weird, and probably intentional, but for such a grimly realistic manga, the protagonist looks rather silly.\r\n\r\nIt gets really relatable - even if you don't personally know what it's like for your alcoholic father to fling your loudmouthed mother down a balcony all while you're still in kindergarten, the thoughts that travel through his head are things that we've all felt. Sometimes translated into beautiful use of the English (Japanese?) language, sometimes through pure, fiery fury on Punpun's face, it's definitely worth a shot.\r\n\r\nHis uncle's a rather interesting character too, what with his struggles with religion and depression. Women too, but not in the funny way where he can't talk to them or something, but there's a side stoy in the main plot that explains why he shys away from relationships, and boy, is it grim.\r\n\r\n\r\n\"@twistedmetalero\":/dis/the-time-wasting-thread/post/531e136a636872781df80000#post_531e136a636872781df80000\r\n\r\nStyle wise, or plot wise (not that there realy was much of one, from what I remember of the Simpsons episode)? Because either way, I don't really see it.","author":"5041b54f7f123b77af00a442"},{"id":"531e36d76368722a43a20000","topic_id":"5161dd617f123bd25900013d","body":"\"Why do villains do this?\":https://www.youtube.com/watch?v=qy3T9x5jQ_U","author":"4fde5cee945b700a970060fc"},{"id":"531e38ba6368725d40670000","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/531e36d76368722a43a20000#post_531e36d76368722a43a20000\r\nBecause if they didn't, they could win.","author":"509129db7f123b36cb010fa5"},{"id":"531e394c6368727fb1300000","topic_id":"5161dd617f123bd25900013d","body":"\"@boz\":/dis/the-time-wasting-thread/post/531e38ba6368725d40670000#post_531e38ba6368725d40670000\r\nHeaven forbid they win.","author":"513e68eda4c72d4e3b000164"},{"id":"531e39866368723ca34c0100","topic_id":"5161dd617f123bd25900013d","body":"So I just saw someone on a book reviewing website call \"The Witches\":https://en.wikipedia.org/wiki/The_Witches_(book), one of my all time favorite books as a child, misogynic. \r\n\r\nEver really want to grab someone by the shoulders and whisper in their ear \"you're really fucking wrong\"?\r\n\r\nIt actually hurt me more than the review above it that complained that the book would somehow turn children \"against\" teachers in general. Seems to be a common complaint among teachers/parents about Dahl's books, but a silly complaint nonetheless. He made it pretty clear that his characters were severely exaggerated. \r\n\r\nI mean, let's leave alone the fact that it's silly to call a book misogynic simply because the main villains of the book happen to be women, and that they're not really females to begin with; they're only posing at them. How the fuck did you miss the strong grandma figure, who took no shit from authority and singlehandedly raised a small child, even in her frail condition, just because (in Dahl's words) she was a \"tough old bird\"? Some one my best memories from childhood come from reading about that women telling old fairy tales to her grandson while smoking a big black cigar (and offering some of it to him, but hey, that's a different story). My copy of that book crumpled at the edges simply because I took it into the bath so many times to read.\r\n\r\nUsually, I'd wonder if I'm letting nostalgia get in the way, but after a brief skimming of the book, I have no idea how this idiot could have seen misogyny in this story.\r\n\r\nJust...ugh. You want to complain about misogyny, look in the newspapers. Don't drag harmless literature into the mix, it makes your cause look worse.\r\n\r\nI need a drink.","author":"5041b54f7f123b77af00a442"},{"id":"531e39c46368722ef0040000","topic_id":"5161dd617f123bd25900013d","body":"\"@Ore-O\":/dis/the-time-wasting-thread/post/531e394c6368727fb1300000#post_531e394c6368727fb1300000\r\n!http://fc02.deviantart.net/fs70/f/2011/019/e/b/protonjon_let__s_play__lex_wins_by_jazaaboo-d37kjrc.png!","author":"4fde5cee945b700a970060fc"},{"id":"531e3aaa6368725d5b9d0000","topic_id":"5161dd617f123bd25900013d","body":"\"All Gundam Fans should Watch Gundam X\":http://www.youtube.com/watch?v=KX63XB2N04A","author":"5062d6f17f123b3e16001184"},{"id":"531e3c3763687272233c0000","topic_id":"5161dd617f123bd25900013d","body":"\"@trashboat\":/dis/the-time-wasting-thread/post/531e3aaa6368725d5b9d0000#post_531e3aaa6368725d5b9d0000\r\nI remember my old friend playing a Gundam X game on the PSX. Which one do you think it was? If there is any Gundam X game at all?","author":"4fde5cee945b700a970060fc"},{"id":"531e3cf263687272ab380000","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/531e3c3763687272233c0000#post_531e3c3763687272233c0000\r\nI don't think so, It was probably some sort of Gundam crossover game that just had Gundam X mobile suits in it","author":"5062d6f17f123b3e16001184"}]}