{"topics":[{"id":"553b34d963687204ccba0e00","topic_id":"5161dd617f123bd25900013d","body":"Just finished Parasyte.\r\n\r\nSans the soundtrack, it really was awesome.","author":"4fdfbf92945b7075d50036e4"},{"id":"553b35186368721b8e1f0500","topic_id":"5161dd617f123bd25900013d","body":"\"@Princess♠Molestia\":/dis/the-time-wasting-thread/post/553b34b26368722e5abd0900#post_553b34b26368722e5abd0900\r\nFlash doesn't have his own movie. And of course there is the Flash TV series.","author":"505696b47f123b37e800effa"},{"id":"553b352d6368725b1e7f1200","topic_id":"5161dd617f123bd25900013d","body":"\"@Princess♠Molestia\":/dis/the-time-wasting-thread/post/553b34b26368722e5abd0900#post_553b34b26368722e5abd0900\r\nIf he even shows up. And knowing Warner Bros. they'll find a way to suck the fun outta him too. And no J'onn J'onzz! Are you fucking serious?!","author":"4fde4618945b700aa0002fff"},{"id":"553b35586368724320b20800","topic_id":"5161dd617f123bd25900013d","body":"\"@QuasarNova\":/dis/the-time-wasting-thread/post/553b34d963687204ccba0e00#post_553b34d963687204ccba0e00\r\nI didn't mind the soundtrack.","author":"5062d6f17f123b3e16001184"},{"id":"553b35ac6368723381290400","topic_id":"5161dd617f123bd25900013d","body":"\"@QuasarNova\":/dis/the-time-wasting-thread/post/553b349c63687204cc680e00#post_553b349c63687204cc680e00\r\n¿Oh Ohohoho, crees que habiedo creado nosotros a tan infame homúnculo no conocemos las malignas triquiñuelas de las abuelas fritangueras de Coatepec harinas? Los mexiquenses no tememos al mal, le pagamos al mal para que vaya y se chingue a otros.\r\n¿Alguna vez jugaste Spyro? ","author":"520901737f123b14a50000d8"},{"id":"553b364a6368721b8e3f0600","topic_id":"5161dd617f123bd25900013d","body":"\"@Meresflut\":/dis/the-time-wasting-thread/post/553b35ac6368723381290400#post_553b35ac6368723381290400\r\n\r\nNo son tan malignos como Moderatto haciendo cover de Bronco (Otro grupo que se va a mi lista negra) o esos herejes de Tabasco\r\n\r\nY no, nunca me llamó la atención. En ese entonces era mas de Metal Slug y Tekken... De hecho, todavia soy de Tekken\r\n\r\n\"@trashboat\":/dis/the-time-wasting-thread/post/553b35586368724320b20800#post_553b35586368724320b20800\r\n\r\nIt was pretty forgettable ","author":"4fdfbf92945b7075d50036e4"},{"id":"553b36926368722e5a050c00","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/553b352d6368725b1e7f1200#post_553b352d6368725b1e7f1200\r\n\r\nNot realistic or brooding enough.  \r\nGod forbid there be anything smile raising in a super hero movie.\r\n\r\n\r\n\"@igotnopicks\":/dis/the-time-wasting-thread/post/553b35186368721b8e1f0500#post_553b35186368721b8e1f0500\r\nHe's getting one in supposedly 2018. Its part of Dcs Cinematic universe.\r\n\r\n","author":"500757fd7f123b75a90003b1"},{"id":"553b36ae6368721b8e930600","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/553b352d6368725b1e7f1200#post_553b352d6368725b1e7f1200\r\n in case you missed my last reply\r\n\r\n\"@Thanotos Omega\":/dis/the-time-wasting-thread/post/553b346a6368722a90f20a00#post_553b346a6368722a90f20a00\r\n","author":"509f70a87f123b77eb0004fd"},{"id":"553b372d63687204cce61100","topic_id":"5161dd617f123bd25900013d","body":"Ah WWE. You're so, sooooooooooooooo stupid, but damn if you don't have cool things as well.","author":"4fdfbf92945b7075d50036e4"},{"id":"553b37d36368723381530500","topic_id":"5161dd617f123bd25900013d","body":">throat feels like it's made of sandpaper\r\n>barely cough a few times\r\n\r\n>throat has slight tickle \r\n>lungs fly out of my throat every five minutes","author":"500b587e7f123b1f230014a9"},{"id":"553b381063687204ccf61200","topic_id":"5161dd617f123bd25900013d","body":"\"@QuasarNova\":/dis/the-time-wasting-thread/post/553b364a6368721b8e3f0600#post_553b364a6368721b8e3f0600\r\nTekken, nada podía contra mi amado bloody roar. Hasa que cmo Jesus a Judas, l derrumbe vini desde dentro.\r\nPruebas feahcientsde nustra maldad son los torvos rituales de incesto detro de Reik. Eso fu eincómodo cuando salió, hasta lara mi, y yo había ya leído El Castillo de la Pureza.","author":"520901737f123b14a50000d8"},{"id":"553b39186368725b1e111800","topic_id":"5161dd617f123bd25900013d","body":"\"@Meresflut\":/dis/the-time-wasting-thread/post/553b381063687204ccf61200#post_553b381063687204ccf61200\r\n\r\n¿Quieres saber lo que es maldad? Si leiste solo el libro sin ver la película no cuenta. Ahora, si en cambio no solo leiste la obra, sino que ademas arrastraste a tu familia con la excusa de que \"Es para una tarea\" para que la viera y pasaste más tiempo viendo la incomodidad acreciendo en el ambiente, entonces ya estamos hablando.\r\n\r\nY Bloody Roar no es malo, tenia potencial. Los controles y jugabilidad es donde falló. Adivina que necesita un juego más que una buena historia o gráficos","author":"4fdfbf92945b7075d50036e4"},{"id":"553b393e6368722a900f1000","topic_id":"5161dd617f123bd25900013d","body":"That was a very dumb way to die in Rogue Legacy.","author":"4fdef063945b700a9d01604f"},{"id":"553b39a36368724320f10b00","topic_id":"5161dd617f123bd25900013d","body":"\"@Princess♠Molestia\":/dis/the-time-wasting-thread/post/553b36926368722e5a050c00#post_553b36926368722e5a050c00\r\nOh great I hope they won't damage him too much.","author":"505696b47f123b37e800effa"},{"id":"553b3a2e6368726b81390000","topic_id":"5161dd617f123bd25900013d","body":"*lurk","author":"37e5b9d66361642500af5e00"},{"id":"553b3aad636872741dbc1700","topic_id":"5161dd617f123bd25900013d","body":"I'm going to bed right now. G'night.","author":"505696b47f123b37e800effa"},{"id":"553b3aae636872741dc01700","topic_id":"5161dd617f123bd25900013d","body":"\"@Kaz\":/dis/the-time-wasting-thread/post/553b3a2e6368726b81390000#post_553b3a2e6368726b81390000\r\n!img2.wikia.nocookie.net/__cb20121230232530/metalgear/images/2/20/MGS_Exclamation_Mark_Icon.png!\r\nWhat was _that_ noise","author":"500b587e7f123b1f230014a9"},{"id":"553b3b556368724320680d00","topic_id":"5161dd617f123bd25900013d","body":"Bored...","author":"5062d6f17f123b3e16001184"},{"id":"553b3b6d6368723381d80600","topic_id":"5161dd617f123bd25900013d","body":"Does anyone wanna proofread this abomination for me?\r\n\r\n[spoiler]\"How many in your party?\", the bored waitress asked with no inflection in her voice.\r\n\r\n\"2! Wait, no, no! That's not right, uh, 3! Yeah, 3!\", she replied while glancing around nervously. She let out an embarrassed grin, \"Me, this candy wrapper, and this potato!\"\r\n\r\n\"How romantic...\", the waitress mumbled in a sarcastic tone, \"Right this way please.\r\n\r\nThe mare followed the waitress to the back of the crowded restaurant to a booth next to a window.\r\n\r\n\"Here's your menu, n-...\", she was interrupted mid-sentence.\r\n\r\nThe mare whispered and pointed to the rest of her inanimate friends, \"We are gonna need more than just *one* menu\".\r\n\r\n\"Oh, silly me\", the waitress rolled her eyes and grabbed two more menus off an adjacent table and placed them in front of the mare's friends.\r\n\r\n\"Now what can I get you to drink?\" She took out a notepad and pen.\r\n\r\n\"I would like some moonshine\".\r\n\r\n\"Ma'am, we don't sell moonshine here, *sigh* this is a family restaurant\".\r\n\r\n\"Then, I would like a glass of white wine, please\".\r\n\r\nThe mare looked over at her guests, \"What would you two like to drink? Mhm...mhm\", she looked back over at the waitress, \"They would both like water please\".\r\n\r\nThe waitress finished scribbling down the orders and left.\r\n\r\n \r\n\r\nThe mare reached into her sack and got out a small bag of white powder which she placed next to her, then she reached back into her sack and pulled out a small index card. She glanced around making sure no one noticed her and proceeded to pour a small amount of the powder onto the table. She made three neat lines of it. Pressing one nostril shut, she leaned over table and exhaled deeply through her one open nostril, vacuuming up the three lines in a rapid succession. She shuddered and twitched a few times before dusting the remaining powder off of the table and placing the baggy and index card back into her sack. \"D-do I *twitch* got any on my nose\", she asked jerking her head over to the potato, \"...\"\r\n\r\n\"Wha- I do!\", she dusted her nose off, \"better?\"\r\n\r\n\"...\"\r\n\r\n\"Alright, good.\"\r\n\r\n*Clack*, the sound of the wine glass being set on the table startled the mare. She jerked her head back around staring into the waitresses eyes for a few seconds, her nose bleeding, her mouth leaking with drool, and her chest rising and falling rapidly.\r\n\r\n\"Uh, ma'am, are you O.K?\", she said setting the remaining glasses onto the table.\r\n\r\n\"Yes, YES, *chuckles then twitches*, I am 100% A-O.K *twitch*.\"\r\n\r\n\"Whatever, do you need more time to decide?\"\r\n\r\n\"Mhm!\", a very wide grin formed on her face stretching her cheeks, \"Just - a - few - more - MINUTES!\", she replied in staccato. The waitress left the crazed mare.\r\n\r\n\"Food, food, food... What food is th-there?\", she whispered to herself unfolding the menu.\r\n\r\n\"Hay fries, hay shakes, hay salad, why the hay is everything saying hay to me\", she looked in the middle of the menu, \"Oh, this looks good!\", she said under her breath. She turned herself in the booth and raised her hoof, \"Ms. Waitress, yoo-hoo!\", she did not hear the shrieking mare; this made the crazed mare very irate. \"MS. WAITRESS!\". Silence now befallen the restaurant, everypony now stared in her direction. The waitress stomped her way over to the booth.\r\n\r\n\"What the BUCK do you want!\", the waitress said seething.\r\n\r\n\"I'm ready to order...\", the mare whispered, now drenched in sweat. The blood had dried and her mane was a mess; she kept twitching and glancing every which way.\r\n\r\nThe waitress took out her notepad and pen.\r\n\r\n\"I would like the 'eating raw or under-cooked foods may increase your risk of food-borne illness', please!\"\r\n\r\n\"Ma'am *facehoof*, that is not even a food item\".\r\n\r\n\"Really, well buck. I'll just have the *twitch* hay fries\", she replied speaking rapidly.\r\n\r\n\"I-is that a-\", the mare took the green mane of the waitress and tugged her down so that she was nose to nose with her. The waitress shrieked and squirmed about trying to get away from the mare's grasp, but with no avail. She could feel the quick, warm breaths of the mare brush against her face. The mare twitched a few times before staring right into the eyes of the waitress.\r\n\r\n\"Let me go! You motherbuck-\"... The mare turned her head and interlocked her muzzle with the struggling waitress's; the waitress went quiet and became still, closing her eyes. The mare's tongue pushed through the mouth of the waitress's and soft moan escaped her now penetrated mouth. The mare grinded her tongue against her's and then pulled away leaving a string of drool between the two ponies, which the mare had now slurped up. The waitress was frozen in place. She did not know whether to be aroused, scared, embarrassed, or pissed off.\r\n\r\n\"What the buck was that for!\", the waitress yelled throwing her hooves up. Drool dribbled down the mare's neck and she smiled back, \"What!\", her sides went into orbit.\r\n\r\n\"IT'S NOT BUCKING FUNNY!\"\r\n\r\nThe customers were disturbed by what they just had witnessed. Well most, one blue-maned pony from the crowd let out a wolf-whistle and shouted, \"That was bucking awesome!\"\r\n\r\n\"You're just so... hot, that I couldn't, help myself!\", the mare chuckled.\r\n\r\n\"Leave... Now!\", the waitress said with bloodshot eyes. She grabbed a butter knife from the table, \"OR I WILL BUCKING CUT YOU!\", she pressed the blade of the butter knife against the mare's throat.\r\n\r\n \r\n\r\n\"WH-WHAT, YOU WANNA FIGHT, BITCH!\", the mare exclaimed in a sudden change of mood prying the butter knife out of the waitress's hoof and shoving her causing her to stumble backwards. The waitress came to and threw herself at the mare enraged. The mare thrust the butter knife forward with all her might. There was a shrill cry of pain that came from the waitress. She looked downwards. The butter knife was handle deep into her shoulder. Blood was trickling down her arm and down the knife and onto the floor. The waitress fainted from the sight of her injury and collapsed onto the ground.[/spoiler]\r\n","author":"37e5b9d66361642500af5e00"},{"id":"553b3c216368723381a60700","topic_id":"5161dd617f123bd25900013d","body":"\"@igotnopicks\":/dis/the-time-wasting-thread/post/553b39a36368724320f10b00#post_553b39a36368724320f10b00\r\nDo you consider having a batman esque personality and muted colors damaged?\r\n\r\nFrom what we've been shown, this is probably what it will be like.","author":"500757fd7f123b75a90003b1"},{"id":"553b3c546368721b56870000","topic_id":"5161dd617f123bd25900013d","body":"Anyone?","author":"37e5b9d66361642500af5e00"},{"id":"553b3c8f63687216e42a0100","topic_id":"5161dd617f123bd25900013d","body":"\"@QuasarNova\":/dis/the-time-wasting-thread/post/553b39186368725b1e111800#post_553b39186368725b1e111800\r\nNo, fuimos yo y mis hermanos, aordamos no hablar de ello de nuevo, acuerdo que rompimos a día siguiete. Me precio de haberla puesto demoda en la secundaia donde iba. Pocos méritos masgrandes hay que traumar a toda una generación. Desde algún lugar, Sade nos mira y sonríe.\r\nYa se, ya se, nada mas que mastos balanceandose en un juego de bolleyball, increíblemente aburrido. Le funciono a DOA Exreme Bolleyball, ¿o era voleeyball?","author":"520901737f123b14a50000d8"},{"id":"553b3d236368722a90251500","topic_id":"5161dd617f123bd25900013d","body":"\"@Meresflut\":/dis/the-time-wasting-thread/post/553b3c8f63687216e42a0100#post_553b3c8f63687216e42a0100\r\n\r\n¿Traumar? Dudo que esa película haya traumado a pubertos, si acaso fue un adelanto de lo que Y tu Mamá También se acabaría volviendo.\r\n\r\nMalditas homófonas, los odio. Igual que al gerundio, y el objeto directo.","author":"4fdfbf92945b7075d50036e4"},{"id":"553b3d8163687243205b1000","topic_id":"5161dd617f123bd25900013d","body":"I hate wood stoves.\r\nI hate them soooooooooooooo muuuuuuuuuuuuch.","author":"4fde4618945b700aa0002fff"},{"id":"553b3dca6368725926b30300","topic_id":"5161dd617f123bd25900013d","body":"\r\nDOES ANYYYYYYYYYYYYYONE WANNA PROOFREAD THAT STORY","author":"37e5b9d66361642500af5e00"}]}