{"topics":[{"id":"532084d56368721f56ce0100","topic_id":"5161dd617f123bd25900013d","body":"!https://derpicdn.net/img/view/2014/3/8/569658__safe_animated_scootaloo_apple+bloom_sweetie+belle_screencap_cutie+mark+crusaders_hub+logo_hubble_hub.gif!","author":"50c204917f123b31440000a5"},{"id":"5320aaf06368725099600000","topic_id":"5161dd617f123bd25900013d","body":"You know. If you think about it. Cadence is possibly, or just potentially, the most powerful creature in all of Equestria, if not the universe.\r\n\r\nNeed to control something? Loveblast it so it obeys.\r\n\r\nXenomorphs attacking? Loveblast em.\r\n\r\nControl the heavens? Loveblast yer aunts.\r\n\r\nAssuming her control of love goes that far, which I like to imagine it does.","author":"500757fd7f123b75a90003b1"},{"id":"5320ac1363687250c3170100","topic_id":"5161dd617f123bd25900013d","body":"\"@Princess♠Molestia\":/dis/the-time-wasting-thread/post/5320aaf06368725099600000#post_5320aaf06368725099600000\r\nJesus You might be on to something there!\r\n\r\nAlso A while back I was talking with my sister and her husband also known as my brother in law and I said this \"You know what? Discord can actually probably beat superman\"\r\n\r\nThink about it, one of Supermans biggest weaknesses is Magic right? Discord is literally Fucking Chaotic magic! He can literally do anything he wants! hell  he could probably turn superman _Into_ Kryptonite if he wanted.","author":"50c204917f123b31440000a5"},{"id":"5320ac6a636872056b680100","topic_id":"5161dd617f123bd25900013d","body":"\"@Number1pegasus\":/dis/the-time-wasting-thread/post/5320ac1363687250c3170100#post_5320ac1363687250c3170100\r\n\r\nThat may be true depending on which version he faces, but he could not beat Captain Atom no matter which continuity.","author":"4fdfbf92945b7075d50036e4"},{"id":"5320acfd63687216fe1d0000","topic_id":"5161dd617f123bd25900013d","body":"\"@QuasarNova\":/dis/the-time-wasting-thread/post/5320ac6a636872056b680100#post_5320ac6a636872056b680100\r\nHow strong is Captain Atom anyway?","author":"50c204917f123b31440000a5"},{"id":"5320ae9a6368720cb6e30000","topic_id":"5161dd617f123bd25900013d","body":"When people talk about offensive stuff they tend to get mad at theme when what really matters is thesis.\r\n\r\nWhat do I mean? Glad you asked unwilling audience! Theme is just the set dressing, while thesis is what the joke or story or whatever is about. To give an example of what I'm talking about, the following jokes which I have seen people get pissed off about:\r\n\r\n\"So I was at this party and I ran into Jackie Kennedy and I wanted to break the ice so I asked 'so where were you when Kennedy was-'\" (stolen from Gilbert Gottfried.)\r\n\r\n\"What do 9 out of 10 people enjoy? Gang rape.\"\r\n\r\nTwo jokes which both trigger reactions of offense, however only one strikes me as being genuinely in poor taste.\r\n\r\nIn the first one the theme is the Kennedy assassination, which probably isn't as horrific to most of us as it is to our parents. People will say the joke is messed up and making fun of the assassination because of theme but what is significant is not the theme, it is the thesis which is \"hey isn't it fucked up that we use horrifying national tragedy as an icebreaker?\" The modern equivalent is asking people where they were on 9/11.\r\n\r\nThe joke uses an awful theme for an actually pretty valid thesis.\r\n\r\nNow the second joke has the theme of gang rape, and the thesis of statistics. Its a pure shock value joke and while it isn't mean spirited per se, I wouldn't accuse the person telling it of trying to tell a joke at the expense of rape victims but I can also understand if the response to the joke is \"fuck you.\"\r\n\r\nIn our society people are quicker to judge theme and never take a look at the thesis, frequently accusing something with a racist or sexist theme of having a racist or sexist thesis even if the thesis is that racism or sexism are bad, or if the thesis is completely unrelated.\r\n\r\nDjano Unchained got a bit of this, smug dipshits accusing it of racism be the word nigger gets thrown around a lot in it missing the fact that the movie is firmly on the side of the oppressed.","author":"4f41ee04945b701c41002af7"},{"id":"5320b012636872335cb90000","topic_id":"5161dd617f123bd25900013d","body":"\"@Number1pegasus\":/dis/the-time-wasting-thread/post/5320acfd63687216fe1d0000#post_5320acfd63687216fe1d0000\r\n\r\nApparently the guy can manipulate energy down to subatomic level and he is pure energy without a physical body.\r\n\r\n\r\n\"@gasmaskangel\":/dis/the-time-wasting-thread/post/5320ae9a6368720cb6e30000#post_5320ae9a6368720cb6e30000\r\n\r\nI attribute that to society always being in need to complain at something because the idea of having a boring peacful life is something scary to contemplate.","author":"4fdfbf92945b7075d50036e4"},{"id":"5320b20f6368725391650100","topic_id":"5161dd617f123bd25900013d","body":"would ciscord ally with humans if he ever founds us?","author":"5154c5237f123bcd580002fc"},{"id":"5320b270636872335c990100","topic_id":"5161dd617f123bd25900013d","body":"\"@twistedmetalero\":/dis/the-time-wasting-thread/post/5320b20f6368725391650100#post_5320b20f6368725391650100\r\n\r\n9Gag, reddit, 4chan, Tumblr, Fox News... I think we would actually scare him.","author":"4fdfbf92945b7075d50036e4"},{"id":"5320b2db63687217bcb00000","topic_id":"5161dd617f123bd25900013d","body":"\"@QuasarNova\":/dis/the-time-wasting-thread/post/5320b270636872335c990100#post_5320b270636872335c990100\r\n\r\nequestria secret weapon\r\n\r\nhumens.\r\n\r\n!http://fc04.deviantart.net/fs51/f/2009/310/8/b/John_Freeman_Saver_of_Humens_by_ChemicalAlia.jpg!","author":"5154c5237f123bcd580002fc"},{"id":"5320b32963687217bcc50000","topic_id":"5161dd617f123bd25900013d","body":"\"@QuasarNova\":/dis/the-time-wasting-thread/post/5320b012636872335cb90000#post_5320b012636872335cb90000\r\nJeez! Sounds Brutal.","author":"50c204917f123b31440000a5"},{"id":"5320b37463687217a3fe0000","topic_id":"5161dd617f123bd25900013d","body":"\"@Number1pegasus\":/dis/the-time-wasting-thread/post/5320b32963687217bcc50000#post_5320b32963687217bcc50000\r\n\r\nif we cant even stand ourselves, how can aliens stand us?\r\n\r\nunless aliens have like some sort of 8chan in their planet.","author":"5154c5237f123bcd580002fc"},{"id":"5320b37c636872178ffb0000","topic_id":"5161dd617f123bd25900013d","body":"God, I hate family.\r\n\r\nSo I write a pretty damn good forty minute essay in my Lit class and get an A minus on it. Let me remind you that in this class, as we are in deep third quarter, only _one_ person has gotten an A. All year. The teacher is picky, what can I say? I'm just happy to get my A minuses, as opposed to the regular Bs people seem to get.\r\n\r\nSo the first comment on it is that I've failed to write a thesis statement. And I'm confused, because _it's the first goddamn sentence of the essay._ Apparently I didn't give examples when I outlined what my essay would be about (probably a bad way to word it; every good student knows that you never write the sentence \"my essay is about...\"), but my understanding was that you're not supposed to outline it because that's what you're proving in the paragraph. I show it to old mum, seeing as she'd been giving me hell about getting eighty fives on quizzes for two weeks. \r\n\r\nWell, she says that I could have gotten a higher grade if I had written a thesis. And I show her where it is. She says that I didn't follow instructions. I show her the instructions. Then she says that I don't pay attention to the teacher. Of course I pay attention, I mean, I sit in the front row, I couldn't even use my phone if I tried. Forget the fact that I genuinely enjoy Lit, and she knows it. I keep saying no, and backing it up, but my mum's getting pissed.\r\n\r\nI don't know how this came about, but my mom starts yelling at me, saying that I \"have an answer for everything!\" and that I \"don't understand that teachers are a wealth of information!\" And apparently that I look at her as if she's an asshole and that I hate her and think that I'm smarter than her. What? And when I deny all of this, she starts yelling \"I'M RIGHT, I'M RIGHT, THAT'S WHAT YOU SOUND LIKE\". Uh.\r\n\r\nSo of course she starts talking about how she got a scholarship to law school and to college, and how she graduated top ten of her class, and how she didn't have tutors or a mother who paid attention to her, and I'm just sitting here like \"well, you were  fucking smart\". I mean, shit, her IQ is one point away from what qualifies as genius. _One._ She says that I don't get that there are \"smarter people in the world\" (she does realize that that's kind of the basis of my anxiety, right?) and recalls an incident from _sixth fucking grade_ where she was called down to the guidance office because I \"mouthed off\" to a teacher. Because, she said, I thought that I was smarter than the teacher. Totally not because I was friends with a bunch of snotnosed assholes whom I was trying to impress.\r\n\r\nSo then she says that I should go sit in my \"filthy\" room and throw out my teddy bears and study, and think about what I've done wrong. Didn't know I was suddenly a second grader again. And then she just huffs and says forget it and here I am, sitting in the kitchen, as she angrily slams down papers.\r\n\r\nUsually, I'd be in tears, and have her tell me that I only cry because I feel sorry for myself, but I honestly don't get what I did wrong. I concede that there are smarter people than me. That's pretty much the reason why I uncontrollably shake, and cry, and generally just don't take chances. I have an answer for everything because, well, everything she says has an answer. I'm not going to get in trouble for something I can explain, and of course I'm going to fucking disagree with her when she says shit like \"you think I'm an asshole\" and blames me for her yelling at me. I just...ugh.\r\n\r\nNobody's going to read this, but it's okay, it felt nice to just get it out there.\r\n\r\n\"@gasmaskangel\":/dis/the-time-wasting-thread/post/5320ae9a6368720cb6e30000#post_5320ae9a6368720cb6e30000\r\n\r\nI agree with all of this.","author":"5041b54f7f123b77af00a442"},{"id":"5320b486636872335c470200","topic_id":"5161dd617f123bd25900013d","body":"\"@And Brother I Hurt People\":/dis/the-time-wasting-thread/post/5320b37c636872178ffb0000#post_5320b37c636872178ffb0000\r\n\r\npeople who graduate from law school tend to be really strict with this kind of stuff believe me, they are lawyers before anything else.\r\n\r\nthey were forced to abide the law, be punctual and be perfect.\r\n\r\nto think im gonna grow to become this nihilistic(hope it means what i think it means) piece of shit scares me.\r\n\r\nmy mother used to be like this with me too, she believed anything bellow E ( a perfect was an A, and something excellent was S in our system) was pretty meh, i remember one time she became incredibly pissed at me, like trowing stuff around because i got an almost losing note ( like 1 poiny below was a failure) in some meaningless exam.\r\n\r\nbut of course with the time and my rants she figured out i coulnt be perfect in everything.","author":"5154c5237f123bcd580002fc"},{"id":"5320b52b6368724613aa0000","topic_id":"5161dd617f123bd25900013d","body":"\"@twistedmetalero\":/dis/the-time-wasting-thread/post/5320b486636872335c470200#post_5320b486636872335c470200\r\n\r\nWhat really confuses me is that we can be making jokes about how rocket ships look like penises one minute and the next I've somehow insulted her by saying the word \"penis\".","author":"5041b54f7f123b77af00a442"},{"id":"5320b5c76368721071990100","topic_id":"5161dd617f123bd25900013d","body":"\"@And Brother I Hurt People\":/dis/the-time-wasting-thread/post/5320b37c636872178ffb0000#post_5320b37c636872178ffb0000\r\n\r\nIf I told you that I went through the same stuff until recently, would you believe me? Trust me on this one, yes, I know how it feels. Yes, I know what it feels like when you show your parents an 8 (for U.S. Schools B+) and their only reply is. \"Why not an A?\". I know what it feels like when you feel proud about a grade and they feel the need to lower your moral by saying that you didn't put the effort and that you probably don't care about schoool and such.\r\n\r\nThe thing is, I started showing myself proud of that grade. If they started berating me again, I simply stated \"I did my best and I feel satisfied with this\".\r\n\r\nI know this probably will not be your case, but if you know you put the effort into passing, no scratch that, been an excellent student (beter than most of us at that age it seems), then first see your own effort and be happy with it, and let the oustide opinions fly away. Because pour parents already went through that, but your mom is not going to pay your rent tomorrow when you leave alone, ashe will not pay your taxes. All that will come from your own effort and your own work.","author":"4fdfbf92945b7075d50036e4"},{"id":"5320b68163687233bcad0200","topic_id":"5161dd617f123bd25900013d","body":"\"@QuasarNova\":/dis/the-time-wasting-thread/post/5320b5c76368721071990100#post_5320b5c76368721071990100\r\n\r\nThe thing is, she is legitimately happy when I do my best, even when it's an eighty five.\r\n\r\nIt's when those grades dare pile up.","author":"5041b54f7f123b77af00a442"},{"id":"5320b6976368725c69a20200","topic_id":"5161dd617f123bd25900013d","body":"\"@twistedmetalero\":/dis/the-time-wasting-thread/post/5320b486636872335c470200#post_5320b486636872335c470200\r\n\r\nI am a law student, and I can assure that those kinds of guys are mostly people who ust have the law as their only concile in life. Law is not an absolute that must be abide blindly, it's a set of words that can be interpreted in several ways and forms to provide the citizen a proper defense of their rights and and to expose the loopholes so that the system can be fixed and improved (This works just in paper mind you.)\r\n\r\nSo yeah, most lawyers that I was aware that were assholes, were assholes before even starting the course.","author":"4fdfbf92945b7075d50036e4"},{"id":"5320b6d463687233bcc40200","topic_id":"5161dd617f123bd25900013d","body":"i never understood why for some parents its hard to understand you cant be good with everything.\r\n\r\nmy mother would nag me a lot for bad notes in math, dispite the fact that i told her multiple times that i cant learn about math, it took about 13 years for them to understand, after they saw me 1 complete week studying for a math exam i lost.\r\n\r\n\"@QuasarNova\":/dis/the-time-wasting-thread/post/5320b6976368725c69a20200#post_5320b6976368725c69a20200\r\n\r\nwell that was kind of in old times, so i dont know much.\r\n\r\nwhat i do know is that lawyers are unforgiving, if they dont receive your work by 8 am exactly, tough luck pal, if you accidentaly damaged your work by some bullshit reason, thats not enough excuse.","author":"5154c5237f123bcd580002fc"},{"id":"5320b77463687245f06d0100","topic_id":"5161dd617f123bd25900013d","body":"Good god, some doctors really are completely clueless. Yes, obviously the sleep disorder i've struggled with for _years_ is just something i do to rebel against my parents. Perfectly logical. Now i just need to stop doing it and i'm all right again. Thanks doc!","author":"5007bbdf7f123b112f00023a"},{"id":"5320b7e26368725cea070000","topic_id":"5161dd617f123bd25900013d","body":"\"@PaskaNaakka\":/dis/the-time-wasting-thread/post/5320b77463687245f06d0100#post_5320b77463687245f06d0\r\nwhat doctor told you that?\r\n\r\ni wont believe someone telling me that unless is someone who went trough psicology in college.\r\n\r\nas for your problem, have you tried ASMR?","author":"5154c5237f123bcd580002fc"},{"id":"5320b8aa6368725c1f190000","topic_id":"5161dd617f123bd25900013d","body":"\"@twistedmetalero\":/dis/the-time-wasting-thread/post/5320b6d463687233bcc40200#post_5320b6d463687233bcc40200\r\n\r\nYeah, pretty much. \r\n\r\nBut again, that depends on \"the breed\", as I like to call it. Like the finest things in life, there lawyers who dedicate themselves to improve the system, to make it better, and along the road the grow bitter, cynical, they start to see the flaws in everything, they focus more on the black side and they ´retty much forget the reason why they studied law to begin with, just to set an example.\r\n\r\n\r\n\"@And Brother I Hurt People\":/dis/the-time-wasting-thread/post/5320b68163687233bcad0200#post_5320b68163687233bcad0200\r\n\r\nSo she's afraid of seeing you fail in school due to one grade. Considering how school works over there, it seems rather normal to think that just one bad grade can make the snowball run and hit a disaster, that's how mothers always react.","author":"4fdfbf92945b7075d50036e4"},{"id":"5320bacd6368721438c30200","topic_id":"5161dd617f123bd25900013d","body":"\"@twistedmetalero\":/dis/the-time-wasting-thread/post/5320b7e26368725cea070000#post_5320b7e26368725cea070000\r\nI think he may have been just some schmuck in a white coat who sneaked into a hospital. I refuse to believe that muppet was an actual doctor.\r\n","author":"5007bbdf7f123b112f00023a"},{"id":"5320bb826368721e8ca00000","topic_id":"5161dd617f123bd25900013d","body":"\"@PaskaNaakka\":/dis/the-time-wasting-thread/post/5320bacd6368721438c30200#post_5320bacd6368721438c30200\r\nThere are some doctors who will seriously tell you that you have a Mental illness if they slept in class the day they talked about the condition you have","author":"5062d6f17f123b3e16001184"},{"id":"5320bc2e63687267c4040000","topic_id":"5161dd617f123bd25900013d","body":"I just realized something; I'm no longer a brony.  Between hasbro suplexing any fan project, the twilicorn shit, the equestria girls drama, the equestria girls 2 drama shit and people going, \"You can't be a brony if you don't blindly love every second of it and you can't be a brony if have any portions that you aren't orgasming about\" my enthusiasm for the show popped like a air balloon ride dooming the occupants to a ten thousand foot fall to a bloody doom on the concrete.","author":"38b55cdf63616403d7560600"}]}