{"topics":[{"id":"55560a1b6368724dd3060e00","topic_id":"5161dd617f123bd25900013d","body":"\"@Thanotos Omega\":/dis/the-time-wasting-thread/post/555609436368724dd3e80c00#post_555609436368724dd3e80c00\r\nThat's cause western culture is based off of Abrahamic faiths dude and drastically are different from other cultures.  The fallacy you present is that you're thinking of culture as a monolithic singularity.\r\n\r\n\r\nTo use an analogy in the usa waving your hand at people is considered a kind gesture; in other parts of the world you'd get punched in the face for giving them the equivalent of the finger.","author":"38b55cdf63616403d7560600"},{"id":"55560aff6368722f1d310600","topic_id":"5161dd617f123bd25900013d","body":"\"And Aqualung reviewed Contra for the NES\":https://www.youtube.com/watch?v=2A7oytSlXOE \r\n!http://www.pushon.co.uk/wp-content/uploads/Konami-code-pattern.jpg!","author":"505696b47f123b37e800effa"},{"id":"55560b1863687226e1db1b00","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/55560a1b6368724dd3060e00#post_55560a1b6368724dd3060e00\r\nI'm sorry i don't follow, i don't see how not liking bigoted views of things has to do with religion,","author":"509f70a87f123b77eb0004fd"},{"id":"55560c166368725f349c0900","topic_id":"5161dd617f123bd25900013d","body":"\"@Thanotos Omega\":/dis/the-time-wasting-thread/post/55560b1863687226e1db1b00#post_55560b1863687226e1db1b00\r\nOh my god dude; you have to get into history classes.  I may sound like a huge nerd here, but it's incredibly interesting how we went from cavemen to modern era and how all these cultural things wound up being created and how religion formed modern culture.\r\n\r\nA prime example of what I mean by this is that for muslims drawing muhammad is incredibly offensive, but the majority of people in the world just outright don't get why it's offensive.","author":"38b55cdf63616403d7560600"},{"id":"55560dc66368720e608a3800","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/55560c166368725f349c0900#post_55560c166368725f349c0900\r\nBut we have comparable things, just because some fucking asshole thinks he's hot shit for spitting in other peoples eye doesn't mean the rest of us mature people can't simply say, \"There is bad history there,\" and expect others to get it, i don't have to be in a religion to understand when someone's request is harmless,","author":"509f70a87f123b77eb0004fd"},{"id":"55560edc63687226e1b12100","topic_id":"5161dd617f123bd25900013d","body":"You know what I miss? Printed publications of Shonen Jump. I used to get those all the time until VIZ cancelled the service. Now that's not to say Shonen Jump Alpha is bad, it's anything but. I just  love the feeling of holding something in my hands. Feeling the pages turn. Smelling the ink. I guess I'm the sentimental type...","author":"4fde4618945b700aa0002fff"},{"id":"55560f0f6368723dc98c0700","topic_id":"5161dd617f123bd25900013d","body":"\"@Thanotos Omega\":/dis/the-time-wasting-thread/post/55560dc66368720e608a3800#post_55560dc66368720e608a3800\r\nDude; again you're thinking that cultures are monoliths.  The reason why a lot of cultures are to some level similar is because of cultures bleeding into each other and cultural evolution.\r\n\r\n\r\nAn example of what I mean by is that the reason why cannibalism is only practiced by a couple cultures is that you can get diseases from it so of course cannibalism is looked down by the majority of the world.\r\n\r\nTo put it another way: think of cultures as like a bunch of monkeys judging whether or not they can make a jump; all the dumb ones that misjudge it go splat.","author":"38b55cdf63616403d7560600"},{"id":"55560fcc63687226e1db2200","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/55560f0f6368723dc98c0700#post_55560f0f6368723dc98c0700\r\nLook what i am saying is anyone from any culture will have some kind of taboo you can use to explain your own, so there is no reason we can't quickly explain to a comic book writer why that character is not OK, that's it,","author":"509f70a87f123b77eb0004fd"},{"id":"555610836368725f343b0e00","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/55560edc63687226e1b12100#post_55560edc63687226e1b12100\r\nNah, it's true.\r\nHolding the papers and turning the pages, the sound of the pages moving through the surface of your skin.\r\nIt feels nice.","author":"4fe1b9f47f123b13df002976"},{"id":"5556112d6368723327403200","topic_id":"5161dd617f123bd25900013d","body":"\"@Thanotos Omega\":/dis/the-time-wasting-thread/post/55560fcc63687226e1db2200#post_55560fcc63687226e1db2200\r\nThe thing is though that you're thinking that cultures are monoliths.\r\n\r\nTo point out the fallacy as succinct as humanly possible:\r\nYou believe that there's different cultures in the world correct?  For example the usa culturally is drastically from say Myanmar right?  By admitting that different places in the world can have drastically different cultures you're admitting that cultural taboos don't translate.\r\n\r\nTo make it even more succinct think of the word n****r; in other countries they just straight up don't understand why in the usa it's offensive or what it even means.","author":"38b55cdf63616403d7560600"},{"id":"5556120463687226e1cd2500","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5556112d6368723327403200#post_5556112d6368723327403200\r\nBut they have slur words that are also considered not OK, so all you have to do is point out the similarity, by your logic we can never explain what a golden delicious apple is to someone who only eats Macintosh apples, humans aren't fucking morons they understand comparisons and metaphors,  ","author":"509f70a87f123b77eb0004fd"},{"id":"555612436368723327e73300","topic_id":"5161dd617f123bd25900013d","body":"\"Uso pa ba ang harana?\"\r\n\r\nI should really make a habit of singing songs in Filipino.","author":"52f0834d63687261cba90300"},{"id":"5556129c63687226e1a52600","topic_id":"5161dd617f123bd25900013d","body":"\"@Albus Fahrenheits\":/dis/the-time-wasting-thread/post/555612436368723327e73300#post_555612436368723327e73300\r\nHow did Officer Training go Alby?","author":"4fde4618945b700aa0002fff"},{"id":"555612f06368720e60b14000","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/5556129c63687226e1a52600#post_5556129c63687226e1a52600\r\nTiring but fun.","author":"52f0834d63687261cba90300"},{"id":"555613016368724dd33b1900","topic_id":"5161dd617f123bd25900013d","body":"\"@Thanotos Omega\":/dis/the-time-wasting-thread/post/5556120463687226e1cd2500#post_5556120463687226e1cd2500\r\nThe problem is that slur words don't translate well and that cultural origins of slur words don't translate well.  In order for every culture to understand why every slur word is offensive would require every person to speak the same language and be taught history lessons into every country.\r\n\r\n\r\nThe reason why Japan constantly laughs at the usa is because of the language barrier making us all look like idiots.\r\n\r\nThink of cultures as like a animal species; each individual animal of the species represents a individual culture.  Cultural change is evolution; the species can evolve through both evolutionary pressure forcing elements of the species unable to change into death whereas surviving elements reproduce and are able to weather the new paradigm.","author":"38b55cdf63616403d7560600"},{"id":"555613386368720e60214100","topic_id":"5161dd617f123bd25900013d","body":"\"@Albus Fahrenheits\":/dis/the-time-wasting-thread/post/555612f06368720e60b14000#post_555612f06368720e60b14000\r\nGlad to hear it!","author":"4fde4618945b700aa0002fff"},{"id":"555614826368722f1d700f00","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/555613016368724dd33b1900#post_555613016368724dd33b1900\r\nthis is pointless, you are acting like those morons who take Schrodinger cat seriously, you are over complicating the simple act of people saying \"that's not cool it's like me doing this\" which yeah you can do,","author":"509f70a87f123b77eb0004fd"},{"id":"555614a66368725f34fb1200","topic_id":"5161dd617f123bd25900013d","body":"A little spot of info: \r\n\r\nKaspersky has found a group of cyberspies, calling themselves Naikon, stealing geopolitical information on the islands in and around South China Sea. Here's the dig- they speak Mandarin. Their operations has been monitored for at least 5 years. Only way for a group like that to last 5 years is if they had state backing. ","author":"52f0834d63687261cba90300"},{"id":"555615a46368723327f53800","topic_id":"5161dd617f123bd25900013d","body":"Yesterday it rained\r\n!http://m.memegen.com/r5bf7g.jpg!","author":"505696b47f123b37e800effa"},{"id":"5556183a6368723327ef3c00","topic_id":"5161dd617f123bd25900013d","body":"\"@Thanotos Omega\":/dis/the-time-wasting-thread/post/555614826368722f1d700f00#post_555614826368722f1d700f00\r\n[bq=\"Thanotos Omega\"]\"@uc9\":/dis/the-time-wasting-thread/post/555613016368724dd33b1900#post_555613016368724dd33b1900\r\nthis is pointless, you are acting like those morons who take Schrodinger cat seriously[/bq]\r\nDude; Schrodinger's cat paradox was a thought experiment for the Heisenberg's uncertainty principle about quantum uncertainty.  Don't talk about quantum physics cause I will legitimately rekt you.\r\n\r\n\"@Thanotos Omega\":/dis/the-time-wasting-thread/post/555614826368722f1d700f00#post_555614826368722f1d700f00\r\n[bq=\"Thanotos Omega\"]\"@uc9\":/dis/the-time-wasting-thread/post/555613016368724dd33b1900#post_555613016368724dd33b1900\r\nyou are over complicating the simple act of people saying \"that's not cool it's like me doing this\" which yeah you can do,[/bq]\r\nYou're oversimplifying science is the problem.  There's tons and tons and tons of science about human culture about why things to one culture are offensive whereas to another they don't see the problem why.\r\n\r\nMy point: to use an analogy the problem with your argument style is that you're oversimplifying *science*.  To use a further analogy you're like the people that go \"well if we need a magnet strong enough to warp space for faster than light travel why don't we just build one?\" and whenever I go, \"because we can't realistically control it and if we were to do so chances are we would create a subspace bubble that the crew can't escape and even if we don't kill the crew the energy shockwave from the from of the warp when slowing down would essentially shotgun a planet with pure energy thus killing all life on the planet and destroying it\" you go \"you're over-complicating it; it's not rocket science\".\r\n\r\nSociology may be a soft science, but it's still a science.\r\n\r\nTl:dr; Don't use the \"it's not rocket science\" logical argument for a science.","author":"38b55cdf63616403d7560600"},{"id":"555619616368722f1db81300","topic_id":"5161dd617f123bd25900013d","body":"Okay, I refuse to believe that a computer holding a highly advanced A.I. that can project very intricate and sophisticated holograms and apparently BEND LIGHT can be plugged into a motherfucking WALL SOCKET.\r\nSynergy is such bullshit!","author":"4fde4618945b700aa0002fff"},{"id":"55561a4c6368725f340c1900","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5556183a6368723327ef3c00#post_5556183a6368723327ef3c00\r\nOh my fucking Primus, you are that guy in every Sci-Fi horror movie who claims to be using logic but just follows a text book as the whole fucking thing goes to hell, you are literally a damn strawman, i don't know how to feel about this,","author":"509f70a87f123b77eb0004fd"},{"id":"55561a5163687226e1583100","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/555619616368722f1db81300#post_555619616368722f1db81300\r\nBending light is possible, broseph. In fact there's this experimental material that bends light making some sort of invisibility cloak.","author":"52f0834d63687261cba90300"},{"id":"55561a7863687257ebdb5800","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/555619616368722f1db81300#post_555619616368722f1db81300\r\nNope just outrageous,","author":"509f70a87f123b77eb0004fd"},{"id":"55561b0463687226e1533200","topic_id":"5161dd617f123bd25900013d","body":"Home at last\r\n\r\n!http://static.naamapalmu.com/files/3v/medium/ecjyucag.gif!","author":"5007bbdf7f123b112f00023a"}]}