{"topics":[{"id":"532503d96368724a813a0000","topic_id":"5161dd617f123bd25900013d","body":"\"@HJSDGCE\":/dis/the-time-wasting-thread/post/5323e0426368723d5f960100#post_5323e0426368723d5f960100\r\n\r\nI would create what I perceive as the perfect world. And the inhabitants wouldn't be able to complain. They wouldn't know anything else.\r\n","author":"500757fd7f123b75a90003b1"},{"id":"532504066368724d17920000","topic_id":"5161dd617f123bd25900013d","body":"There is no man,” he began, “however wise, who has not at some period of his youth said things, or lived in a way the consciousness of which is so unpleasant to him in later life that he would gladly, if he could, expunge it from his memory. And yet he ought not entirely to regret it, because he cannot be certain that he has indeed become a wise man - in search of lost time\r\n\r\nfinally found the reason i dont delete my old shitty youtube videos.\r\n\r\n","author":"5154c5237f123bcd580002fc"},{"id":"53250b8163687205de0a0100","topic_id":"5161dd617f123bd25900013d","body":"\"@twistedmetalero\":/dis/the-time-wasting-thread/post/532504066368724d17920000#post_532504066368724d17920000\r\nIn search of lost time.\r\n\r\n\r\n\r\nGoing back a couple pages about how I was talking about how neo-luddite beliefs have gained a stranglehold in politics I've been thinking about this, well as well as the wish to have the superpower to force-choke the people who argue that technology is bad(mainly cause some people have some thick ass skulls), and I realized something; the current neo-luddites in politics would have the budget to where 100% of the usa's budget goes towards things related to war and shit can education, nasa and a whole bunch of other branches of government.\r\n\r\nThe problem with that is the more I think about this knowledge truly is power.  The immediate problem with congress right now when you think about the military is \"we want shit tons of guns, *BUT* we don't actually want to spend money towards research and development cause we just want guns\".  The military already has railguns and lazers to shoot missiles out of the sky and rockets bounce off of our tanks(*disclaimer certain types of rockets, not all types of rockets) and enemies have to resort to chemical concoctions that explode under vehicles to destroy our vehicles(The achilles heel of a abrams tank is it's flat bottom).\r\n\r\nIf people are so opposed to technological development, but on the same hand want a badass military why not promote research into furthering military technology?  I mean right now we have guns that can turn enemies into a blood confetti and vaporize them completely, if someone wants a strong military wouldn't spending money towards technological advancement to the point that opposing soldiers can't harm them, but our soldiers can turn them into ground paste be towards that end?\r\n\r\nIf a country actually makes a fucking terminator it's over, arrivederci, sayonara cause no matter what war they go to they'll fucking destroy everyone and anyone that opposes them.  The reason why unmanned ground vehicles haven't taken over the battlefield yet though is that for UAV's it's simply a matter of telling it the coordinates and ordering it to fire; UGV on the other hand have to deal with a million factors and we won't see them take over war for at least another decade.\r\n\r\n\r\nTl:dr; The further I try to understand neo-luddites the more my brain hurts cause if people hate spending money on research and development but want more powerful weaponry that is when \"knowledge is power\" comes into play cause often times more advanced technology does win wars though due to that if there's a significant difference in weaponry technology one side will definitely win and the larger the difference in technological levels the more unfair the chances are stacked.\r\n\r\n*Tl:dr; of Tl:dr; Trying to understand neo-luddites is giving me a hell of a migraine.*","author":"38b55cdf63616403d7560600"},{"id":"5325155e6368721cda290100","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/53250b8163687205de0a0100#post_53250b8163687205de0a0100\r\n\r\nwell they are already researching a iron man like suit, so theres that.\r\n\r\nbut what we need already is an xcom squad.","author":"5154c5237f123bcd580002fc"},{"id":"532516866368720eea390000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/53250b8163687205de0a0100#post_53250b8163687205de0a0100\r\nThey do have a logic somewhere, when they say they want a stronger military, they think \"having more recruit and more of what we already have\" and so a stronger military isn't incompatible with the absence of technological progress.\r\n\r\nOf course, it's not the good way to run an army considering the rest of the world can potentially reach the next technological era first and made all the additional stuff you bough worthless but I don't think the possibility of a foreign power discovering something above an infomercials' products level is taken seriously by them.","author":"509129db7f123b36cb010fa5"},{"id":"5325176763687253ff1d0000","topic_id":"5161dd617f123bd25900013d","body":"did you know that sometimes i forget if i ate or not?","author":"5154c5237f123bcd580002fc"},{"id":"53252945636872100f020100","topic_id":"5161dd617f123bd25900013d","body":"\"@twistedmetalero\":/dis/the-time-wasting-thread/post/5325155e6368721cda290100#post_5325155e6368721cda290100\r\nIronically enough TALOS is probably going to bring about a era of peace funnily enough cause at that point it'll be a question of whether or not your army has enough money to either buy suits like it or have enough weaponry that's powerful enough to pierce it.  The problem here is that obviously only first world countries will be able to keep up enough to pose a threat anymore.\r\n\r\n\r\n\r\nI finally got bioshock infinite and it's just as good as everyone says it is.\r\n\r\nI did give me a random ass thought though; combining rpg games with fps games would be a pretty good potential niche of games.  Bioshock does it well with vigors/plasmids.  Bioshock does it well cause as you add in more gameplay elements/weapons that increases the chances of a combo just outright breaking the entire game.  Having a limited number of guns/weapons with basically magic attacks that you level up makes it easier to make sure you didn't screw up anywhere.\r\n\r\nHaving a pure rpg and combine it with a pure fps would be the world's crappiest game ever, but on the other hand having a limited number of abilites and weapons would be one of the best games.  It would be kind of cool to have a rock/paper/scissors system to a video game's equipment/weapons.\r\n\r\nThe only downsides is that you would have to get rid of levelling and healing spells all together; the reason being is that very few fps games with levelling systems are remotely balanced and having the ability to at the snap of your fingers heal 100% would further make it unbalanced.","author":"38b55cdf63616403d7560600"},{"id":"53258b576368722411660000","topic_id":"5161dd617f123bd25900013d","body":"\"Any thoughts on this? IMO, it looks like someone's try'na make an even more traumatizing Spec Ops: The Line. This time, from the civilians' angle. I Would still buy it though.\":www.youtube.com/watch?v=pH_tYB_Ntlg","author":"50d9a3aea4c72dc9b3000120"},{"id":"5325d9dd6368720451280000","topic_id":"5161dd617f123bd25900013d","body":"Ketchup or Catsup?","author":"4fdfbf92945b7075d50036e4"},{"id":"5325da6963687251f0560000","topic_id":"5161dd617f123bd25900013d","body":"\"@QuasarNova\":/dis/the-time-wasting-thread/post/5325d9dd6368720451280000#post_5325d9dd6368720451280000\r\nKetchup. Catsup was a spelling word on one of my tests but I'm more used to ketchup. ","author":"640bc9a16361645de1f50900"},{"id":"5325dae863687251e2800000","topic_id":"5161dd617f123bd25900013d","body":"\"@Artcast Nyans\":/dis/the-time-wasting-thread/post/5325da6963687251f0560000#post_5325da6963687251f0560000\r\nI used to pronounce catsup as \"cat soup\"","author":"5010fa077f123b1e4f00104e"},{"id":"5325e12763687274230b0000","topic_id":"5161dd617f123bd25900013d","body":"\"@someguy111\":/dis/the-time-wasting-thread/post/5325dae863687251e2800000#post_5325dae863687251e2800000\r\nI used to think catsup is another word for ketchup.","author":"4fde5cee945b700a970060fc"},{"id":"5325e37a636872123f610000","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/5325e12763687274230b0000#post_5325e12763687274230b0000\r\n...Isn't that what it is?","author":"5062d6f17f123b3e16001184"},{"id":"5325e980636872123f840200","topic_id":"5161dd617f123bd25900013d","body":"\"@trashboat\":/dis/the-time-wasting-thread/post/5325e37a636872123f610000#post_5325e37a636872123f610000\r\nUhhhh.... yeah.\r\n\r\nBut wasn't ketchup originally a type of Southeast Asian Chinese fermented fish sauce that had nothing to do with tomatoes at all, until some Americans decided to make some sort of tomato based condiment and called it _ketchup_?","author":"4fde5cee945b700a970060fc"},{"id":"5325e9ec6368720464130000","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/5325e980636872123f840200#post_5325e980636872123f840200\r\n...I'm confused now","author":"5062d6f17f123b3e16001184"},{"id":"5325f404636872556cab0000","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/5325e980636872123f840200#post_5325e980636872123f840200\r\nI think so","author":"4fe16df67f123b13e400003f"},{"id":"5325f5456368721623940000","topic_id":"5161dd617f123bd25900013d","body":"\"@trashboat\":/dis/the-time-wasting-thread/post/5325e9ec6368720464130000#post_5325e9ec6368720464130000\r\n\"@Whatevs\":/dis/the-time-wasting-thread/post/5325f404636872556cab0000#post_5325f404636872556cab0000\r\nWell, at least the term was derived from the Amoy dialect.","author":"4fde5cee945b700a970060fc"},{"id":"5325f72463687270d4580000","topic_id":"5161dd617f123bd25900013d","body":"Well fred phelps is dying.\r\n\r\nTalk about irony cause he was apparently ex-communicated from westboro baptist church and is now dying of something; probably old age though.  He was ex-communicated by the monster he created.","author":"38b55cdf63616403d7560600"},{"id":"5325f76e63687272488d0000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5325f72463687270d4580000#post_5325f72463687270d4580000\r\nWonder what made him excommunicated.","author":"513e68eda4c72d4e3b000164"},{"id":"5325f82f63687270d47f0000","topic_id":"5161dd617f123bd25900013d","body":"\"@Ore-O\":/dis/the-time-wasting-thread/post/5325f76e63687272488d0000#post_5325f76e63687272488d0000\r\nMy guess is that he realized he was starting to die of old age and looked back on his life and realized what he had done.","author":"38b55cdf63616403d7560600"},{"id":"5325f8636368725fad100000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5325f72463687270d4580000#post_5325f72463687270d4580000\r\nThat there is possibly the very definition of irony.","author":"500757fd7f123b75a90003b1"},{"id":"5325fc07636872107fa30000","topic_id":"5161dd617f123bd25900013d","body":"\"@NotYourAverageLurker\":/dis/the-time-wasting-thread/post/53258b576368722411660000#post_53258b576368722411660000\r\nWell , I'm a sucker for different points of view on a situation. So it sounds awesome.\r\n\r\nAlso possibly the biggest middle finger to the Call of Duty franchise to ever be created.","author":"500757fd7f123b75a90003b1"},{"id":"5325fccb6368723ac24e0000","topic_id":"5161dd617f123bd25900013d","body":"\"@NotYourAverageLurker\":/dis/the-time-wasting-thread/post/53258b576368722411660000#post_53258b576368722411660000\r\n[bq=\"NotYourAverageLurker\"]\"Any thoughts on this? IMO, it looks like someone's try'na make an even more traumatizing Spec Ops: The Line. This time, from the civilians' angle. I Would still buy it though.\":www.youtube.com/watch?v=pH_tYB_Ntlg\r\n[/bq]\r\nIt would probably the best game of the year.  Spec ops the line I'll admit definitely deserved to be called game of the year.  This war of mine would probably turn the fps genre on it's head.","author":"38b55cdf63616403d7560600"},{"id":"5325fe8e636872326e1c0000","topic_id":"5161dd617f123bd25900013d","body":"All this talk about realistic war shooters and spec ops reminds me of an argument I got into on Extra Credits' episode on propaganda games.\r\n\r\nFun times.\r\nApparently, according to the guy I opposed, there is no difference between Arabs in general and Hezbollah.\r\nAnd no, he was not saying what you think.","author":"4fe16df67f123b13e400003f"},{"id":"532600486368723182740000","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/5325fe8e636872326e1c0000#post_5325fe8e636872326e1c0000\r\n\r\nWas he saying they were all bomb happy psychos?","author":"500757fd7f123b75a90003b1"}]}