{"topics":[{"id":"557ba1c76368727d55001c92","topic_id":"5161dd617f123bd25900013d","body":"\"@HJSDGCE\":/dis/the-time-wasting-thread/post/557ba1276368725a7f000ebd#post_557ba1276368725a7f000ebd\r\nIn the western world sure, but in Pakistan, Iran and Saudi Arabia they still kill you for adultery and mutilate people's sexual organs.\r\n\r\nIf there ever is something like Cybermen it would probably start in Pakistan or Saudi Arabia as a movement to \"cure\" people.\r\n\r\nSomeone committed adultery?  Rip out their sexual organs.\r\nSomeone is gay?  Rip out their sexual organs.\r\nChildren converted to a different religion?  Rip out their sexual organs.\r\nChildren don't want to marry someone you arranged for them to marry?  Rip out their sexual organs.\r\n\r\nIf there was such a movement it would probably start out as a anti-adultery movement then become a anti-glbt movement then become a anti-race movement; if you remove the person's sex organs, their sexuality and their race and replaced it with metal then you got cybermen.","author":"38b55cdf63616403d7560600"},{"id":"557ba1cb6368725a7f000fb2","topic_id":"5161dd617f123bd25900013d","body":"\"@trashboat\":/dis/the-time-wasting-thread/post/557ba1a86368725a7f000f7c#post_557ba1a86368725a7f000f7c\r\nIt looks stupid.","author":"4fe1b9f47f123b13df002976"},{"id":"557ba2aa63687227f20000c2","topic_id":"5161dd617f123bd25900013d","body":"!https://41.media.tumblr.com/0e5ab8d276c1015633e7f96f9e405118/tumblr_nixc7tkUyY1u5d4c7o1_500.png!","author":"5062d6f17f123b3e16001184"},{"id":"557ba38f6368723f90000ea6","topic_id":"5161dd617f123bd25900013d","body":"CHANGE TO BEST JOJO!","author":"4fde4618945b700aa0002fff"},{"id":"557ba3d16368721ecb0006e6","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/557ba1c76368727d55001c92#post_557ba1c76368727d55001c92\r\nI think cybermen would probably be born more out of a military application than a social move. \r\n\r\nIts much more cost effective to just use a blade or bullet than shove them into metal parts.\r\n\r\n\r\n... Wow that got dark fast.\r\n\r\n-molly","author":null},{"id":"557ba49c6368723f90001074","topic_id":"5161dd617f123bd25900013d","body":"\"@Background Pony #E4FF\":/dis/the-time-wasting-thread/post/557ba3d16368721ecb0006e6#post_557ba3d16368721ecb0006e6\r\nIf you combined the two then you have a recipe for disaster.  Imagine a dictator doing that.","author":"38b55cdf63616403d7560600"},{"id":"557ba5666368721ecb000936","topic_id":"5161dd617f123bd25900013d","body":"Well, that was an awesome movie.\r\nIt's Jurassic World, in case you're wondering, uc9.","author":"5446fcfc6368723ec21a0000"},{"id":"557ba5786368721ecb000958","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/557ba49c6368723f90001074#post_557ba49c6368723f90001074\r\n\r\nKung Fuhrer","author":"4fdfbf92945b7075d50036e4"},{"id":"557ba65b6368723361000912","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/557b9e67636872405b00056c#post_557b9e67636872405b00056c\r\n[bq=\"uc9\"]\"@Background Pony #E4FF\":/dis/the-time-wasting-thread/post/557b9c7b636872404f000360#post_557b9c7b636872404f000360\r\nCall me crazy, but I still think when we eventually do have real life cybernetics something like the Borg or Cybermen might happen, but that they'll be more along the lines of every type of morality police ideology merged into one literally shoving people into surgeries to remove their race, sex, sexual organs and such.\r\n\r\nHypothetical group, \"Join Unity!  Together we will cure the world of all racial inferiority by removing your skin and remove your sexual organs to fight against sexual depravity and to stop the male gaze!\"\r\n\r\nImagine if people that are racist, homophobic, sexist and hate sex had the ability to physically remove all physical things that make us different.  I don't think it will be Cybermen or a hivemind, but rather parents forcing their children to undergo surgery to rip off their skin and their sexual organs and remove their capability to have sex or dress in ways you don't like.  After all the only way to stop your children from dating people you don't like is to physically rip out their sexual organs and rip off their skin and replace it with metal.\r\n\r\nI don't think it will be cybermen so much as extremists ripping off their children's skin and sex organs to prevent them from ever having sex or having any interest in sex or dressing in ways you deem \"wrong\".\r\n\r\nHypothetical group, \"Join Unity!  Race, sex and sexuality are diseases and we are the cure!\"[/bq]\r\nYeah... and implying that there won't be unanimous global backlash towards something like this?","author":"4fde5cee945b700a970060fc"},{"id":"557ba6e863687227f2000551","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/557ba65b6368723361000912#post_557ba65b6368723361000912\r\nDude; slavery has made a huge fucking comeback and nobody cares.  You would think something that vile making a comeback would cause a global backlash, but nope.  Unless something directly effects a country's populace for the most part the populace doesn't care.","author":"38b55cdf63616403d7560600"},{"id":"557ba78a6368723f9000157f","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/557ba6e863687227f2000551#post_557ba6e863687227f2000551\r\nWhat has humanity come down to?","author":"4fde5cee945b700a970060fc"},{"id":"557ba8d96368727c10000988","topic_id":"5161dd617f123bd25900013d","body":"At some point in their lives 1 in 6 children will be abducted by the Dutch","author":"9ba2e84e636164642cc03200"},{"id":"557baa016368723361000ec9","topic_id":"5161dd617f123bd25900013d","body":"\"@EHAN\":/dis/the-time-wasting-thread/post/557ba8d96368727c10000988#post_557ba8d96368727c10000988\r\nCurse them Dutch...","author":"4fe1b9f47f123b13df002976"},{"id":"557bad446368727c10000fd1","topic_id":"5161dd617f123bd25900013d","body":"Megggh. Whenever I look at the gamergate thread (dammit bile fascination) I want to say something, but I just know it would be like trying to talk to rather irritable brick wall. That and Im a bit of acoward/ dont want to turn the whole booru on me.\r\n\r\nI dont even care about the event, its just the seething bitter hatred and us or them stuff that eminates from it. Its bothersome. I feel like I should try to atleast to do something about it, anything, as arrogant as that sounds. But... Jeeze.\r\n\r\n*end vlog*\r\n\r\nanyway! Annnnnyone else excitd for terminator genysis. It looks really neat, just wish they disnt spoil all the twists in the trailers.\r\n\r\n-molly","author":null},{"id":"557baef3636872575e000ad6","topic_id":"5161dd617f123bd25900013d","body":"!https://36.media.tumblr.com/bf366aad3e16b1eb6be2bd759620f4fd/tumblr_ngoptvSAAy1s18jubo1_1280.png!","author":"5062d6f17f123b3e16001184"},{"id":"557bb00a6368721ecb001aff","topic_id":"5161dd617f123bd25900013d","body":"\"@Background Pony #E4FF\":/dis/the-time-wasting-thread/post/557bad446368727c10000fd1#post_557bad446368727c10000fd1\r\n\r\nIt's your opinion and regardless of whether people agree with it or not, if both sides claim to be above the witch hunter practices of the other side they will read that opinion, analyze and properly respond to it without getting angry or offended.\r\n\r\n+However+, that would mean neither side drinks the Kool-Aid when something they don't like scratches at their door and obviously that's bullcrap if I've ever seen one because even on this site, people who have said that are above certain conduits, have done exactly the opposite and pretty much flip over and yell (theoretically, what with this being text based and all.)","author":"4fdfbf92945b7075d50036e4"},{"id":"557bb0396368726f08000a77","topic_id":"5161dd617f123bd25900013d","body":"\"@Background Pony #E4FF\":/dis/the-time-wasting-thread/post/557bad446368727c10000fd1#post_557bad446368727c10000fd1\r\nYou know; I actually agree here. Gamergate is probably going to end soonish cause Gawker, the company that has been literally pumping millions of dollars to fund anti-gamergate and is pretty much considered the sjw citadel, is about to get rektasaurus rekt cause they're looking at a $100,000,000 fine which will force the CEO to either sell the company or close and I get the distinct feeling pro-gg doesn't want it to end ever.  If you take out gawker from the equation the majority of the money flowing into anti-gg/sjw goes poof overnight and people don't want it to end.\r\n\r\nI'm pro-gg, but I get the feeling that people on the pro-gg side don't want it to end cause so long as gamergate exists they have a reason to continue to exist.  If Gawker loses the court case, and they probably will, then the overwhelming majority of the money funneling into the sjw/anti-gg/3rd waver movement goes poof.  To use an analogy think of sjw-ism as like a water balloon, if gawker loses the court case and they probably will, it would be like popping the balloon.\r\n\r\nTl:dr; I'm starting to think a lot of the pro-gg side don't want anti-gg to end anymore cause then they won't have a reason to exist as a movement cause if gawker loses the court case then anti-gg/sjw/3rd wavers as a movement lose the vast majority of their money.","author":"38b55cdf63616403d7560600"},{"id":"557bb05463687227f200120f","topic_id":"5161dd617f123bd25900013d","body":"The flesh of an orange looks weird.","author":"4fde4618945b700aa0002fff"},{"id":"557bb13a6368723361001ad2","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/557bb0396368726f08000a77#post_557bb0396368726f08000a77\r\nYou said SJWs are losing. They just got reddit for crying out loud!\r\nIt seems every time we gain a footing, they seem to gain a swath.","author":"4fde5cee945b700a970060fc"},{"id":"557bb306636872575e000edf","topic_id":"5161dd617f123bd25900013d","body":"So in an effort to steer the conversation away from the political,\r\n\r\nWhen do you think slasher films are gonna make a comeback?","author":"4fde4618945b700aa0002fff"},{"id":"557bb3b86368721ecb0020f5","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/557bb13a6368723361001ad2#post_557bb13a6368723361001ad2\r\nThat's like saying that cause Neogaf is a sjw hivemind that freedom of speech is dead.  Reddit is a popular website for sure, *BUT* it's not the entire internet and only constitutes a mere fraction of the internet.  99% of the internet isn't even archived.  Sure reddit is popular, but it's nothing special at all.  Google doesn't even account for 1% of all internet traffic.  Reddit is nothing more than the modern day myspace.  The paranoia crap that social communists, such as sjw, are taking over the usa through governmental conspiracy crap needs to stop.\r\n\r\nIt would be like if San Francisco elected a communist as mayor; that would be like going \"Oh my god!  Communists are taking over the world!  We're all going to be sent to work camps and worked to death!\"  SJW are nothing more than a d-rank political interest group.  Sure they're almost all complete asshole kool-aid drinker cultists, but come on dude chill the fuck out.\r\n\r\nYes: sjw are koolaid drinkers that think anyone who isn't a believer is a evil that try to evangelize constantly, but they're the equivalent of stormfront.  Almost completely harmless in the real world.  Sure they call in bomb threats to scare people, but they're too much of cowards to actually do it.\r\n\r\nTl:dr; sjw/3rd wavers are the leftist equivalent of what stormfront is to the right.","author":"38b55cdf63616403d7560600"},{"id":"557bb3cd6368723361001ec6","topic_id":"5161dd617f123bd25900013d","body":"\"==\"Jesus Christ, this fucking gif\"==\":https://twitter.com/LandoFolf/status/609283072559857665","author":"9ba2e84e636164642cc03200"},{"id":"557bb3f56368721eb300001d","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/557bb306636872575e000edf#post_557bb306636872575e000edf\r\nI never liked slasher films.","author":"4fe1b9f47f123b13df002976"},{"id":"557bb43d63687227f200171c","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/557bb3b86368721ecb0020f5#post_557bb3b86368721ecb0020f5\r\nWe need more social media sites as backdrops at least.","author":"4fde5cee945b700a970060fc"},{"id":"557bb465636872575e001028","topic_id":"5161dd617f123bd25900013d","body":"\"@HJSDGCE\":/dis/the-time-wasting-thread/post/557bb3f56368721eb300001d#post_557bb3f56368721eb300001d\r\nI didn't really like them to start but my step-dad made me watch some of them with him. And after a while they kind of rubbed off on me. ","author":"4fde4618945b700aa0002fff"}]}