{"topics":[{"id":"531519fb63687268202f0000","topic_id":"5161dd617f123bd25900013d","body":"For anyone who goes through books very quickly, I thought I'd offer a site for you to use: \"Good Reads.\":https://www.goodreads.com It's very easy to add all the books you've read and are currently reading, lets you set a yearly goal, suggests books pretty accurately...I've only been using it for a few weeks, yet it's been pretty useful so far. \r\n\r\nJust thought I'd pass it on.","author":"5041b54f7f123b77af00a442"},{"id":"53151c7d6368726a6e320100","topic_id":"5161dd617f123bd25900013d","body":">tfw you get a Karpetshark commission slot\r\n\r\n!http://static.comicvine.com/uploads/original/11113/111136721/3521624-3708598439-9cvyi.gif!","author":"4ff4f96c7f123b7dda01f1ed"},{"id":"53152bd963687260b77a0300","topic_id":"5161dd617f123bd25900013d","body":"Well the situation in ukraine is tense, but no one is falling for the bait putin in trying and as long as no one opens fire it might turn out okay.\r\n\r\nPutin, \"Take the fucking bait!\"\r\nUkraine, \"No; we're not stupid\"\r\nPutin, \"TAKE THE FUCKING BAIT!\"\r\nUkraine, \"No; we know you're trying to bait us\"\r\nPutin, \"*TAKE THE FUCKING BAIT ALREADY!*\"\r\nUkraine, \"No; we're not going to\"\r\n\r\nShit's tense over there, but Putin is obviously not going to shoot first and ukraine isn't stupid.","author":"38b55cdf63616403d7560600"},{"id":"53152c8f63687209892e0000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/53152bd963687260b77a0300#post_53152bd963687260b77a0300\r\nUnless someone goes, \"_No Russian..._\"\r\nXD!\r\n\r\nBut seriously, I hope no one pulls anything rash. Otherwise....","author":"4fde5cee945b700a970060fc"},{"id":"53152d8863687207b1800000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/53152bd963687260b77a0300#post_53152bd963687260b77a0300\r\n\r\nthe cold war never ended, the sides just changed appearance.","author":"5154c5237f123bcd580002fc"},{"id":"53152f8463687204f6550100","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/53152c8f63687209892e0000#post_53152c8f63687209892e0000\r\n\"@twistedmetalero\":/dis/the-time-wasting-thread/post/53152d8863687207b1800000#post_53152d8863687207b1800000\r\nMore accurately the Cold War ended and a bunch of assholes really, really miss it because hate is the only thing that gives their pathetic lives meaning so now they want to restart it.","author":"4f41ee04945b701c41002af7"},{"id":"5315317f6368720989fa0100","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/53152c8f63687209892e0000#post_53152c8f63687209892e0000\r\nOn the plus side so long as ukraine doesn't take the bait this is going to fuck up putin politically.  He's already a massively unpopular president; if he fucks up here and russia faces trade sanctions then hello lame duck presidency.\r\n\r\nPeople mock trade sanctions, but if a country leader is already massively unpopular then guess who gets the blame?\r\n\r\nThe best course of action for ukraine would be to bump up elections to earlier date, have them fair and when the inevitable of putin refuses to stand down fuck russia up economically by everyone issuing sanctions against them which would fuck up putin.  Yay for passive aggressive diplomacy.","author":"38b55cdf63616403d7560600"},{"id":"5315320b63687207fd4c0200","topic_id":"5161dd617f123bd25900013d","body":"\"@gasmaskangel\":/dis/the-time-wasting-thread/post/53152f8463687204f6550100#post_53152f8463687204f6550100\r\nAlso, while China and Russia were closed to the west. We didn't have to compete with them in the job market. Now that these countries have adopted capitalism and opened themselves to trade, our jobs are going to them because of their cheaper labor force.","author":"4fde5cee945b700a970060fc"},{"id":"531533b66368720706de0200","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/5315320b63687207fd4c0200#post_5315320b63687207fd4c0200\r\nMore so China than Russia to the best of my knowledge.\r\n\r\nUnfortunately that is one of the problems where there isn't really a very good solution. The economies of the US and China are so interlinked that  it would screw things up for both of us if we make the wrong move.","author":"4f41ee04945b701c41002af7"},{"id":"531536c9636872033e840000","topic_id":"5161dd617f123bd25900013d","body":"\"@gasmaskangel\":/dis/the-time-wasting-thread/post/531533b66368720706de0200#post_531533b66368720706de0200\r\nIf one lives in excess, the other suffers poverty. That is unfortunately how things work in this world.\r\n\r\n ","author":"4fde5cee945b700a970060fc"},{"id":"531537466368720500c50000","topic_id":"5161dd617f123bd25900013d","body":"\"@gasmaskangel\":/dis/the-time-wasting-thread/post/531533b66368720706de0200#post_531533b66368720706de0200\r\nThat's why I don't think we'll ever go to war with china.\r\n\r\nPutin on the other hand is trying to make a cold war v2; the problem with this is that no one is that stupid.  Ukraine isn't going to fall for it, the EU isn't going to fall for it, nor is the usa.  He came into this with the full intention of trying to start shit.  At this point it's that the EU, usa and ukraine are trolling the fail troll.\r\n\r\nMy money is this shit is going to drag on for months after ukraine's election and it's going to fuck up putin's approval rating(not that they're good anyhow) and the next russian president will be sworn in as a extreme political swing against putin.  What I mean by that is to use a analogy is how obama won cause everyone hated bush.  If no one takes putin's bait then whoever is the next president will become president cause everyone will be hating putin.  Until then we just have to deal with putin's bloated ego trying to get attention.","author":"38b55cdf63616403d7560600"},{"id":"53153855636872035fee0000","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/531536c9636872033e840000#post_531536c9636872033e840000\r\nThe thing is, if Chinese workers weren't so poor, they could buy more and so they would either buy our products and so we'll have some jobs too or they'd buy some of their national production meaning we would have to produce more for ourselves and so still have some jobs.","author":"509129db7f123b36cb010fa5"},{"id":"5315389b63687203f46a0100","topic_id":"5161dd617f123bd25900013d","body":"Chinese workers are a lot better off than Chinese rural farmers","author":"4fe16df67f123b13e400003f"},{"id":"531538ac63687202b7160100","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/531537466368720500c50000#post_531537466368720500c50000\r\n[bq=\"uc9\"]\"@gasmaskangel\":/dis/the-time-wasting-thread/post/531533b66368720706de0200#post_531533b66368720706de0200\r\nThat's why I don't think we'll ever go to war with china.\r\n[/bq]\r\nBut if the Chinese begin to make aggressive claims and attempt to colonize Southeast Asia and Africa. That may give us reasons to go to war against them. ","author":"4fde5cee945b700a970060fc"},{"id":"531538d763687205df1b0100","topic_id":"5161dd617f123bd25900013d","body":"\"@boz\":/dis/the-time-wasting-thread/post/53153855636872035fee0000#post_53153855636872035fee0000\r\nBut that would require them to pay their workers living wages, and you know how much business owners hate paying living wages to workers.  If it weren't for how unanimously hated slavery is by people that shit would still be around and it would still be all over the fucking place.\r\n\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/531538ac63687202b7160100#post_531538ac63687202b7160100\r\nNot likely; they just want to show off their war boners lately.  They know they're too dependent on the west economically to start shit.  I don't think the situation with that island claimed by japan and china well ever reach more than a slapfight cause china knows we're buds with japan; you do NOT ever start a war with your biggest money source's BBFs.","author":"38b55cdf63616403d7560600"},{"id":"531539926368720618a20100","topic_id":"5161dd617f123bd25900013d","body":"\"@boz\":/dis/the-time-wasting-thread/post/53153855636872035fee0000#post_53153855636872035fee0000\r\n\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/531536c9636872033e840000#post_531536c9636872033e840000\r\nArguably the best thing to happen to China (or at least to Chinese workers) would be for unions to hit there in a big way.\r\n\r\nUnfortunately China is such a repressive country and the hugenormous corporations of the US are so dependent on slave wages for manufacturing/apathetic to the suffering of people an ocean away that this is unlikely to happen.\r\n\r\nTake all the bad shit the US was doing to unions at the turn of the century and turn that up to eleven and you've got China.","author":"4f41ee04945b701c41002af7"},{"id":"531539bc6368720618b90100","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/5315389b63687203f46a0100#post_5315389b63687203f46a0100\r\nThis also true and think about how fucking sad that is.","author":"4f41ee04945b701c41002af7"},{"id":"531539f663687202b79f0100","topic_id":"5161dd617f123bd25900013d","body":"\"@gasmaskangel\":/dis/the-time-wasting-thread/post/531539bc6368720618b90100#post_531539bc6368720618b90100\r\nit's no different than the industrial revolution in Europe. Being a factory worker sucked, but it was better than farming was.","author":"4fe16df67f123b13e400003f"},{"id":"53153a56636872071bbe0100","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/531539f663687202b79f0100#post_531539f663687202b79f0100\r\nYou can make a lot of comparisons between current day China and industrial revolution era Europe.","author":"4f41ee04945b701c41002af7"},{"id":"53153a7a63687203f40c0200","topic_id":"5161dd617f123bd25900013d","body":"\"@gasmaskangel\":/dis/the-time-wasting-thread/post/531539926368720618a20100#post_531539926368720618a20100\r\nAfrica is rich in untapped resources and a ton of land. Definitely fit for China, a resource hungry empire with a gargantuan population to conquer.  ","author":"4fde5cee945b700a970060fc"},{"id":"53153ab663687205dff60100","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/531538d763687205df1b0100#post_531538d763687205df1b0100\r\nI was reading somewhere that we actually had enough food for everyone on the planet without doing anything else or changing our habit at least for now.(and that was before the OGM apparition) But the poorest people of the world just didn't have enough money to buy it at a price that would cover the investment made for the farming material.\r\n\r\nAlso I'd wouldn't take the interdependence argument as a guaranty of peace, sure it may help but just before WWI they were saying the same about the European's economy.","author":"509129db7f123b36cb010fa5"},{"id":"53153c246368720519c70200","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/53153a7a63687203f40c0200#post_53153a7a63687203f40c0200\r\nThey would have to do it economically though.  Doing it through brute force would fuck up a lot of trade agreements they have.\r\n\r\n\r\nThe situation in china; what's probably going to happen in the long run is they realize that starting shit with the usa or our allies is bad for them considering how reliant we both are on each other.  In the long run what they will probably do is economically and business wise look to some impoverished middle east countries and africa for cheap labor and basically do what the usa did to them; exploit the fuck out of foreign countries for cheap labor.  You could have pretty fucking cheap merchandise using countries that don't even have access to a water source or food source.\r\n\r\nIn the long run china will start to exploit third world countries like we already do, we'll exploit them as well, everyone gets cheap labor in the end.  It's fucking horrible, but I'll admit it's a hell of a ponzi scheme.  Exploit third world countries for cheap labor and when the third world country gets enough money to lift themselves out of poverty join the \"let's exploit the poor\" club.\r\n\"@boz\":/dis/the-time-wasting-thread/post/53153ab663687205dff60100#post_53153ab663687205dff60100\r\nActually that is true actually.  We produce a fuck ton of food; it's just third world countries are too poor to afford having the food imported.","author":"38b55cdf63616403d7560600"},{"id":"53153e9363687204ac690300","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/53153c246368720519c70200#post_53153c246368720519c70200\r\nWhat China even more so needs is living space.","author":"4fde5cee945b700a970060fc"},{"id":"53153f06636872147b0f0000","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/53153e9363687204ac690300#post_53153e9363687204ac690300\r\n\r\nYa'll got the Xinjiang to the west to put people in. Just put a Las Vegas out there and be set.","author":"4fe4bf947f123b175b000001"},{"id":"53153f656368721978340000","topic_id":"5161dd617f123bd25900013d","body":"\"@AaronMk\":/dis/the-time-wasting-thread/post/53153f06636872147b0f0000#post_53153f06636872147b0f0000\r\nMacau already exists","author":"4fe16df67f123b13e400003f"}]}