{"topics":[{"id":"531540336368721587750000","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/53153f656368721978340000#post_53153f656368721978340000\r\n\r\nNah, when they're done with what I'm thinking Macau will be the Biloxi of the Chinese legal gambling world.","author":"4fe4bf947f123b175b000001"},{"id":"5315417863687218cfbb0000","topic_id":"5161dd617f123bd25900013d","body":"\"@AaronMk\":/dis/the-time-wasting-thread/post/53153f06636872147b0f0000#post_53153f06636872147b0f0000\r\nAnd Tibet.\r\nBut this is the same communist party that was led by Mao, responsible for starving millions of my kinsmen to death during the Great Leap Forward, and attempted to eradicate 5000 years of Chinese culture during the Cultural Revolution. So I don't know if I should be proud of \"Chinese\" dominance in the east... ","author":"4fde5cee945b700a970060fc"},{"id":"5315423a63687216c8be0000","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/5315417863687218cfbb0000#post_5315417863687218cfbb0000\r\nChinese dominance in the east is pretty much a joke is what I'm saying though; they'll rattle their sabers and go on about how much they want a piece of action, *BUT* at the end of the day in order for them become what they dream of being they would have to sever all economic ties with the usa and west first though.\r\n\r\nTo use a mythology analogy; Fenrir may be able to eat Odin and plunge the world into the end times, but he is powerless so long as he is chained.  By being chained he can snarl and growl, but he can't do anything.","author":"38b55cdf63616403d7560600"},{"id":"53157b2363687221224e0100","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5315423a63687216c8be0000#post_5315423a63687216c8be0000\r\nRWBY fan I see.\r\n\r\nSo Yellow confuses me a little. She's deliberately unkempt but vain? Or am I mistaken?","author":"4fe16df67f123b13e400003f"},{"id":"5315856e636872626fd20100","topic_id":"5161dd617f123bd25900013d","body":"\"At one point in time, the creators of herc’s adventures decided that they did not give a shit. They were like, Whatever, I like Star wars, And so do most people, so why don’t we just use the music from that and just change a few notes. \"That’s genius Arthur!\" said milton from the back of the room. The funny thing about this is that Milton had been dead for about 13 years. In fact, It is still a mystery how he knew Arthur’s name given that Arthur was a recent transfer from Montreal\"","author":"5062d6f17f123b3e16001184"},{"id":"5316383f6368724300b60000","topic_id":"5161dd617f123bd25900013d","body":"Yeeaahhhh, putin's fucked up.  Putin has fucked up big time.  Russia might get kicked out of the G8, is looking at trade sanctions and the usa is willing to give ukraine a loan so as to prevent russia from fucking them up economically.\r\n\r\nHe has nothing to bargain with anymore.  If he pulls the plug gas wise then the usa will just give ukraine a loan.  If he tries to pull any economic dickery he'll just get russia kicked out of the G8 and trade sanctions imposed on russia.  Even china is somewhat on our side; they want a diplomatic solution as well.  Putin has nothing left he can use.","author":"38b55cdf63616403d7560600"},{"id":"53163d5463687243f4eb0200","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5316383f6368724300b60000#post_5316383f6368724300b60000\r\nI'm shocked the US is doing anything.\r\n\r\nAlso, it occurs to me that Putin is basically a Russian NeoCon.\r\n","author":"4fe16df67f123b13e400003f"},{"id":"531640526368721195e90000","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/53163d5463687243f4eb0200#post_53163d5463687243f4eb0200\r\nIt's not just the usa; Putin has seriously pissed off everyone pretty much.  If Putin gets russia kicked out of the G8 oh boy is shit going to hit the fan politically for him.","author":"38b55cdf63616403d7560600"},{"id":"53164095636872114f070100","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5316383f6368724300b60000#post_5316383f6368724300b60000\r\n\r\nim glad atleast to see putin aint going stalin on ukraine, the old USSR countries really dont need anymore shit to deal with.","author":"5154c5237f123bcd580002fc"},{"id":"531647ce63687269c6270000","topic_id":"5161dd617f123bd25900013d","body":"\"@twistedmetalero\":/dis/the-time-wasting-thread/post/53164095636872114f070100#post_53164095636872114f070100\r\nPersonally I think his problem is that he doesn't know how to use diplomacy on any level and still thinks it's the era of stalin.  What I mean by that is he probably came into this thinking he was going to bait people into attacking then use it force ukraine to stay under their thumb.  The problem with that is you can only bait people the same way so many times until they stop taking the bait.  In other words:  Fool me once shame on you; fool me twice shame on me.  In the long run this is going to haunt russia economically and politically.","author":"38b55cdf63616403d7560600"},{"id":"5316496163687268c25d0000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/531647ce63687269c6270000#post_531647ce63687269c6270000\r\n\r\nwhat if they get fooled 3 times?","author":"5154c5237f123bcd580002fc"},{"id":"5316499263687269c68d0000","topic_id":"5161dd617f123bd25900013d","body":"I hope there will be Third World War.","author":"31bee2686368722a0df23600"},{"id":"53164c6f6368726607b70100","topic_id":"5161dd617f123bd25900013d","body":"\"@Gizoid101\":/dis/the-time-wasting-thread/post/5316499263687269c68d0000#post_5316499263687269c68d0000\r\nIf there is it will be FUCKING EVERYONE versus russia.  China is on our side this time politically.  If putin orders them to open fire then chances are it will be everyone gang raping russia militarily.  The usa alone could fuck russia up, but throw in the EU and China that war is only going to last a couple weeks.  \"Gang rape\" is the only two words that I can come up with to explain how badly russia would get fucked up if they do go to war over this.  The reason is look at how large the usa, EU and china's military force would be if we were all on the same side; now look at russia's.  Yeeaahhh, russia's going to get metaphorically raped *HARD*.","author":"38b55cdf63616403d7560600"},{"id":"53164d1463687264e81a0200","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/53164c6f6368726607b70100#post_53164c6f6368726607b70100\r\nYou... really hate Russia, isn't?","author":"31bee2686368722a0df23600"},{"id":"53164d996368726b15d90100","topic_id":"5161dd617f123bd25900013d","body":"\"@Gizoid101\":/dis/the-time-wasting-thread/post/53164d1463687264e81a0200#post_53164d1463687264e81a0200\r\nI hate putin and I hate the shit he's done to russia.","author":"38b55cdf63616403d7560600"},{"id":"53164f38636872650d8a0200","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/53164d996368726b15d90100#post_53164d996368726b15d90100\r\nAnd what affect you about the problems of Russia? Are you Murrica?","author":"31bee2686368722a0df23600"},{"id":"53164f8763687264e8e90200","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/53164c6f6368726607b70100#post_53164c6f6368726607b70100\r\nI doubt China would do anything, they just wish the whole thing settle down (they aren't quite found of mass movement no matter the reason) without damaging anyone too much. But there is a world between wishing a peaceful solution and being willing to put his military force in the balance if it goes wrong.","author":"509129db7f123b36cb010fa5"},{"id":"531650e36368725c341a0000","topic_id":"5161dd617f123bd25900013d","body":"\"@Gizoid101\":/dis/the-time-wasting-thread/post/53164f38636872650d8a0200#post_53164f38636872650d8a0200\r\nJust look at the shit he did during the olympics.  Widespread brutality towards glbt, smearing protester's blood all against the concrete, disguising widespread brutality against minority groups as \"protecting the children\" bullcrap.  That's just in the last couple of months; he's pretty much turned back the clock in russia and has pretty much undone any actual democracy.  The latest election more people voted for putin than russia's total population.  He's undone democracy in russia and has constantly worked to undo fair elections and undermine freedom of speech.  As well as closing down news stations that speak up against him.\r\n\r\nHe's scum of the earth that will paint the concrete with your blood if you support democracy is what he is.","author":"38b55cdf63616403d7560600"},{"id":"531653536368725e7edc0000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/531650e36368725c341a0000#post_531650e36368725c341a0000\r\nAnd that's all? Eh... I have see worse than him.","author":"31bee2686368722a0df23600"},{"id":"5316563f6368725daaae0100","topic_id":"5161dd617f123bd25900013d","body":"\"@Gizoid101\":/dis/the-time-wasting-thread/post/531653536368725e7edc0000#post_531653536368725e7edc0000\r\nThat was just the short version:\r\nHe has imprisoned political opponents calling them, \"clandestine enemies\"\r\nHas \"inspected\" every organization that is involved with preservation of human rights as well as organizations involved in election monitoring.\r\nCriminalized teaching of human rights violations under the premise of \"treason\"\r\nDuring the sochi olympics protesters were found to be sexually assaulted.  One person was sexually assaulted with a crowbar.\r\nThere's widespread \"suspicious\" deaths of political opponents.\r\n\r\nThe list of shit he's done goes on for pages. . . No literally, human rights watch ends it with \", etc.\"\r\n\r\nIf you're involved with the protection of individual freedoms in russia you'll get the fabulous choice of A)Being violated with a crowbar B)Go to prison or C)Just get a bullet between the eyes.","author":"38b55cdf63616403d7560600"},{"id":"531675566368725730db0200","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/5316563f6368725daaae0100#post_5316563f6368725daaae0100\r\n!http://i3.kym-cdn.com/photos/images/newsfeed/000/709/673/07e.gif!","author":"31bee2686368722a0df23600"},{"id":"53167ab76368726176950100","topic_id":"5161dd617f123bd25900013d","body":"\"@Gizoid101\":/dis/the-time-wasting-thread/post/531675566368725730db0200#post_531675566368725730db0200\r\nThe sad thing is that actually is putin's end game.  His whole end game for his political dickery is that he wants russia and the countries under it's thumb as the new super power of asia.\r\n\r\nThat's probably why he's coming so hard down on ukraine, cause if ukraine successfully breaks away from russia then that completely and utterly wrecks his plan for russia to become a global super power and all his years of political dickery were for nothing and he will just be remembered in the history books as just a massive dick.\r\n\r\nAs much as I hate Putin the best thing the international community can do right now is offer ukraine long term loans cause that will screw up putin's plan to the point you will hear him screaming profanities all the way to the moon.\r\n\r\n\r\nI personally do not think russia will actually go to war over this, cause the most likely scenario is that this shit will drag on for years with putin trying to bait a war, but in the end ukraine will join the EU and get a loan to stabilize their economy.\r\n\r\nTl:dr;  Putin has a bloated ego.\r\n99% chance of ukraine getting a loan and joining the EU\r\n.99% chance of a proxy war\r\n.01% chance of a direct war if putin has completely lost his marbles.\r\n\r\n\r\nPersonally if I was a citizen of a EU country I would totally support ukraine joining the union, cause ukraine joining would bite putin in the ass hard and he would lose a lot of political power on the international level resulting in other countries under their thumb breaking away as well.","author":"38b55cdf63616403d7560600"},{"id":"53167b8063687261be9f0100","topic_id":"5161dd617f123bd25900013d","body":"\"@Gizoid101\":/dis/the-time-wasting-thread/post/531675566368725730db0200#post_531675566368725730db0200\r\n\r\n!http://i.imgur.com/1afhMBS.gif!","author":"5154c5237f123bcd580002fc"},{"id":"53167cc16368725d69f50100","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/53167ab76368726176950100#post_53167ab76368726176950100\r\nEU would have a hard time finding money for them though, who in the world still have the ressources to execute a massive economic aid plan. I don't say little aid to improve a situation over time during long term but a really massive program to directly get a country out of a bad situation.","author":"509129db7f123b36cb010fa5"},{"id":"53167db063687260c7ae0200","topic_id":"5161dd617f123bd25900013d","body":"\"@boz\":/dis/the-time-wasting-thread/post/53167cc16368725d69f50100#post_53167cc16368725d69f50100\r\nThe usa obviously.  We've already authorized a billion dollars already for them.  Say what you will about the usa, burning through money faster than a forest fire burning through a forest is the one thing that usa's congress is good at.\r\n\r\nSuch a large long term loan has already found massive support from both parties with both republicans and democrats supporting it along with Boehner being fully behind further loans.\r\n\r\nDropping even a $35 billion loan to ukraine would pretty much pass both houses of congress virtually unopposed.","author":"38b55cdf63616403d7560600"}]}