{"topics":[{"id":"539559d16368721716040200","topic_id":"5161dd617f123bd25900013d","body":"\"@Randomosaur\":/dis/the-time-wasting-thread/post/5395591e6368721624020200#post_5395591e6368721624020200\r\nA lot of cool shit.  I'm one of those people that realize that just cause a lab isn't making robots or rockets doesn't mean science isn't being done.\r\n\r\nWhat I'm excited for is the bringing back of extinct species.  I like to think of mammoths as the initial testing; once we know it works then we can bring back other extinct species or even in case of endangered species store their dna for when we do eventually fix the environment.","author":"38b55cdf63616403d7560600"},{"id":"53955a276368721538230200","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/539559d16368721716040200#post_539559d16368721716040200\r\nI'm excited for that too. I am also excited for the possibility of creating entirely artificial species. It's a lot better than robots and shit.","author":"50b70eeb7f123b1a02000097"},{"id":"53955b666368721716840200","topic_id":"5161dd617f123bd25900013d","body":"\"@Randomosaur\":/dis/the-time-wasting-thread/post/53955a276368721538230200#post_53955a276368721538230200\r\nAren't they working on \"synthetic life\" as well?  What I mean by that is recreating how cells and such work and making it non-carbon based?","author":"38b55cdf63616403d7560600"},{"id":"53955bbf6368721624c70200","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/53955b666368721716840200#post_53955b666368721716840200\r\nI don't think so. It's mostly focused on making synthetic bacterial and yeast genomes, but I expect it to advance to plant and animal genomes in the future.","author":"50b70eeb7f123b1a02000097"},{"id":"53955eaf63687217a6c20200","topic_id":"5161dd617f123bd25900013d","body":"I like science and all, but I can't understand most of what's above me. ","author":"4fe1b9f47f123b13df002976"},{"id":"53955f92636872169a770300","topic_id":"5161dd617f123bd25900013d","body":"\"@HJSDGCE\":/dis/the-time-wasting-thread/post/53955eaf63687217a6c20200#post_53955eaf63687217a6c20200\r\nIf you don't understand words like \"genome\", you should go back to high school science glass.","author":"50b70eeb7f123b1a02000097"},{"id":"5395619563687216ffb30300","topic_id":"5161dd617f123bd25900013d","body":"\"@Randomosaur\":/dis/the-time-wasting-thread/post/53955f92636872169a770300#post_53955f92636872169a770300\r\nI took the technical course.\r\n(No biology or anything related to such)","author":"4fe1b9f47f123b13df002976"},{"id":"539566856368722c8fd00000","topic_id":"5161dd617f123bd25900013d","body":":\\\r\nI'm kind of saddened by this revelation, but a leader on feminism \"Karen DeCrow\" died and you know the sad thing?  Before she died she said she wasn't about trying to get equal rights for women; she wanted money from lawsuits.\r\n\r\nI wouldn't call it news or anything of the sort; rather it's kind of disappointing that this confirms that trying to \"obtain equal rights\" is no longer about actually trying to better other's lives.  It's not disappointing in the traditional sense, but rather disappointing in that most movements for bettering other's lives are now about money than anything.","author":"38b55cdf63616403d7560600"},{"id":"53956bd363687211767f0300","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/539566856368722c8fd00000#post_539566856368722c8fd00000\r\nFeminists don't want women to have equal rights to men. They want women to have more rights than men.","author":"50b70eeb7f123b1a02000097"},{"id":"53956e5b636872448f740000","topic_id":"5161dd617f123bd25900013d","body":"\"@Randomosaur\":/dis/the-time-wasting-thread/post/53956bd363687211767f0300#post_53956bd363687211767f0300\r\nAM I THE ONLY ONE AROUND HERE THAT ACTUALLY BELIEVES PEOPLE DESERVE TO BE TREATED EQUALLY?\r\n!http://i1.kym-cdn.com/photos/images/original/000/352/151/8de!","author":"38b55cdf63616403d7560600"},{"id":"53956ecc63687231d29e0000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/53956e5b636872448f740000#post_53956e5b636872448f740000\r\nYES.\r\n\r\nChild molesters should not be considered people. Anyone who thinks otherwise is a child molester themselves.","author":"50b70eeb7f123b1a02000097"},{"id":"5395702c63687227fca30100","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/53956e5b636872448f740000#post_53956e5b636872448f740000\r\nDrop the gun , Mickey Mouse.\r\nNo need to pointlessly shoot at bowling balls.\r\n\r\nAnd no, I too believe that people despite gender should be treated equally.\r\nMostly those in the middle or lower classes are being gender discriminated.\r\nAnd the ones who can fix that focuses on the parts where they have influence, afraid of going out of their comfort zone to gain more ground.\r\nAnd then there are those who protest or support for their own gain, either by sexists or feminists.","author":"4fe1b9f47f123b13df002976"},{"id":"539570af6368723237580100","topic_id":"5161dd617f123bd25900013d","body":"\"@Randomosaur\":/dis/the-time-wasting-thread/post/53956ecc63687231d29e0000#post_53956ecc63687231d29e0000\r\nThat falls under fair and equal treatment under the law.  Right now a lot of crimes have double standards and have extremely biased against the victim.\r\n\r\nThere's been three occasions a different child molesters have raped people I've known and all three of them got off scot clean cause the cops are fucking useless and our court system is a joke.  Rape someone and chances are you'll get off clean. . . Side note: that's not a joke either; for every reported rape case there's far more and contrary to popular belief it's not just women that are raped, but men as well(Also another side note: if you count prison rape then actually men are raped more annually than women).\r\n\r\nAmerica's court system summarized in one sentence, \"Rape a kid free skies for you; smoke pot get twenty years\"\r\n\r\nNo offence to any cops on here, but you guys are useless cause I've seen instances where cops have walked in on people beating the shit out of their spouse only for the cops to go \"lol not enough evidence\".","author":"38b55cdf63616403d7560600"},{"id":"539571796368722627d80200","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/539570af6368723237580100#post_539570af6368723237580100\r\nAww... Don't blame the cops.\r\nBlame the fucking system that make the cops useless.","author":"4fe1b9f47f123b13df002976"},{"id":"5395720e63687231e57c0100","topic_id":"5161dd617f123bd25900013d","body":"\"@HJSDGCE\":/dis/the-time-wasting-thread/post/539571796368722627d80200#post_539571796368722627d80200\r\nI'm not blaming them; like you said it's the system and it's total bullshit.","author":"38b55cdf63616403d7560600"},{"id":"53957257636872353b670300","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/539570af6368723237580100#post_539570af6368723237580100\r\nSeriously?\r\n\r\nWow, in America I could murder a million people in front of the government and state police and they would think there wasn't enough evidence of my guilt.","author":"50b70eeb7f123b1a02000097"},{"id":"53957489636872353b420400","topic_id":"5161dd617f123bd25900013d","body":"\"@Randomosaur\":/dis/the-time-wasting-thread/post/53957257636872353b670300#post_53957257636872353b670300\r\nThe only thing the usa's government seems to care about is pot and whether or not someone's having buttsex.","author":"38b55cdf63616403d7560600"},{"id":"5395a93a6368720746ea0200","topic_id":"5161dd617f123bd25900013d","body":"Some of the stuff that happens in America that people get away with is just stupid.\r\nSeriously, over here, half the stuff that happens WOULD NOT FLY. You know that story about the person who sued the family of a kid they ran over for mental anguish? They would to told to f*ck off over here.","author":"515ddf93a4c72d8a1f000d57"},{"id":"5395b3ab63687262d8040300","topic_id":"5161dd617f123bd25900013d","body":"OK, all I want you guys to do is look at this image...\r\n!http://derpicdn.net/img/2013/12/8/492978/large.jpg!\r\n\r\nAnd know that those characters are from this.\r\n!http://25.media.tumblr.com/722439f0c40cb20d69343f70811c5bb3/tumblr_mxhmnxi0eC1reycyno2_1280.jpg!\r\n\r\nSo, what are your thoughts?","author":"4fe1b9f47f123b13df002976"},{"id":"5395b5d963687262d82a0400","topic_id":"5161dd617f123bd25900013d","body":"\"@HJSDGCE\":/dis/the-time-wasting-thread/post/5395b3ab63687262d8040300#post_5395b3ab63687262d8040300\r\nThat Sweetie is about to repress some memories.","author":"4f41ee04945b701c41002af7"},{"id":"5395dc6a636872053b7f0500","topic_id":"5161dd617f123bd25900013d","body":"\"@HJSDGCE\":/dis/the-time-wasting-thread/post/5395b3ab63687262d8040300#post_5395b3ab63687262d8040300\r\nShe's lucky she didn't turn back.\r\n\r\nSo, if you ate a Devil Fruit, what power would you get and why?","author":"513e68eda4c72d4e3b000164"},{"id":"5395e2506368722a50240400","topic_id":"5161dd617f123bd25900013d","body":"\"@Ore-O\":/dis/the-time-wasting-thread/post/5395dc6a636872053b7f0500#post_5395dc6a636872053b7f0500\r\nI want the power of bubbles.\r\nJust bubbles.\r\n\r\nLet me describe it One Piece style.\r\nWith the Awa-Awa No Mi, I can produce bubbles from any part of my body. These bubble are under my control, meaning I can control them from a distance.\r\n\r\nThe bubbles can be altered which can give adverse effects. I can make the bubble explode, acidic enough to melt through iron, protect me from the pressure of the deep sea or even stop high velocity objects or impacts.\r\n\r\nHere's a list of attacks:\r\n1) _Rapid Foam_\r\n- I send out lots of bubbles from my hands (much like how you were to blow bubbles really fast) to stop incoming bullets or even as explosive traps.\r\n2) _Ball Bubble_\r\n- I cover myself in a giant bubble, just enough to fit me. The bubble can protect me from attacks or even bounce my way out to escape.\r\n3) _Bubble Gauntlet_\r\n- I cover my hands with two medium sized bubbles. They work the same way as Ball Bubble, only smaller and focused on my hands.\r\n4) _Deep Sea Diver_\r\n- I create a bubble armor to dive into deep oceans, making travel to Fishman Island easier and the ability to fight underwater.\r\n5) _Eye Balloon_\r\n- I use my bubble as a balloon and fly me up. The string is made of a hard latex-like material which makes my bubbles.\r\n6) _Bouncy Ballista_\r\n- I pull a bubble and shoot it at enemies like a slingshot. They can be made acidic or explosivefor extra damage.\r\n7) _Clear Orb_\r\n- Similar fashion to \"Ursus Shock\":http://onepiece.wikia.com/wiki/Nikyu_Nikyu_no_Mi except that the bubble expands to its maximum size first, then explodes. This destroys everything within the bubble and creates damage outside of the bubble, except for the user (me).","author":"4fe1b9f47f123b13df002976"},{"id":"5395e78e6368720393550100","topic_id":"5161dd617f123bd25900013d","body":"\"@Ore-O\":/dis/the-time-wasting-thread/post/5395dc6a636872053b7f0500#post_5395dc6a636872053b7f0500\r\nI want the power of chaos; not the traditional stereotype of \"evil\" kind of chaose, but the ability to make anything unpredictable to any extremes.\r\n\r\nI would totally abuse it and not in the evil sense, but rather the chaotic neutral/chaotic good sense.\r\n\r\nSomeone's a total asshole that gets anything and everything they want all the while exploiting others?  Yog-Sothoth the elder god comes into our universe and starts literally raping your mansion with his glowing sphere dicks.\r\n\r\nI would so love to see someone explaining that to the cops of what happened to their house:\r\n\"I'm not crazy police officer!  Some giant blob of spheres was humping my house and jizzed all over it!\"\r\n\"Suuuurrrreeee buddy. ~Code: looney bin; we're going to need a straight jacket here stat~\"\r\n\r\nIt would make the news far more interesting.","author":"38b55cdf63616403d7560600"},{"id":"5395f3416368720d0c520500","topic_id":"5161dd617f123bd25900013d","body":"\"@Ore-O\":/dis/the-time-wasting-thread/post/5395dc6a636872053b7f0500#post_5395dc6a636872053b7f0500\r\n\r\nI would rather keep my swimming skills, but if I have to choose, I want the logia water fruit\r\n","author":"4fdfbf92945b7075d50036e4"},{"id":"5395f86263687223dcd00000","topic_id":"5161dd617f123bd25900013d","body":"I'M BACK PETS!","author":"4fde4618945b700aa0002fff"}]}