{"topics":[{"id":"5332516863687223dca70100","topic_id":"5161dd617f123bd25900013d","body":"\"@Gizoid101\":/dis/the-time-wasting-thread/post/53324ec3636872228b7f0000#post_53324ec3636872228b7f0000\r\n\r\nPues ahora tendrás que ahorrar para el boleto también.","author":"4fdfbf92945b7075d50036e4"},{"id":"533251c3636872224e9e0100","topic_id":"5161dd617f123bd25900013d","body":"\"@QuasarNova\":/dis/the-time-wasting-thread/post/5332516863687223dca70100#post_5332516863687223dca70100\r\n\r\nPero si solo quiero matar pajaros :/","author":"31bee2686368722a0df23600"},{"id":"533253676368727e32ce0000","topic_id":"5161dd617f123bd25900013d","body":"\"@Gizoid101\":/dis/the-time-wasting-thread/post/533251c3636872224e9e0100#post_533251c3636872224e9e0100\r\n\r\n........\r\n\r\nUn rifle de diabolos es fatal y cuesta menos. No balines, diabolos. Esos estan hechos de plomo.","author":"4fdfbf92945b7075d50036e4"},{"id":"533270376368726439550000","topic_id":"5161dd617f123bd25900013d","body":"Pardon me for a second, and normally I don't complain about my personal life, normally I complain about vidja games or putin put-in his -dick- ego into other countries or politics, but I am so glad to be moving in I think a month and a half(need to check the calendar).\r\n\r\nWhy?  I have officially gotten fucking tired of my mom.\r\n\r\nWhy?  Aren't you supposed to love your mom and recognize that they raised you?\r\nWell of course, but she's over the last ten fucking years has driven me up the fucking wall.\r\nPrime example:  I'm bi and trans, she says she's \"accepting\" of it, but for five years every single day in and day out multiple times a day would complain she doesn't have more grandchildren, she has 7 already, and would constantly make me feel like shit and make me feel like less of a person for not popping out kids like a pez dispenser.  Apparently that's my sole reason for existing.\r\n\r\nAlso she says she's \"accepting\" of me being bi and even though I like women way more often she lays down like thirty rules of who I'm \"allowed\" to date when it comes to guys; spoiler the only guys I'm \"allowed\" to date are exact clones of the type of guy she likes so if I date a guy who is not stereotypical in any way and has never gotten in trouble with the cops ever not good enough it \"*HAS*\" to be a stereotypical southern guy who goes to bars and talks about football.\r\nShe says she's \"accepting\" of me being trans, but ever since I've moved her I can't even so much as talk to her about it without her going, \"well thanks for making me feel bad as a parent\" or talking about how \"handsome\" I am saying, \"well couldn't you try stop being transgender?\"(fortunately this one I haven't heard in a while).\r\n\r\nThat's just the tip of the iceberg.\r\nShe's absolutely neurotic.\r\nEvery time she comes home she complains that I touched the ac, but I never do, and complains I use too much electricity(only really use my computer cause I'm not bothered by the dark); complains the house is dirty(clean it top to bottom and is clean, but even if it's sparkling she says it's not good enough.  I've worked as a janitor several times before, when I clean it's clean enough to eat food off the floor); freaks out when I drive to the point she's almost gotten me into potentially fatal car crashes twice cause she pretty much demands that I react to her first instead of other cars and gets pissed off when I brake first; gets pissed off when her cats go outside and I don't know where they are(they're cats); has nervous breakdowns when the cats are out too long and gets pissed at me(again cats); gets angry when she gives contradictory orders and that I can't follow both; gets angry when I want to be alone; gets angry when I point out she's wrong about something and then proceeds to try to make me feel like shit; gets angry when I'm upset cause to her I'm *ALWAYS* supposed to be happy happy happy happy happy 24/7 all the time; gets upset when she says how smart I am to get me to help her with something then I prove that I'm smarter than her at something; gets upset when I politely move out of the way for people or open doors for people then say I should have gone first and when I do go first gets upset that I didn't open the door for them; complains that I don't have a lot of stuff(I wouldn't call myself a non-materialist, just not interested in buying tons of crap) then on the same token complains that I spend too much money.\r\n\r\nAlso if she found out that I'm not christian chances are she would probably flip the fuck out and I would probably need to call the cops.\r\n\r\nOh and she's fucking rude to every man.  That has to do with her abusive ex, but the problem is that she treats EVERY man as her ex.  I've even brought it up to her how she's rude and her response is \"I'm getting over it\"; it's been four years and she still says profanities and practically yells at them.  Not everyone is her ex, but she treats *every* man as though they're evil and out to hurt her.  You could have the dalai lama sitting next to her and her immediate thought process would be, \"he is a man therefore he is evil cause all men are evil\".\r\n\r\nI've tried to help her get over her trauma, but the thing is she doesn't want to get over her trauma and stop acting like such a ass; all she wants to do is treat everyone like shit and whenever you call her out on it go, \"you're hurting my feelings\".\r\n\r\n\r\nTl:dr; Sorry for long post, but sometimes you just need to get something off your chest that's not related to video games and I'm just emotionally exhausted to the point I can't wait to leave.","author":"38b55cdf63616403d7560600"},{"id":"533272866368723c362e0000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/533270376368726439550000#post_533270376368726439550000\r\nAhhh family. Can't live with them, -can't bludgeon them with a tire iron- can't live without them. Good luck with your move! Sounds like it will be best for all involved.","author":"4f41ee04945b701c41002af7"},{"id":"5332746b63687259bc660000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/533270376368726439550000#post_533270376368726439550000\r\n\r\nIf it makes you feel better. I not only read all that, but I know what is like to have a family member like that.\r\n\r\nThe only thing I can tell you is that you learn to put this behind. Your mom is not going to live with the consequences of your decisions and she needs to realize that the path that you crave is not going to he the one she wanted because that's how life works, it changes at the drop of the hat and every plan you had suddenly needs to change and you just adapt to it and roll with it.\r\n\r\nJust live your life the way you want and be proud of that.","author":"4fdfbf92945b7075d50036e4"},{"id":"533278556368725cb4500000","topic_id":"5161dd617f123bd25900013d","body":"\"@QuasarNova\":/dis/the-time-wasting-thread/post/5332746b63687259bc660000#post_5332746b63687259bc660000\r\nTo be honest I now that, I've been through a lot in my life so far *. . .* I mean *a lot* and that's pretty much what I plan on doing and do anyways.  If there's anything I've learned from everything it's that well for one \"don't be a asshole\" is one of the universal commandments that everyone should follow regardless of their beliefs and that two don't let people decide what's best for you.\r\n\r\nI'm one of those people that if the phrase, \"what doesn't kill you makes you stronger\" was literal I could break diamond with my hands.","author":"38b55cdf63616403d7560600"},{"id":"533278da6368725f174f0000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/533278556368725cb4500000#post_533278556368725cb4500000\r\n\r\nThat's the spirit, and hey, look in the bright side. You will be felree to date Whatevs xD","author":"4fdfbf92945b7075d50036e4"},{"id":"5332839063687233f1210000","topic_id":"5161dd617f123bd25900013d","body":"\"@QuasarNova\":/dis/the-time-wasting-thread/post/533278da6368725f174f0000#post_533278da6368725f174f0000\r\nHe's not sassy enough to be my type.\r\n\r\nSo playing F3 again. For research on comparisons to New Vegas.\r\nGoong to list them here, they are subjective-ish.\r\n\r\nMy progress: first chapter of Survival book quests done,\r\nBomb disarmed, Burke dead, current objective: go to Galaxy News Radio.\r\nCurrent activity: picled fight with raiders in Bethesda building to steal their weapons, moved south past the Chryslus building through Grayditch (did quest) towards Operation Anchorage place.\r\n\r\n^just so you know where I am.\r\n\r\nI've forgotten a lot of the pros and cons in my head sadly\r\n\r\n-pros (relative to NV)\r\nWasteland looks cooler\r\n\r\n-neither pro nor con\r\nStructure and layout is better for fuckin around right off the bat whereas NV guided you to Vegas and then let you go off the rail (through design, not by force so not really an issue for NV, just different)\r\n\r\n-cons\r\nVATS seems to longer too long onto a killed enemy (which is annoying and lets other enemies come in to attack me)\r\nEnemy AI seems to be inferior, at least in sneak detection. Killed one raider in the supermarket and the raider 5 feet away did not get alerted in any way. Killed two super mutants standing right in front of one another and neither responded to the death of the other (two headshots)","author":"4fe16df67f123b13e400003f"},{"id":"5332c4ab63687220ed070000","topic_id":"5161dd617f123bd25900013d","body":"reading all these people´s problems and their hard lifes makes me feel like complete shit cause my life was good, except for a strick-with-califications mom.","author":"5154c5237f123bcd580002fc"},{"id":"5332fcdb6368722499c10200","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/533270376368726439550000#post_533270376368726439550000\r\nI know how you feel.\r\nIn fact, it's very similar (not too similar though).\r\n\r\nMy family and friends believe that I'm Muslim, but in truth I'm more of a deist. It's hard and stressful to live a 'double life' and it's just worst that you can't tell anyone cause everyone I know would probably freak out and lose respect and trust in me.\r\n\r\nI can tell you guys cause you have no idea who the hell I am in real life.\r\n\r\nI'm also bi. Not trans, just bi. I'm confused with this feeling though, so I prefer to be alone, which my mom totally hates. So what if I don't want to go dating and stuff?! Love is not part of my agenda and I'm not planning to find my 'other half' either.\r\n\r\nThough if I ever do find my 'other half', then the terms of religion and marriage is just going to make it a living hell instead of 'the best day ever'. Since I'm actually a deist, I don't want my 'other half' to change religion or stuff. Plus, the idea of religion and children just makes it worst.\r\n\r\nYou might think this has nothing similar with your problem, but imagine this for a Muslim. A MUSLIM. They practically disown you if you change religion. In some countries, they even give you a death sentence. In mine, the government will never let you change religion on paper under ANY reason. \r\n\r\nWow, just talking about this makes my life look a whole lot worst than how I imagine it.\r\n\r\nCurrently, I can only think of one way to solve this problem. Get a job at a foreign country, not talk to anyone I'm related to, send letters without a return address, probably in a few years or so I'll talk to them again to prove that I'm not dead or hate them.\r\n\r\n(That feels so good to let all that out. I'm starting to get emotional)","author":"4fe1b9f47f123b13df002976"},{"id":"53331cfb6368721c9d840200","topic_id":"5161dd617f123bd25900013d","body":"\"@HJSDGCE\":/dis/the-time-wasting-thread/post/5332fcdb6368722499c10200#post_5332fcdb6368722499c10200\r\nSometimes I wonder if mainstream religions actually have as many people as they claim to have or if they're just padding their numbers.\r\n\r\nAre there really 2 billion christians, 2 billion muslims, 1 billion hindi, 1 billion buddhists(I know it's more of a philosophy people) or are these groups just bullshitting to make it seems as though they have more than they actually do?  To me I smell bullshit in the air when a group claims to have billions of members.","author":"38b55cdf63616403d7560600"},{"id":"53331ea96368721d851a0300","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/53331cfb6368721c9d840200#post_53331cfb6368721c9d840200\r\nI don't doubt that there are 2 billion people who claim christianity as their religion. It is generally not a good thing to be an out and proud atheist anywhere in the world, except maybe Sweden. Society expects people to at least make a claim of faith, even if when you actually examine the faith of the person making the claim it turns out to just be some sort of vague belief that everything turns out for the best somewhere.","author":"4f41ee04945b701c41002af7"},{"id":"533322746368720c40600000","topic_id":"5161dd617f123bd25900013d","body":"\"@gasmaskangel\":/dis/the-time-wasting-thread/post/53331ea96368721d851a0300#post_53331ea96368721d851a0300\r\nSpeaking of which I was reading pewresearch and they've actually looked into this before.  About a third of people who claim to be religious have never attended religious functions/hasn't done so in years and to them religion is not important whatsoever and so forth; draw your own conclusion.\r\n\r\nThat would be the ultimate troll for someone to do, make a scale of religious adherence where the very bottom of adherence where individuals neither believe nor practice it are excluded and have it as a random sampling poll of thousands of people.  Imagine how many people would be pissed off at you.","author":"38b55cdf63616403d7560600"},{"id":"5333281c6368720f83d40100","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/53331cfb6368721c9d840200#post_53331cfb6368721c9d840200\r\n\r\nyou only need to remember the crusades and the colonies in order to believe there is in fact, 2 billion christians, maybe more.","author":"5154c5237f123bcd580002fc"},{"id":"53332d976368725d8b2d0000","topic_id":"5161dd617f123bd25900013d","body":"\"@twistedmetalero\":/dis/the-time-wasting-thread/post/5333281c6368720f83d40100#post_5333281c6368720f83d40100\r\nWhat I mean by this is babies are counted and individuals are counted by merely being the offspring of a religious couple.  If you're atheist and your parents are christian surveys count you as the same religion as your parents anyhow unless you directly state otherwise.\r\n\r\nSee how biased polling in that case can be?\r\n\r\nThat would be like going into a room of a hundred people and going, \"Okay we're going to count every last person here as (insert religion) unless you raise your hand.  So if you're of a different religion or not religious raise your hand\"","author":"38b55cdf63616403d7560600"},{"id":"53332ee86368725acf520000","topic_id":"5161dd617f123bd25900013d","body":"\"Bethesda, Maryland\":https://upload.wikimedia.org/wikipedia/commons/2/21/Intersection_in_Bethesda%2C_Maryland.jpg is like a mini DC.","author":"4fe4bf947f123b175b000001"},{"id":"533385fc63687201fe2f0000","topic_id":"5161dd617f123bd25900013d","body":"Going off the topic of religion here's a bit of news:\r\nCasual games like iphone games and such are dying hardcore financially right now and indie games are one of the reasons.\r\n\r\nHow?  Why?  Phone gaming was always a niche group that only accounts for 10% of the money and due to overspeculation there's too many casual games now.  A prime example of this is King games; they lost 500 million when they went to the stock market.  Why?  Too many iphone games and such and not enough of a profit is being generated.  Why?  Due to technological advances app games are super easy to make so there's not enough money to go around.\r\n\r\nCasual gaming companies are suffering a massive crash right now because of two reasons, one they aren't getting enough money to continue operating or even pay their employees and two fold indie games ran straight through the wall going \"OH YEAH!\", casual games were completely caught off guard and got wrecked.\r\n\r\nTl:dr; Massive overspeculation strikes again\r\n\r\n\r\nPs. It's not that tablet or phone gaming isn't generating lots of money though; there just isn't enough money to go around vs how much competition they have.","author":"38b55cdf63616403d7560600"},{"id":"533389d46368727283220000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/533385fc63687201fe2f0000#post_533385fc63687201fe2f0000\r\nCan't say I'm really surprised. Banking on non gamers killing time with stupid apps was always a stupid strategy.","author":"4f41ee04945b701c41002af7"},{"id":"53338ad063687238310c0000","topic_id":"5161dd617f123bd25900013d","body":"\"@gasmaskangel\":/dis/the-time-wasting-thread/post/533389d46368727283220000#post_533389d46368727283220000\r\n\r\ndont forget the fact its so easy to create clones of said games, and because of stupidity, that clone will probably get more downloads than the original.\r\n\r\ncant believe how many \"angry grandma\" or \"zombie killing\" clones have been created, worse how much of them make it to the top games.\r\n\r\npc mustard race strikes again.","author":"5154c5237f123bcd580002fc"},{"id":"53338afa63687272a22c0000","topic_id":"5161dd617f123bd25900013d","body":"\"@twistedmetalero\":/dis/the-time-wasting-thread/post/53338ad063687238310c0000#post_53338ad063687238310c0000\r\nClones, eh?\r\nTwo words.\r\n*FLAPPY. BIRD.*\r\n\r\n>pc mustard race strikes again.\r\nI know you were joking, but I could rant for hours about PC Gamers.","author":"515ddf93a4c72d8a1f000d57"},{"id":"53338bbc63687246231b0000","topic_id":"5161dd617f123bd25900013d","body":"\"@ThatRandomGuy42\":/dis/the-time-wasting-thread/post/53338afa63687272a22c0000#post_53338afa63687272a22c0000\r\n\r\nah yes, flappy bird is the epitomy (at the moment) of human lazyness, human gullibleness and human amoralness","author":"5154c5237f123bcd580002fc"},{"id":"53338bee636872446b2b0000","topic_id":"5161dd617f123bd25900013d","body":"\"@ThatRandomGuy42\":/dis/the-time-wasting-thread/post/53338afa63687272a22c0000#post_53338afa63687272a22c0000\r\n\r\ni could rant for days about console gaming, but i cant because im bluffing.\r\n\r\n!http://i.imgur.com/me4tJ6I.jpg!","author":"5154c5237f123bcd580002fc"},{"id":"53338c1363687245ce2a0000","topic_id":"5161dd617f123bd25900013d","body":"\"@twistedmetalero\":/dis/the-time-wasting-thread/post/53338bee636872446b2b0000#post_53338bee636872446b2b0000\r\nEh?","author":"515ddf93a4c72d8a1f000d57"},{"id":"53338c7a6368723a35480000","topic_id":"5161dd617f123bd25900013d","body":"\"@ThatRandomGuy42\":/dis/the-time-wasting-thread/post/53338c1363687245ce2a0000#post_53338c1363687245ce2a0000\r\n\r\nare you canadian?","author":"5154c5237f123bcd580002fc"}]}