{"topics":[{"id":"537baa1363687255c4900300","topic_id":"5161dd617f123bd25900013d","body":"\"FALSE!\":http://www.fstdt.com/QuoteComment.aspx?QID=41667&Page=2 ","author":"50b70eeb7f123b1a02000097"},{"id":"537baa6363687256b9e30300","topic_id":"5161dd617f123bd25900013d","body":"\"@Randomosaur\":/dis/the-time-wasting-thread/post/537baa1363687255c4900300#post_537baa1363687255c4900300\r\nI honestly don't know what to say to that...","author":"4fde4618945b700aa0002fff"},{"id":"537baadc6368725729c40200","topic_id":"5161dd617f123bd25900013d","body":"\"@trashboat\":/dis/the-time-wasting-thread/post/537ba82f6368725385630200#post_537ba82f6368725385630200\r\n\r\nlol well... Kuuga and Decade are really the most powerful Kamen Riders of all.","author":"5239db6da4c72d22d9000358"},{"id":"537bab70636872589b850300","topic_id":"5161dd617f123bd25900013d","body":"\"@Shadow_the_Hedgehog\":/dis/the-time-wasting-thread/post/537baadc6368725729c40200#post_537baadc6368725729c40200\r\nBlack RX is more OP then Kuuga (At least Kuuga lost a few times from what I've heard)","author":"5062d6f17f123b3e16001184"},{"id":"537bac936368725712870400","topic_id":"5161dd617f123bd25900013d","body":"\"@trashboat\":/dis/the-time-wasting-thread/post/537bab70636872589b850300#post_537bab70636872589b850300\r\n\r\nBut then, Decade is more OP than Black RX. He can transform into any previous Kamen Rider and use their powers.","author":"5239db6da4c72d22d9000358"},{"id":"537bad5a63687258cb570400","topic_id":"5161dd617f123bd25900013d","body":"\"@Shadow_the_Hedgehog\":/dis/the-time-wasting-thread/post/537bac936368725712870400#post_537bac936368725712870400\r\nI know, Decade goes straight past OP into Pure Hax","author":"5062d6f17f123b3e16001184"},{"id":"537bad826368725368df0400","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/537ba94963687252fb110300#post_537ba94963687252fb110300\r\nThe next couple of years we're looking at a massive paradigm shift when it comes to computers, software, video games and such.\r\n\r\nI know I sound like a fanboy, but it's a good example; when SteamOS comes out people in the store are going to want to save that $60 on their computers.  They may not know what linux is or such, but they're going to want to save that $60.\r\n\r\nAdobe massively fucked themselves with their cloud service; they could have lowered the costs and increased the number of people using their products, but what is probably going to happen is competitors that products similar products will become functionally the same and sell it at a lower price thus fucking Adobe.\r\n\r\n\r\nI like Unity a lot; they did the smart thing; they undersold the competition and thus are reaping the financial gains.  The same thing is probably going to happen to a lot of companies.  This is bound to happen to a lot of other companies as well; someone is going to come in and undersell them.","author":"38b55cdf63616403d7560600"},{"id":"537bc7d7636872052bbb0000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/537bad826368725368df0400#post_537bad826368725368df0400\r\nHow long before we get 32 and 64 GB RAM sticks for desktops? Also how long before we get a true 64 bit OS?","author":"5010fa077f123b1e4f00104e"},{"id":"537bcd0c6368720535270300","topic_id":"5161dd617f123bd25900013d","body":"\"@someguy111\":/dis/the-time-wasting-thread/post/537bc7d7636872052bbb0000#post_537bc7d7636872052bbb0000\r\nWe already have 32gb and 64gb ram sticks; they're just massively expensive right now.  Keep in mind that in ten years time the average $1000 desktop is going to be as powerful as the human brain; so if you keep in mind 2-3 years doesn't seem that long.\r\n\r\nWhen I say \"as powerful as the human brain\" before you get all excited I don't mean you can upload a brain to your desktop and have it sapient sort of way; I mean able to perform as many computations and so forth as the human brain.  When we do get sapient Ai that will probably be through neurochips; so no computer dating sims with sapient Ai.  On the plus side chances are looking pretty good for androids girlfriends though.\r\n\r\nPeople in Ai development are really happy lately about the recent breakthrough in neurochip technology cause basically what that means is we could have extremely human like Ai.\r\n\r\nTl:dr; 2-3 years; ten years from now your average desktop will be as powerful as your brain, but no skynet will not happen cause all the recent Ai development breakthroughs has been in neurochips.  If skynet happens it will be fourty to fifty years after sapient android girlfriends/boyfriends.","author":"38b55cdf63616403d7560600"},{"id":"537bd4e36368722110000100","topic_id":"5161dd617f123bd25900013d","body":"Pennsylvania just struck down their gay marriage ban.  Gay marriage is now legal in all of the northeast.","author":"38b55cdf63616403d7560600"},{"id":"537bd5c263687223708e0100","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/537bd4e36368722110000100#post_537bd4e36368722110000100\r\nSweet\r\n!http://37.media.tumblr.com/c77be42012b9e692149771b5186e633f/tumblr_mpne82AYiN1sqo325o1_250.gif!\r\n!http://31.media.tumblr.com/8c5b1cc45766e08f3ecbc0fece645d31/tumblr_mpne82AYiN1sqo325o2_250.gif!\r\n[spoiler]!http://31.media.tumblr.com/a720d5aa042a0fe83a794acdc3cf1293/tumblr_mpne82AYiN1sqo325o5_r1_250.gif![/spoiler]\r\n[spoiler]!http://24.media.tumblr.com/86bf162a09943ebc9635cca58d8bc7d7/tumblr_mpne82AYiN1sqo325o6_r1_250.gif![/spoiler]\r\n[spoiler]!http://24.media.tumblr.com/aa4bb8bb2af4085136e12a260a7ac611/tumblr_mpne82AYiN1sqo325o7_r2_250.gif![/spoiler]\r\n!http://37.media.tumblr.com/95d4b4098be641c7b612f1532c55aaa0/tumblr_mpne82AYiN1sqo325o8_r2_250.gif!\r\nEdit: Some gifs spoiled for Possibly being seizure inducing","author":"5062d6f17f123b3e16001184"},{"id":"537bd5ea6368722464c00100","topic_id":"5161dd617f123bd25900013d","body":"\"@trashboat\":/dis/the-time-wasting-thread/post/537bd5c263687223708e0100#post_537bd5c263687223708e0100\r\nOne of these days I really need to watch Kamen Rider.","author":"38b55cdf63616403d7560600"},{"id":"537bd66863687224b31a0200","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/537bd5ea6368722464c00100#post_537bd5ea6368722464c00100\r\nKamen rider Black is A kickass show so far (I recommend that along with Giant robo)","author":"5062d6f17f123b3e16001184"},{"id":"537bd6d363687221106f0200","topic_id":"5161dd617f123bd25900013d","body":"\"@trashboat\":/dis/the-time-wasting-thread/post/537bd66863687224b31a0200#post_537bd66863687224b31a0200\r\nWhat I know about Kamen Rider from the internet:\r\n!http://i2.kym-cdn.com/photos/images/original/000/732/345/61c.png!","author":"38b55cdf63616403d7560600"},{"id":"537bd71d6368723613050000","topic_id":"5161dd617f123bd25900013d","body":"\"@trashboat\":/dis/the-time-wasting-thread/post/537bd66863687224b31a0200#post_537bd66863687224b31a0200\r\nFine I give in. Link me to the first episode of Black AND I'll give it a watch.","author":"4fde4618945b700aa0002fff"},{"id":"537bd79263687236ee2f0000","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/537bd71d6368723613050000#post_537bd71d6368723613050000\r\n\"Here\":http://www.youtube.com/watch?v=5t06alHjIZE\r\n\r\n\r\n\"@uc9\":/dis/the-time-wasting-thread/post/537bd6d363687221106f0200#post_537bd6d363687221106f0200\r\nThat is somewhat accurate (To Heisei rider anyway)","author":"5062d6f17f123b3e16001184"},{"id":"537bd80063687235ff580000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/537bd4e36368722110000100#post_537bd4e36368722110000100\r\nWhat would be really nice is if the SCOTUS would just strike down the ban and make it legal nationwide. That way there would be no more waiting for each state to pass it and would be fair to everyone. Let's face it: the deep south is going to be tough to strike the ban down and the people living there will still be under the oppressive laws. As much as I understand what states are (autonomous entities under the rule of a central government) I don't think it's right or fair that just because you live in one state means you should not be able to have that freedom vs. someone in the next state over that can. Just like with weed being legal in WA and CO. Why just those 2 places? Are the people of those 2 states different from the other 48? They can handle it but no one else can? No, people are people no matter where you go. It's not fair and IMO it's a broken system especially when something as important as personal freedom is involved.","author":"5010fa077f123b1e4f00104e"},{"id":"537bda6d63687237d44c0100","topic_id":"5161dd617f123bd25900013d","body":"\"@someguy111\":/dis/the-time-wasting-thread/post/537bd80063687235ff580000#post_537bd80063687235ff580000\r\nThe same could be said between nations.","author":"509129db7f123b36cb010fa5"},{"id":"537bdbd86368721504670000","topic_id":"5161dd617f123bd25900013d","body":"\"@someguy111\":/dis/the-time-wasting-thread/post/537bd80063687235ff580000#post_537bd80063687235ff580000\r\nThe thing to keep in mind is that we currently have a conservative leaning supreme court.  It's for the best they don't hear on it cause if they do have a ruling on it then there's a overwhelming chance they'll legalize the bans.\r\n\r\nSeveral of the judges are outright refusing to retire cause of this.  It's better that it's going state by state, cause if the supreme court rules on it then the number of states where gay marriage is legalized will go from 19 back down to 6.\r\n\r\nThe only thing we can hope for is either they continue to punt it back to the states or that one of the judges retires. . . which they won't and in fact I believe three of them have stated they refuse to retire cause they know obama will replace them with a non-conservative justice.  If one of them has to retire due to old age or one of them dies and is replaced then sure having them hear the case on it is a good idea, but right now it's a terrible idea.\r\n\r\nIf they continue to refuse to hear the cases then chances are we'll have almost all states legalize gay marriage by 2017; if they do hear it then that puts reverts the glbt movement back a decade.\r\n\r\nTl:dr; If you want gay marriage legalized in the usa here's the three possible ways it could happen.\r\n1)States continue to rule them unconstitutional.\r\n2)One of the justices retires.\r\n3)One of the justices dies.","author":"38b55cdf63616403d7560600"},{"id":"537bdc156368721134620000","topic_id":"5161dd617f123bd25900013d","body":"\"@boz\":/dis/the-time-wasting-thread/post/537bda6d63687237d44c0100#post_537bda6d63687237d44c0100\r\nHear! Hear!\r\nJust because you live in Canada means you can't have this freedom that people in the US can despite the fact that the US and Canada are almost the same and the people and culture there are almost identical.\r\n\r\nCanadians have to wait until they are 18 to drink but the US is it 21. Why? Well that's obvious, you see people from Canada are a different species, they can handle alcohol earlier than the species south of the border. Also if you have lived in the US all your life and just turned 18 and move to Canada you are immediately magically changed into the Canadian species and can how handle alcohol. Inversely if you are from Canada and are 18 and have been drinking and come to the US, all of a sudden you turn into a US species and suddenly can't handle it. See, the laws make perfect sense.","author":"5010fa077f123b1e4f00104e"},{"id":"537bdcb763687214d7a50000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/537bdbd86368721504670000#post_537bdbd86368721504670000\r\nIt honestly enrages me that the lives and freedoms of people are in the hands of a bunch of oppressive bigots who seem to hate anything to do with freedom, especially freedom involving love and sex which is a fundamental human right and the government has no business trying to control. ","author":"5010fa077f123b1e4f00104e"},{"id":"537bdcdc636872116e770000","topic_id":"5161dd617f123bd25900013d","body":"In other words:\r\nWe just need to hold out till November 2016 cause WHEN hillary wins the justices that refuse to retire cause of a democrat in the white house will realize their health isn't going to last long enough to surive another 8 years as well.\r\n\r\nDownside:\r\nGay marriage will be legalized by then.","author":"38b55cdf63616403d7560600"},{"id":"537bdd2363687214d7e70000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/537bdbd86368721504670000#post_537bdbd86368721504670000\r\n4) Have a nationwide movement and petition demanding freedom, not just for marriage equality but for personal freedom in general.","author":"5010fa077f123b1e4f00104e"},{"id":"537bde066368721561110100","topic_id":"5161dd617f123bd25900013d","body":"\"@someguy111\":/dis/the-time-wasting-thread/post/537bdd2363687214d7e70000#post_537bdd2363687214d7e70000\r\nEh; we just need to wait until the next presidential election cause when that happens the three justices that refuse to retire cause of a democrat in office will realize they're going to have to retire eventually and we'll get a massively biased supreme court in the other direction.\r\n\r\nImagine a supreme court hand picked by Hillary.  A supreme court that is massively biased towards glbt rights and is massively biased against glbt discrimination.  Honestly I think such a court would be worth it.  When you get right down to it the judges that refuse to retire are screwing their political party in the end.  If they retired now they would be replaced with moderate judges; if they retire when Hillary becomes president they're going to be replaced with pro-glbt judges.","author":"38b55cdf63616403d7560600"},{"id":"537bedf76368721214400700","topic_id":"5161dd617f123bd25900013d","body":"Guys what anime would you consider to have the most metal OST?","author":"4fde4618945b700aa0002fff"}]}