{"topics":[{"id":"537bee6463687261f9010000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/537bde066368721561110100#post_537bde066368721561110100\r\n>wanting more liberal police state tyranny\r\n\r\nAlthough, I doubt she would be as awful as Obama with his drone program and spying","author":"4fe16df67f123b13e400003f"},{"id":"537bf02d63687267264f0000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/537bde066368721561110100#post_537bde066368721561110100\r\nIt's not just glbt rights though or even just sexual/love/marriage freedom in general (although those things I consider _extremely_ important as they are fundamental human rights) but I mean just personal freedom in general. I don't know much about Hilary's stance on things like legalizing cannabis or giving the American people the other personal freedoms they have been stripped of back. I hope that just because she is a woman that she doesn't have the \"sex is evil\" soccer mom mentality and try to ban porn or try to push some other oppressive law because she thinks all men are rapists.","author":"5010fa077f123b1e4f00104e"},{"id":"537bf05e63687263d08d0000","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/537bee6463687261f9010000#post_537bee6463687261f9010000\r\nYeah; Obama is going to be remembered forever as \"drone daddy\".\r\n\r\nThe reason why I want her to win is that we're one step away from a theocracy.  It's a far safer bet when the usa is three steps away from a police state to bet on that person when they have to work more towards that end than the person who wants to close that one last final gap towards a theocracy.  Considering the backlash against the nsa and such if someone wants to strip away that final straw they're going to have to seriously work for it; if someone wants the usa as a theocracy they could just go (click) done.  Just click done <x religion> is no longer recognized.  Just click done rights of <x religion> is no longer recognized.","author":"38b55cdf63616403d7560600"},{"id":"537bf12b636872620e790000","topic_id":"5161dd617f123bd25900013d","body":"\"@someguy111\":/dis/the-time-wasting-thread/post/537bf02d63687267264f0000#post_537bf02d63687267264f0000\r\nit's a reasonable fear.\r\nYou know whose vote helped the Nazis and prohibition right? RIGHT?!\r\nI SWEAR TO GOD DO YOU KNOW?!!!!!\r\n\r\n\r\n\"@uc9\":/dis/the-time-wasting-thread/post/537bf05e63687263d08d0000#post_537bf05e63687263d08d0000\r\nThere's nothing in Hillary's history that makes me think she would change those things. Maybe if the voters really wanted it.\r\n\r\nThere was some rep guy who I wanted to win. I forget who.","author":"4fe16df67f123b13e400003f"},{"id":"537bf2cf63687265b4df0000","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/537bf12b636872620e790000#post_537bf12b636872620e790000\r\nI'm not saying she's going to up and change the usa and fix the country; rather if she doesn't win then that's completely fucking over for religious rights all together.  There's judges now that want ONLY christians to be recognized as having the right to freedom of religion.  If you're muslim/jewish/hindu/pagan/atheist/agnostic/etc and she doesn't win you're utterly fucked.\r\n\r\nImagine it: 2018 the year religious freedom only applies to christians.","author":"38b55cdf63616403d7560600"},{"id":"537bf2f66368726258560100","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/537bf2cf63687265b4df0000#post_537bf2cf63687265b4df0000\r\nnever heard that.\r\n","author":"4fe16df67f123b13e400003f"},{"id":"537bf39a63687261cda10100","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/537bf2cf63687265b4df0000#post_537bf2cf63687265b4df0000\r\nThat can't happen, to make or impose ANY law or regulation based on religion is a violation of \"separation of church and state\"","author":"5010fa077f123b1e4f00104e"},{"id":"537bf4ae6368726187600100","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/537bf2f66368726258560100#post_537bf2f66368726258560100\r\nIs your address, \"Basement under Rock\"?\r\n\r\nReligious freedom in the usa is fucked fucked.  In case you didn't realize we had Hobby Lobby try to be recognized as a religious institution and is now distributing business edited bibles.  The problem with that is if they are a religious organization then what their edited bibles edits can be in court considered execution of religious freedoms.\r\n\r\nDo you see the problem here?  If any company can be considered a religious organization and edit their own bibles and thus their business practices can be considered a religious practice what does that mean for freedom of religion?  Or for that matter even if a employee is not christian they can still be considered a member.\r\n\r\nDo you see the problem with what how they interpret religious freedom?","author":"38b55cdf63616403d7560600"},{"id":"537bf58963687261f9cb0100","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/537bf4ae6368726187600100#post_537bf4ae6368726187600100\r\nI didn't know it was happening.","author":"4fe16df67f123b13e400003f"},{"id":"537bf633636872667b750200","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/537bf4ae6368726187600100#post_537bf4ae6368726187600100\r\nI assume this post was actually in reply to me, to which I must respond: WAT!?\r\n\r\nHobby Lobby tried to be recognized as a religion? I...I just can't. My face can only have so many palms on it.","author":"5010fa077f123b1e4f00104e"},{"id":"537bf6c6636872667bbb0200","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/537bf4ae6368726187600100#post_537bf4ae6368726187600100\r\nHell if Scientology got away with it...\r\n\r\nOh fuck, what if Hobby Lobby tried to pull some kinda Operation Snow White style shenanigans? I can't decide if I should just laugh or laugh and cry.","author":"4f41ee04945b701c41002af7"},{"id":"537bf7cd636872676bd30200","topic_id":"5161dd617f123bd25900013d","body":"\"@gasmaskangel\":/dis/the-time-wasting-thread/post/537bf6c6636872667bbb0200#post_537bf6c6636872667bbb0200\r\nDude; Scientology has modern day slavery under the pretence of \"religious workers\".  Now imagine if Christianity was granted the same exemption.  Now realize we're a sliver of a hair from granting them such a exemption.","author":"38b55cdf63616403d7560600"},{"id":"537bf7dc63687261f9d00200","topic_id":"5161dd617f123bd25900013d","body":"Hey does anyone remember that video from a while back that had me crying? It was the Outlast DLC right?","author":"4fde4618945b700aa0002fff"},{"id":"537bf85b63687264e8bb0300","topic_id":"5161dd617f123bd25900013d","body":"\"@gasmaskangel\":/dis/the-time-wasting-thread/post/537bf6c6636872667bbb0200#post_537bf6c6636872667bbb0200\r\nAn arts and crafts store starting a religion sounds kind of funny; think about all the members being required to learn to sew and paint things. They will gather to build ships in bottles and preach about building birdhouses. ","author":"5010fa077f123b1e4f00104e"},{"id":"537bfafa636872634c7b0400","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/537bf7cd636872676bd30200#post_537bf7cd636872676bd30200\r\nYea, Christianity is just the scourge of humanity.\r\n\r\nEven if they got that power I doubt Christians would do any of that.\r\n\r\nThese are the two worst excesses of Christianity in the past\r\n\r\nhttp://listverse.com/2009/01/07/top-10-myths-about-the-middle-ages/\r\n\r\nhttp://www.ignatiusinsight.com/features2005/print2005/tmadden_crusades_print.html","author":"4fe16df67f123b13e400003f"},{"id":"537bfb20636872660c100500","topic_id":"5161dd617f123bd25900013d","body":"\"@someguy111\":/dis/the-time-wasting-thread/post/537bf85b63687264e8bb0300#post_537bf85b63687264e8bb0300\r\nI always knew that scrapbookers were a cult.\r\n\r\n\"@uc9\":/dis/the-time-wasting-thread/post/537bf7cd636872676bd30200#post_537bf7cd636872676bd30200\r\nThere are a few important distinctions though, first and foremost Christianity pretty much by definition has to be transparent. Scientology not only actively discourages anyone from looking too closely but exploits its status as an outsider to defend itself from persecution for the many, many, many good reasons to persecute them.\r\n\r\nPut simply christianity is too big to really pull this sort of stuff off, its too much of an exposed target.\r\n\r\nDon't get me wrong, people like that judge who claimed that only Christians should be allowed Freedom of Speech need watching, but the odds of them being able to bring these twisted ideas into effect on anything more than a local level, and even then only so long as it takes for the issue to reach the supreme court, are so low that you could *almost* dismiss them out of hand.\r\n\r\nLike I said, such people need to be watched for as long as they keep themselves in the public eye, but the way I see it their lunacy is more the deranged ramblings of dying perspectives. The more the world moves past their backwards ideas, the louder they scream in a desperate attempt to keep their petty tatters of control.","author":"4f41ee04945b701c41002af7"},{"id":"537bfc5f63687261f9fc0400","topic_id":"5161dd617f123bd25900013d","body":"MORE TIME WASTING!\r\n!http://i.imgur.com/yzRWgCe.jpg!","author":"4fe16df67f123b13e400003f"},{"id":"537bfcf46368726187480500","topic_id":"5161dd617f123bd25900013d","body":"\"@gasmaskangel\":/dis/the-time-wasting-thread/post/537bfb20636872660c100500#post_537bfb20636872660c100500\r\n_Don’t get me wrong, people like that judge who claimed that only Christians should be allowed Freedom of Speech need watching_\r\n\r\nI don't get it, how can someone like that even be elected as a judge in the first place? After making that statement wouldn't that be reaosn enough to remove him from his seat of power based on him basically saying he does not follow the \"justice\" system?","author":"5010fa077f123b1e4f00104e"},{"id":"537bfe5c636872646eed0500","topic_id":"5161dd617f123bd25900013d","body":"!https://derpicdn.net/img/view/2014/5/20/632086__safe_meme_exploitable+meme_crying_tv+meme_obligatory+pony_gamer+luna_video+game_microsoft_rareware.PNG!\r\n\r\nhttps://www.facebook.com/groups/1393357934272716/","author":"50a80a127f123b58af01289d"},{"id":"537bfe8263687261cdd80600","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/537bfafa636872634c7b0400#post_537bfafa636872634c7b0400\r\nDude no one here is saying that every christian is bad; rather what do you think will happen if you give a company exemption from the law and remove religious freedom a individual group has?\r\n\r\nIn other words if you strip the religious freedoms of a group do they still have religious freedom?  If only a particular group has freedom is that actually freedom?  If only you and no one else has freedom is that freedom?  That is not freedom; that is not liberty.  A man chooses; a slave obeys.  If you truly supported freedom you would support freedom of anyone regardless of them having a different religion or such.","author":"38b55cdf63616403d7560600"},{"id":"537c02b76368720c38ab0000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/537bf4ae6368726187600100#post_537bf4ae6368726187600100\r\nThis is why I don't put full faith into believe every stuff in the Bible. By the way, the Bible went through numerous translations and interpretations throughout its history. Who knows how much of the original words have been altered? The Bible wasn't originally in English or Latin either, but Ancient Hebrew.","author":"4fde5cee945b700a970060fc"},{"id":"537c02f66368720f9f8e0000","topic_id":"5161dd617f123bd25900013d","body":"I tried to pay for my MOC young rex via PayPal today, but it turns out that there wasn't enough money on it. My guardian told me they put the money on the card. ","author":"50b70eeb7f123b1a02000097"},{"id":"537c07d26368720dae5d0200","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/537bfe8263687261cdd80600#post_537bfe8263687261cdd80600\r\nI'm saying this sounds like alarmism","author":"4fe16df67f123b13e400003f"},{"id":"537c087d63687210cb970200","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/537c07d26368720dae5d0200#post_537c07d26368720dae5d0200\r\nSays the person that said I wanted police state tyranny for wanting hillary to win.\r\n!http://media.giphy.com/media/IOCXHPvn3WErm/giphy.gif!","author":"38b55cdf63616403d7560600"},{"id":"537c09226368720f9f420300","topic_id":"5161dd617f123bd25900013d","body":"jesus christ what is going on now.","author":"5154c5237f123bcd580002fc"}]}