{"topics":[{"id":"537d69e9636872486bcc0100","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/537d694d636872482ddf0000#post_537d694d636872482ddf0000\r\nSo they can pay tons of money and all of a sudden it's fine to pollute the air we all breathe and the water we all drink and bathe with? So basically money is more important that the earth we all share which is vital to our lives. As I said, screw the environment, money is king.","author":"5010fa077f123b1e4f00104e"},{"id":"537d6a2063687212de060000","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/537d694d636872482ddf0000#post_537d694d636872482ddf0000\r\nSo they can pay tons of money in \"fines\" and all of a sudden it's fine to pollute the air we all breathe and the water we all drink and bathe with? So basically money is more important than the earth we all share which is vital to our lives. As I said, screw the environment, money is king.","author":"5010fa077f123b1e4f00104e"},{"id":"537d6a926368720dc00d0000","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/537d694d636872482ddf0000#post_537d694d636872482ddf0000\r\nIf you explain something in a simple manner it seems as though the solution is simple regardless of whether or not it works.\r\n\r\nProblem 1:\r\nThat doesn't fix greenhouse gases being released into the atmosphere.  Greenhouse gases are gases in the atmosphere, not liquid or solids in the soil.\r\n\r\nThe solution to perpetual motion sounds easy in theory in that you could say that it would be as simple as removing all friction, but in practice how would you remove air friction and generate energy from it it if has no contact with anything and how there's no such thing as a absolute vacuum even in space.","author":"38b55cdf63616403d7560600"},{"id":"537d6b2f6368720e88740000","topic_id":"5161dd617f123bd25900013d","body":"How about, *making those corporate fat cats PAY*?","author":"4fde5cee945b700a970060fc"},{"id":"537d6b68636872108e780000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/537d6a926368720dc00d0000#post_537d6a926368720dc00d0000\r\nEven if it's not air pollution, ground based pollution is still horrible. I drove by a forest that used to be a beautiful pristine place and has now been fracked and looks like a war zone. Not to mention the ground water pollution that could get into the well water of those who live around there.","author":"5010fa077f123b1e4f00104e"},{"id":"537d6b8a6368720ffc6a0000","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/537d6b2f6368720e88740000#post_537d6b2f6368720e88740000\r\n\r\nNot unless you make it look like it's more an attractive investment ","author":"4fdfbf92945b7075d50036e4"},{"id":"537d6bb263687210dc850000","topic_id":"5161dd617f123bd25900013d","body":"\"Oldest man alive today is 111.\":http://www.livescience.com/45779-oldest-man-is-111.html ","author":"50b70eeb7f123b1a02000097"},{"id":"537d6bf66368720ea59b0000","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/537d6b2f6368720e88740000#post_537d6b2f6368720e88740000\r\nHow about a fast transition to clean renewable energy so everyone can have all the power they need for everything and not have to destroy the earth we all share? That way greedy corporations can still make lots of money, which is really all they care about, and the people can live in a clean world.","author":"5010fa077f123b1e4f00104e"},{"id":"537d6c67636872108efc0000","topic_id":"5161dd617f123bd25900013d","body":"\"@someguy111\":/dis/the-time-wasting-thread/post/537d6bf66368720ea59b0000#post_537d6bf66368720ea59b0000\r\nIf humanity wants any hope of saving the world environment. They MUST get China to stop burning coal. Even if the US cuts its pollution significantly, India and China will fill in the gap.","author":"4fde5cee945b700a970060fc"},{"id":"537d6cb663687210f17d0100","topic_id":"5161dd617f123bd25900013d","body":"Yes, we should stop burning coal. Think of all the fossils in the coal getting burned.","author":"50b70eeb7f123b1a02000097"},{"id":"537d6d0e636872511f0a0000","topic_id":"5161dd617f123bd25900013d","body":"I'm hoping that if Hilary is elected she will make so much change to things even if she only serves one term that the conservatives can't undo it and it would be more profitable for them to just continue going on with the changes she made. Like with green energy for example; I hope she really pushes hard for it and by the end of the first term there will be such a big green energy infrastructure that it would be easier to just keep using it and building it than to have the conservatives tear it down because it would interfere with their profits from all the big oil companies they are a part of.","author":"5010fa077f123b1e4f00104e"},{"id":"537d6d5763687250c02f0000","topic_id":"5161dd617f123bd25900013d","body":"How about this...\r\n\r\nWhichever administration finally ends the North Korean communist regime, gets my respect. This shit has been dragging on for over three generations already. It is time for it to come to its end.","author":"4fde5cee945b700a970060fc"},{"id":"537d6d8c636872504c040000","topic_id":"5161dd617f123bd25900013d","body":"\"@someguy111\":/dis/the-time-wasting-thread/post/537d6a2063687212de060000#post_537d6a2063687212de060000\r\nIt means they now have an economic incentive to minimize pollution.\r\n\r\n\r\n\"@uc9\":/dis/the-time-wasting-thread/post/537d6a926368720dc00d0000#post_537d6a926368720dc00d0000\r\nCo2 gasses is a bigger issue.\r\nBut the solution is none of the policies the dems have tried: like solyndra, or corn based oils (which require massive farming and destroy more ecosystems because they have no reason to invest into the land)\r\n\r\nhttp://www.adamsmith.org/blog/energy-environment/a-free-market-solution-to-pollution\r\n\r\nhttp://www.econlib.org/library/Enc/FreeMarketEnvironmentalism.html\r\n\r\nhttp://perc.org/articles/how-free-markets-protect-environment\r\n\r\n","author":"4fe16df67f123b13e400003f"},{"id":"537d6db0636872528d140000","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/537d6c67636872108efc0000#post_537d6c67636872108efc0000\r\nTrue. If we could develop a much cleaner alternative and make it very cost competitive to coal and have the UN offer some kind of incentive to use it that would do it, I think. The only reason any country burns coal is cost and of course those involved who are making tons of money off it pushing the politicians to continue letting them.","author":"5010fa077f123b1e4f00104e"},{"id":"537d6db263687253604f0000","topic_id":"5161dd617f123bd25900013d","body":"\"@someguy111\":/dis/the-time-wasting-thread/post/537d6d0e636872511f0a0000#post_537d6d0e636872511f0a0000\r\nCorporate and government transparency is also appreciated.","author":"4fde5cee945b700a970060fc"},{"id":"537d6e2f6368725360850000","topic_id":"5161dd617f123bd25900013d","body":"\"@someguy111\":/dis/the-time-wasting-thread/post/537d6b68636872108e780000#post_537d6b68636872108e780000\r\n[bq=\"someguy111\"]\"@uc9\":/dis/the-time-wasting-thread/post/537d6a926368720dc00d0000#post_537d6a926368720dc00d0000\r\nEven if it's not air pollution, ground based pollution is still horrible. I drove by a forest that used to be a beautiful pristine place and has now been fracked and looks like a war zone. Not to mention the ground water pollution that could get into the well water of those who live around there.[/bq]\r\nThe reason why I'm more worried about air pollution is that the increase in temperature is reducing arable land thus driving up the cost of food and therefore causing more and more people to go hungry. . . *WAIT* before you go \"100% natural\" route keep in mind that we're heading towards a mass extinction.  Finding a alternative fuel source would save the most lives.  The good thing about a lot of them is that, unlike fossil fuels, the cost of say solar is going down as technology is advancing.  We're eventually going to reach the point at where say solar is going to undersell oil for powering houses.  The cost of solar power has dropped I believe 60% since 2011.  What is going to wind up happening is that we're going to switch energy sources not cause everyone wants to change the environment, but rather alternative fuel sources' costs are going down whereas oil is only going up.\r\n\r\nTl:dr;  In the long run we're going to sort this out cause alternative fuel sources' costs are going down; cost of oil is only going upwards cause it's not renewable.","author":"38b55cdf63616403d7560600"},{"id":"537d6e2f63687253c8500000","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/537d6d8c636872504c040000#post_537d6d8c636872504c040000\r\nAnd that's what I mean; all of those links are more about money than pollution. It's more how can we save the almighty dollar than the environment.","author":"5010fa077f123b1e4f00104e"},{"id":"537d6e916368725134850000","topic_id":"5161dd617f123bd25900013d","body":"\"@someguy111\":/dis/the-time-wasting-thread/post/537d6e2f63687253c8500000#post_537d6e2f63687253c8500000\r\nHumans never really evolved to think long term.","author":"4fde5cee945b700a970060fc"},{"id":"537d6ee06368724fcf9d0000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/537d6e2f6368725360850000#post_537d6e2f6368725360850000\r\nWell of course,I could have told you that. Fossil fuels are finite resources and will run out one day. As they get more scarce the price goes up as per supply and demand. The big oil companies don't want the transition to happen just yet even though they know it's going to happen because there is still some oil (easy money) left and are trying to get all they can.","author":"5010fa077f123b1e4f00104e"},{"id":"537d6ef563687250a8910000","topic_id":"5161dd617f123bd25900013d","body":"\"@Whatevs\":/dis/the-time-wasting-thread/post/537d6d8c636872504c040000#post_537d6d8c636872504c040000\r\nBZZT! WRONG!\r\nThe problem with corn oil is that it drives up food costs cause corn requires land which the amount of arable land is constantly going down.\r\n\r\nAlgae on the other hand probably will become the alternative fuel for cars.  We can make fuel out of algae; the problem right now is that the process to crack open the cell walls on such a level is expensive.  Right now algae oil would cost $7/gallon, in ten or so years it probably will go down massively though to the point fossil fuel oil can't compete.","author":"38b55cdf63616403d7560600"},{"id":"537d6fb8636872503de30000","topic_id":"5161dd617f123bd25900013d","body":"\"@someguy111\":/dis/the-time-wasting-thread/post/537d6ee06368724fcf9d0000#post_537d6ee06368724fcf9d0000\r\nIt's funny whenever people pro-oil try to rationalize against capitalism.  One of the basic cores of capitalism is that underselling a competitor will cause you to become the top dog so to speak.\r\n\r\nIf the cost of solar energy has gone down ~60% in only three years then in ten years time fossil fuels will not be able to compete cause their cost will have gone up even further.","author":"38b55cdf63616403d7560600"},{"id":"537d702563687253604c0100","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/537d6e916368725134850000#post_537d6e916368725134850000\r\nThe original diesel engine was made to run on peanut oil but the oil companies used their muscle to push renewable fuels like that under the rug because oil was so much cheaper to make and much more profitable to sell. If they would have though about the industry in the long term they may have thought that they were building an empire on a resource that would run out one day. If those oil company bastards weren't so dam greedy we would have a huge natural fuel infrastructure right now and oil spills, fraking, air pollution and dependence and conflicts of foreign oil would never have happened. Thanks a lot greed.","author":"5010fa077f123b1e4f00104e"},{"id":"537d711b6368722f3e2f0000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/537d6fb8636872503de30000#post_537d6fb8636872503de30000\r\nThat's one reason why natural and renewable energy gets such crap from conservatives I would think; they know that the oil industry is doomed but want to milk it for all they can so they are trying to discourage the use of anything that could interfere with their profits until the oil has all but dried up.","author":"5010fa077f123b1e4f00104e"},{"id":"537d73e76368722f07020100","topic_id":"5161dd617f123bd25900013d","body":"\"@someguy111\":/dis/the-time-wasting-thread/post/537d6e2f63687253c8500000#post_537d6e2f63687253c8500000\r\nthat's an emotional argument. We're done here. You think regulations are magical.\r\n\r\n\r\n\"@uc9\":/dis/the-time-wasting-thread/post/537d6ef563687250a8910000#post_537d6ef563687250a8910000\r\nNo you're wrong child. It does that too. It still causes more environmental harm in the way I describe.\r\nCome back later.","author":"4fe16df67f123b13e400003f"},{"id":"537d73f26368723049020100","topic_id":"5161dd617f123bd25900013d","body":"\"@someguy111\":/dis/the-time-wasting-thread/post/537d6e2f63687253c8500000#post_537d6e2f63687253c8500000\r\nthat's an emotional argument. We're done here. You think regulations are magical.\r\n\r\n\r\n\"@uc9\":/dis/the-time-wasting-thread/post/537d6ef563687250a8910000#post_537d6ef563687250a8910000\r\nNo you're wrong child. It does that too. It still causes more environmental harm in the way I describe.\r\nCome back later.","author":"4fe16df67f123b13e400003f"}]}