{"topics":[{"id":"537d8c5863687220d24f0000","topic_id":"5161dd617f123bd25900013d","body":"\"@Grieffon\":/dis/the-time-wasting-thread/post/537d8bf36368721ff72a0000#post_537d8bf36368721ff72a0000\r\nNo. All we seem to do is harm it. Everything was in balance until modern society came along.","author":"5010fa077f123b1e4f00104e"},{"id":"537d8ceb636872212c570000","topic_id":"5161dd617f123bd25900013d","body":"\"@someguy111\":/dis/the-time-wasting-thread/post/537d8c5863687220d24f0000#post_537d8c5863687220d24f0000\r\nMisanthropic bullshit.\r\n\r\nNature is utterly amoral, it has no inherent value beyond what we attach to it.\r\n\r\nAlso balance? So you're saying that there was no such thing as extinction until humans figured out how to stab stuff with spears?","author":"4f41ee04945b701c41002af7"},{"id":"537d8d6463687222a9a70000","topic_id":"5161dd617f123bd25900013d","body":"\"@gasmaskangel\":/dis/the-time-wasting-thread/post/537d8ceb636872212c570000#post_537d8ceb636872212c570000\r\n!http://2.bp.blogspot.com/-hLkgdefgNck/T2uTZGNgrwI/AAAAAAAABlY/OzaRfY7Sc2M/s1600/DSC_0006.jpg!","author":"50b70eeb7f123b1a02000097"},{"id":"537d8ddf63687220f98f0100","topic_id":"5161dd617f123bd25900013d","body":"!http://static.tvtropes.org/pmwiki/pub/images/Skull_Man_5885.jpg!\r\nHas anyone here Seen/Read Skullman?","author":"5062d6f17f123b3e16001184"},{"id":"537d8e6463687255f20b0000","topic_id":"5161dd617f123bd25900013d","body":"\"@gasmaskangel\":/dis/the-time-wasting-thread/post/537d8ceb636872212c570000#post_537d8ceb636872212c570000\r\n[bq=\"gasmaskangel\"]\"@someguy111\":/dis/the-time-wasting-thread/post/537d8c5863687220d24f0000#post_537d8c5863687220d24f0000\r\nMisanthropic bullshit.\r\n\r\nNature is utterly amoral, it has no inherent value beyond what we attach to it.\r\n\r\nAlso balance? So you're saying that there was no such thing as extinction until humans figured out how to stab stuff with spears?[/bq]\r\nHere's also the other logical fallacy when you think about it:  We already caused a inevitable mass extinction.  When we try to revert it that doesn't make sense that wanting to revert it is some sort of \"against nature\" deal.\r\n\r\nThat would be like someone driving a 120mph in the wrong lane drunk and when he sees oncoming traffic the driver going \"Well I could switch lanes and stop, but it was already determined\".\r\n\r\nI've seen people say that agree that global warming is manmade, but then say that it's wrong to reverse it cause it's \"god's work\".  Which is it?  Is it manmade or \"natural\"?  What's worse is that people that believe furthering the destruction of the environment is a part of nature.  Some dude I used to know believed that we should kill off all non-domesticated animals under the belief that it would be a a act of nature and then said that evolution would cause the domesticated animals to become millions of new species in only a couple thousand years.\r\n\r\nYou can tell why I don't hang out with my old friends no more.  They were fucking stupid.","author":"38b55cdf63616403d7560600"},{"id":"537d8eaf63687256490c0000","topic_id":"5161dd617f123bd25900013d","body":"I wish my friend BastionMonk from the Jurassic Park wiki was on this site. He could explain a lot of this stuff and talk about even more.","author":"50b70eeb7f123b1a02000097"},{"id":"537d8ef16368725661350000","topic_id":"5161dd617f123bd25900013d","body":"\"@gasmaskangel\":/dis/the-time-wasting-thread/post/537d8ceb636872212c570000#post_537d8ceb636872212c570000\r\nBeing \"amoral\" and having extinction is part of the balance of nature. Strong species survive while others go extinct. Things are kept in balance as populations of plants and animals are kept in check by the animals that eat them. When man came along the balance was thrown off. Why do you think we have invasive species like Canadian geese? Back before so much land was destroyed and so much urbanization happened the geese population was kept in check but now they have more places to breed and thus have muscled in on other species and taken over. Also think about the species we humans introduced in the environment that messed it up. The dodo was wiped out because predators it had never seen before were suddenly introduced and they were all killed. The zebra mussel was introduced into the Great Lakes and basically took over. Nature is built to be in balance and when the balance is upset you get things like invasive species and extinctions that should not happen naturally. ","author":"5010fa077f123b1e4f00104e"},{"id":"537d8f1863687256491f0000","topic_id":"5161dd617f123bd25900013d","body":"\"@gasmaskangel\":/dis/the-time-wasting-thread/post/537d8ceb636872212c570000#post_537d8ceb636872212c570000\r\nExtinction and creation of new species are normal, but it seems we cause them to happen in a chaotic way. Think of it like an epidemic: people die, but diseases cause them to die much earlier than they should.","author":"4fded3ad945b700aaa01381d"},{"id":"537d8f416368725566270000","topic_id":"5161dd617f123bd25900013d","body":"\"@someguy111\":/dis/the-time-wasting-thread/post/537d8ef16368725661350000#post_537d8ef16368725661350000\r\nIf we are a part of the ecosystem, then the extinctions are natural.","author":"50b70eeb7f123b1a02000097"},{"id":"537d908a636872548eb30000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/537d8e6463687255f20b0000#post_537d8e6463687255f20b0000\r\nMy stance is this. We have the responsibility to preserve that which is good, but we frequently lack the knowledge or power to do so.\r\n\r\nGlobal warming is obviously man made, or at least man accelerated, and we should take whatever steps are possible to soften the blow but I don't know that it is possible to reverse the process. The reason for doing so is purely human because nature doesn't give a shit because nature is an arbitrary concept unworthy of reverence. Admiration and respect maybe, but not reverence.\r\n\r\nSimilarly I oppose acts of barbarous cruelty like the practice of harvesting shark fins to make the soup and then just pitching the creatures back into the ocean not because we have to love the sharks but because we ought to be better than such things.\r\n\r\nUltimately the environment is an economic question. What must be done to sustain as much life, especially human, as possible? What can be sacrificed to improve the quality of human life? Where does the line need to be drawn? Unfortunately for hundreds of years, and even now, those questions have not even been asked by many people responsible for them.","author":"4f41ee04945b701c41002af7"},{"id":"537d90e3636872541ade0000","topic_id":"5161dd617f123bd25900013d","body":"\"@Randomosaur\":/dis/the-time-wasting-thread/post/537d8f416368725566270000#post_537d8f416368725566270000\r\nOur actions are based off of desire and in many cases greed. For many thousands of years we humans have been living in balance with nature which is why our bodies are made to eat natural things. Only in the last few hundred years when society really started to advance both in urbanization and population have things started to go downhill. Man used to work in harmony with nature, hunting only as needed and tending to the land. Now we just basically destroy it to put up more condos. ","author":"5010fa077f123b1e4f00104e"},{"id":"537d91696368721b220f0000","topic_id":"5161dd617f123bd25900013d","body":"\"@gasmaskangel\":/dis/the-time-wasting-thread/post/537d908a636872548eb30000#post_537d908a636872548eb30000\r\nHey, I love the sharks.","author":"50b70eeb7f123b1a02000097"},{"id":"537d91c663687214f6090000","topic_id":"5161dd617f123bd25900013d","body":"\"@gasmaskangel\":/dis/the-time-wasting-thread/post/537d908a636872548eb30000#post_537d908a636872548eb30000\r\nYou know what's stupid?  The fact that people can't get it through their thick ass skull that \"mass extinction\" means people die as well.  We already have 2 billion people going hungry every day cause they can't afford food; what about that sounds like \"doesn't effect humans\"?\r\n\r\nI'm sure eventually we'll fix this, but that still means it's a huge ass problem until then.\r\n\r\nWhen I say, \"fight global warming\" what I really mean is \"save billions of lives\".","author":"38b55cdf63616403d7560600"},{"id":"537d920a63687214f6270000","topic_id":"5161dd617f123bd25900013d","body":"\"@someguy111\":/dis/the-time-wasting-thread/post/537d90e3636872541ade0000#post_537d90e3636872541ade0000\r\nBut if we are part of the ecosystem, then all of that is natural.\r\n\r\n\"Also, are you not going to eat beef because part of the cow genome comes from snakes? That's just like a GMO, isn't it?\":http://phenomena.nationalgeographic.com/2013/01/01/how-a-quarter-of-the-cow-genome-came-from-snakes/ ","author":"50b70eeb7f123b1a02000097"},{"id":"537d924c636872168ea30000","topic_id":"5161dd617f123bd25900013d","body":"\"@Randomosaur\":/dis/the-time-wasting-thread/post/537d920a63687214f6270000#post_537d920a63687214f6270000\r\nRandomosaur make another thread on this cause I know you and someguy are going to go at it.  We're having a heated, but still very civil debate here.","author":"38b55cdf63616403d7560600"},{"id":"537d92676368721b774f0000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/537d91c663687214f6090000#post_537d91c663687214f6090000\r\nWe humans have over taxed the world and it cannot sustain all of us. There simply is not enough food and resources to go around with the current conditions of farming and energy production for such a population.","author":"5010fa077f123b1e4f00104e"},{"id":"537d942f636872149fe10000","topic_id":"5161dd617f123bd25900013d","body":"\"@Randomosaur\":/dis/the-time-wasting-thread/post/537d920a63687214f6270000#post_537d920a63687214f6270000\r\nThis again? Seriously do you have some kind of vendetta against anti-GMO?\r\n\r\nAnd as far as we humans and out destruction being natural as we are part of the ecosystem. No. As I said we humans are part of the ecosystem physiologically. If the ecosystem were destroyed we ourselves would be destroyed. For thousands of years we humans have been living peacefully with the earth and the actions of a few greedy people who for instance thought that oil was better to use than the peanut oil that was intended to be used in the diesel engine, it affected all of us and turned us all into polluters even if we didn't want to or even know it. I drive a car that runs on gas and pollutes. Why? Because I have no choice. I can't afford an electric car. This is not something I would naturally do to the earth but because of the ways forced upon me in this society I have no choice. ","author":"5010fa077f123b1e4f00104e"},{"id":"537d94f3636872616f310000","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/537d924c636872168ea30000#post_537d924c636872168ea30000\r\nIs this something that happens often?","author":"4fded3ad945b700aaa01381d"},{"id":"537d9544636872622e270000","topic_id":"5161dd617f123bd25900013d","body":"\"@someguy111\":/dis/the-time-wasting-thread/post/537d942f636872149fe10000#post_537d942f636872149fe10000\r\nI have a vendetta against anti-GMO activists because I believe that a ban on GM food could inspire bans on other useful applications of biotechnology, such as new medicines or de-extinction.","author":"50b70eeb7f123b1a02000097"},{"id":"537d961363687260d5740000","topic_id":"5161dd617f123bd25900013d","body":"\"@Randomosaur\":/dis/the-time-wasting-thread/post/537d9544636872622e270000#post_537d9544636872622e270000\r\nI for one am Only against GM food (I know next to nothing about de-extinction and new medicine)\r\n\r\nI asked someone I know about GMOs, And They told me that they're against GMO because our bodies don't recognize it, And It can make us sick","author":"5062d6f17f123b3e16001184"},{"id":"537d97066368721a70050000","topic_id":"5161dd617f123bd25900013d","body":"\"@trashboat\":/dis/the-time-wasting-thread/post/537d961363687260d5740000#post_537d961363687260d5740000\r\nWell, if someone said it, that means it must be true!\r\n\r\nDe-extinction is basically a plan by a group to resurrect species that went extinct recently. The most successful one so far was the Pyrenean ibex, a subspecies of ibex that went extinct in 2000. One was actually cloned in 2009, but it died of lung complications in only 7 minutes. They're still trying.\r\n\r\nAnother one that has had good progress is the gastric-brooding frog project. The gastric-brooding frog went extinct in the late 1970s or early 1980s, only a few years after being discovered, but scientists in Australia cloned embryos last year. They didn't survive to hatch, but I'm sure that we will have them back in a few years.","author":"50b70eeb7f123b1a02000097"},{"id":"537d977663687219a6260000","topic_id":"5161dd617f123bd25900013d","body":"https://www.youtube.com/watch?v=tXkGzbwkMic","author":"4fe16df67f123b13e400003f"},{"id":"537d97776368721c08080000","topic_id":"5161dd617f123bd25900013d","body":"\"@Randomosaur\":/dis/the-time-wasting-thread/post/537d97066368721a70050000#post_537d97066368721a70050000\r\nThis guy knows what He's talking about\r\n\r\nAlso, I don't give a Fuck!\r\n\r\nMetal heroes, Kamen rider, Super sentai, Or Ultraman?","author":"5062d6f17f123b3e16001184"},{"id":"537d979b6368721c08200000","topic_id":"5161dd617f123bd25900013d","body":"\"@Randomosaur\":/dis/the-time-wasting-thread/post/537d9544636872622e270000#post_537d9544636872622e270000\r\nWell then let me be the first to tell you that, anti-GMO does not mean anti-science. Go ahead and do research of de-exctinction and such, all I want is for those science experiments to stay in the lab and off my dinner plate and out of the environment.","author":"5010fa077f123b1e4f00104e"},{"id":"537d97da63687219a6590000","topic_id":"5161dd617f123bd25900013d","body":"\"@someguy111\":/dis/the-time-wasting-thread/post/537d92676368721b774f0000#post_537d92676368721b774f0000\r\n[bq=\"someguy111\"]\"@uc9\":/dis/the-time-wasting-thread/post/537d91c663687214f6090000#post_537d91c663687214f6090000\r\nWe humans have over taxed the world and it cannot sustain all of us. There simply is not enough food and resources to go around with the current conditions of farming and energy production for such a population.[/bq]\r\nWith current technology though; key word is \"CURRENT\".  Chances are this problem with eventually be figured out though.\r\n\"@Grieffon\":/dis/the-time-wasting-thread/post/537d94f3636872616f310000#post_537d94f3636872616f310000\r\n[bq=\"Grieffon\"]\"@uc9\":/dis/the-time-wasting-thread/post/537d924c636872168ea30000#post_537d924c636872168ea30000\r\nIs this something that happens often?[/bq]\r\nYes; yes indeed.","author":"38b55cdf63616403d7560600"}]}