{"topics":[{"id":"54c1fda06368721ce0840d00","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/54c1f3a16368722f22af1b00#post_54c1f3a16368722f22af1b00\r\nIf I was there, I would say how awesome all of that was.","author":"4fe1b9f47f123b13df002976"},{"id":"54c1fdd663687264becd3a00","topic_id":"5161dd617f123bd25900013d","body":"\"@SeraphimDawn\":/dis/the-time-wasting-thread/post/54c1f5006368724e7ee93a00#post_54c1f5006368724e7ee93a00\r\nThat's really sweet.\r\n\r\nI just get stressed out cause I like talking about a lot of stuff; I fully admit that I'm hard to understand a lot and such, but sometimes I cross the line and talk about things people don't seem to want to talk about philosophically for normalcy sakes.\r\n\"Hey; what if in people's religions their gods only take human form and that's not how they actually look?\"\r\n\"How about you go to a psychologist?\"\r\n\". . . Okay; how about we talk about how interesting it is that our conciousness is a thought process that is aware of itself?\"\r\n\"No seriously; time to take you to a shrink\"\r\n\"I'll shut up about that okay.  Hey remember that time we saw that weird shit with that jenga puzzle didn't fall?\"\r\n\"That's it; shut the fuck up.  You're crazy therefore everything you say is crazy talk so either shut the fuck up or we're dragging you to the hospital\"\r\n\"But you saw it too!\"\r\n\"Shut the fuck up!\"\r\n\r\nIt just stresses me out sometimes cause all sorts of different people have different levels of openness that they're willing to tolerate and if you have any mental problems the second that you cross that line anything and everything you will ever say to them no matter what it is will forever be written off as crazy talk.  I just worry that one day I'll cross that line for what is considered normal for derpibooru and be forever written off.  It really really really does suck to have problems cause that becomes the de facto argument against you in every argument; you could be having a argument with someone with you saying that the sky is blue and they'll go \"we'll you're crazy therefore everything you say is automatically wrong therefore the sky is green cause you can't be right about anything\".\r\n\r\nYou can probably understand why it's so easy to get people with problems angry cause if people automatically wrote off everything you said and constantly told you that you were wrong about everything and the second that they don't feel like dealing with you they cart you off to someone else and dump you causes they feel like you're a bother wouldn't you be constantly stressed as well hoping not to aggrevate or annoy anyone?  No matter what people will think of you as a metaphorical subhuman and therefore forever write you off.","author":"38b55cdf63616403d7560600"},{"id":"54c1fe5263687229debc2600","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/54c1fdd663687264becd3a00#post_54c1fdd663687264becd3a00\r\n[spoiler] Just an innocent question but what kind of mental problems do you have?[/spoiler]","author":"4fe1b9f47f123b13df002976"},{"id":"54c20694636872037ab40f00","topic_id":"5161dd617f123bd25900013d","body":"So I think I'm about three fourths through MGS4.\r\nIt took me for-fucking-ever to realize that you need to uses the Nano-suppressors on Vamp.","author":"4fde4618945b700aa0002fff"},{"id":"54c207aa63687213a6b82200","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/54c20694636872037ab40f00#post_54c20694636872037ab40f00\r\nMe too.\r\n\r\nWatched the first two Episodes of Doki Doki Precure. (Lance might actually replace Hummy as the most adorable Fairy.)","author":"5062d6f17f123b3e16001184"},{"id":"54c208726368722511b21500","topic_id":"5161dd617f123bd25900013d","body":"\"@trashboat\":/dis/the-time-wasting-thread/post/54c207aa63687213a6b82200#post_54c207aa63687213a6b82200\r\nI just kept shooting him and shioting him and nothing.\r\nThen I realized that he has nanomachines and I have nanosuppressors.\r\nAnd then I slapped myself.","author":"4fde4618945b700aa0002fff"},{"id":"54c208aa6368723cad6a1e00","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/54c208726368722511b21500#post_54c208726368722511b21500\r\nI think I had to look up a walkthrough. (4 being my first metal gear game didn't help.)","author":"5062d6f17f123b3e16001184"},{"id":"54c2091a6368722790ba4700","topic_id":"5161dd617f123bd25900013d","body":"\"@trashboat\":/dis/the-time-wasting-thread/post/54c208aa6368723cad6a1e00#post_54c208aa6368723cad6a1e00\r\nI won't use a walkthrough for any game ever.\r\n","author":"4fde4618945b700aa0002fff"},{"id":"54c2095b6368727881470d00","topic_id":"5161dd617f123bd25900013d","body":"Just woke up at the hotel\r\nThe con doesn't start for several more hours \r\nDon't know if I can go back to sleep\r\n\r\nImma watch some jojo\r\n\r\n\r\n\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/54c20694636872037ab40f00#post_54c20694636872037ab40f0\r\nI know that's kinda sillily obtuse but I love that kind of stuff that works within a game's fiction's own logic. Like the ending of the sorrow fight. ","author":"500b587e7f123b1f230014a9"},{"id":"54c209af6368722511ef1500","topic_id":"5161dd617f123bd25900013d","body":"\"@Too_Offensive\":/dis/the-time-wasting-thread/post/54c2095b6368727881470d00#post_54c2095b6368727881470d00\r\nI realized it and I'm like \"Jesus FUCK I'm stupid!\"","author":"4fde4618945b700aa0002fff"},{"id":"54c20a2263687218a3df0900","topic_id":"5161dd617f123bd25900013d","body":"And I don't care what anyone says.\r\nREX is waaaaaaaaaaaaaaaaaaaaaaaaaay cooler than RAY.","author":"4fde4618945b700aa0002fff"},{"id":"54c20a246368722dd77e1100","topic_id":"5161dd617f123bd25900013d","body":"\"@HJSDGCE\":/dis/the-time-wasting-thread/post/54c1fe5263687229debc2600#post_54c1fe5263687229debc2600\r\nShort explanation is that you know how social interactions is important for a person to grow up mentally healthy and can function?  Now imagine a child being raised with next to no social interaction and what little social interaction you give them you're a prick to them.\r\n\r\nI straight up don't get a lot of things about \"normal\" thought processes.  For example let's say your next door neighbor won a brand new car and a trip to the carribean because you were originally supposed to be home and you weren't home at the time that they were going to give you it so they went next door to give it to your neighbor instead.  Most people would have the reaction of \"FUCKING SHIT!\"  I don't get that concept cause beyond basic concepts I never from a outside source learned about the concepts of envy or such.\r\n\r\nTo use an analogy think of it as like living in another country with a completely different language.  In order to live in a different country with a different language you're required to know the language, the laws and the basic etiquette; there is no law that requires you to know their folklore, nor their history, nor their mythology, nor a lot of things really.  I understand the laws, the language and such, but I don't know anything about the culture.\r\n\r\nIf anything psychologists stress me way more out cause it's like \"you're not happy; let's shove anti-depressants down your throat!\"  I understand what people consider to be \"healthy\" thoughts; I just don't get it cause they're often complex thoughts based upon numerous factors.  I'm really good at pretending to be normal and functioning normally, but that doesn't mean I think \"normally\".  From my point of view I'm not insane just have a different thought process for solving things; from everyone's else's points of views I'm insane for having different thought processes.  I've just been told \"TAKE THE ANTI-DEPRESSANTS ALREADY!  YOU'RE NOT HAPPY SO YOU NEED THEM!\" that I've started to believe them.\r\n\r\nHonestly I used to have some serious mental problems; self-harm, severe socially crippling ocd, forgot the third one, but I got better and overcame those so I don't get why people keep telling me that I'm insane; sure I'm not happy most of the time but that doesn't mean I'm depressed and just cause someone is stressed about not having a job doesn't mean they're harming themselves nor does it mean that they need to go to a mental hospital.\r\n\r\nHonestly I think \"normal\" people are fucking insane for having the mentality of \"oh, you're not happy?  Choo-choo here comes the anti-depressants! Open your mouth and swallow them!\".\r\n\r\nHonestly whenever someone offline that knows about all this talks to me it stresses me the fuck out cause they always come into with the mentality of \"you act funny so therefore you're insane so you need anti-depressants\".  I don't harm myself anymore; I don't walk prime numbers to places and if it's not a prime number circle back and forth until the total number is a prime number; none of that and yet even though I've overcome a lot I'm still considered insane for thinking differently.  I don't even know if they even have a classification for this; I just get written off as depression and shoved out and if anything psychologists, counselors and such stress me way more.","author":"38b55cdf63616403d7560600"},{"id":"54c20a3e63687232a57a1a00","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/54c2091a6368722790ba4700#post_54c2091a6368722790ba4700\r\nThere's some games that just require a walkthrough for me. \r\nLike puzzle games. A lot of the times it gets to where it's just frustrating. Or rpg's with maze like dungeons and an a high random encounter rate. ","author":"500b587e7f123b1f230014a9"},{"id":"54c20a676368721bd9c90c00","topic_id":"5161dd617f123bd25900013d","body":"\"@trashboat\":/dis/the-time-wasting-thread/post/54c208aa6368723cad6a1e00#post_54c208aa6368723cad6a1e00\r\nHoly crap I didn't know you played through Metal Gear 4!\r\n\r\n\r\n\"@Too_Offensive\":/dis/the-time-wasting-thread/post/54c2095b6368727881470d00#post_54c2095b6368727881470d00\r\nYou doing any sight seeing!\r\n\r\n\r\n\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/54c209af6368722511ef1500#post_54c209af6368722511ef1500\r\nOh yeah that asshole. What a pain!","author":"50c204917f123b31440000a5"},{"id":"54c20b1e636872440e242000","topic_id":"5161dd617f123bd25900013d","body":"\"@Number1pegasus\":/dis/the-time-wasting-thread/post/54c20a676368721bd9c90c00#post_54c20a676368721bd9c90c00\r\nI think I was like 14 at the time.","author":"5062d6f17f123b3e16001184"},{"id":"54c20b386368723bfc952900","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/54c20a2263687218a3df0900#post_54c20a2263687218a3df0900\r\nEverybody knows the coolest metal gear is excelsu-ppppffffffftch\r\n\r\nRay is kinda cute though \r\n!fc03.deviantart.net/fs70/f/2011/027/7/f/metal_gear_ray_cake_by_josephsk-d387e80.jpg!","author":"500b587e7f123b1f230014a9"},{"id":"54c20b5363687240cfb31000","topic_id":"5161dd617f123bd25900013d","body":"\"@trashboat\":/dis/the-time-wasting-thread/post/54c20b1e636872440e242000#post_54c20b1e636872440e242000\r\nOh wow really?\r\n\r\nYou must have played it when it came out then? ","author":"50c204917f123b31440000a5"},{"id":"54c20bae6368725c20d71400","topic_id":"5161dd617f123bd25900013d","body":"\"@Number1pegasus\":/dis/the-time-wasting-thread/post/54c20a676368721bd9c90c00#post_54c20a676368721bd9c90c00\r\nI've visited the mystical temples known as \"target\" and \"chilie's\"\r\n\r\nBut otherwise nah. We got a room in the hotel adjoined to the convention center so we probably won't be going out much. ","author":"500b587e7f123b1f230014a9"},{"id":"54c20beb6368720c5e781200","topic_id":"5161dd617f123bd25900013d","body":"\"@Number1pegasus\":/dis/the-time-wasting-thread/post/54c20b5363687240cfb31000#post_54c20b5363687240cfb31000\r\nNot even close. (Around 2012)","author":"5062d6f17f123b3e16001184"},{"id":"54c20c186368723329c40c00","topic_id":"5161dd617f123bd25900013d","body":"\"@Too_Offensive\":/dis/the-time-wasting-thread/post/54c20b386368723bfc952900#post_54c20b386368723bfc952900\r\nRAY is cute but let's look at the facts.\r\nA bunch if RAYs were made. And most of them get blown th fuck up by Snake or Raiden. Only ONE REX was built. It gone blown the fuck up by Snake and left to fall into disrepair for NINE YEARS. And when Snake needed it, IT STILL WORKED. AND IT KICKED RAY'S ASS!","author":"4fde4618945b700aa0002fff"},{"id":"54c20cd16368722597ab4b00","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/54c20c186368723329c40c00#post_54c20c186368723329c40c00\r\nAbsolutely. You could argue that snake is a more skilled pilot but I call crap on that.  oceliquid could have practiced piloting a ray whenever he wants\r\nThere was only one Rex and snake just sort of figured out the controls. ","author":"500b587e7f123b1f230014a9"},{"id":"54c20d0763687257fe0c1000","topic_id":"5161dd617f123bd25900013d","body":"\"@Too_Offensive\":/dis/the-time-wasting-thread/post/54c20cd16368722597ab4b00#post_54c20cd16368722597ab4b00\r\nWell to be fair, he had Otacon right beside him.\r\nAnd Otacon designed the damn thing.","author":"4fde4618945b700aa0002fff"},{"id":"54c20d986368724ac38a2000","topic_id":"5161dd617f123bd25900013d","body":"\"@Too_Offensive\":/dis/the-time-wasting-thread/post/54c20bae6368725c20d71400#post_54c20bae6368725c20d71400\r\nI heard legends that people get fat in those places and never come out!\r\n\r\nScary stuff man, be safe!\r\n\r\n\r\n\"@trashboat\":/dis/the-time-wasting-thread/post/54c20beb6368720c5e781200#post_54c20beb6368720c5e781200\r\nThat's funny I think I saw the walkthrough to that game either around that year or 2011? ","author":"50c204917f123b31440000a5"},{"id":"54c20df563687243de143500","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/54c20d0763687257fe0c1000#post_54c20d0763687257fe0c1000\r\nThat's true but there's only so much you could communicate through a mk ii in that amount of time. He definitely could have helped with the startup sequence though with the little tentacle arm. \r\n","author":"500b587e7f123b1f230014a9"},{"id":"54c20e5d6368724ac3cb2000","topic_id":"5161dd617f123bd25900013d","body":"\"@Number1pegasus\":/dis/the-time-wasting-thread/post/54c20d986368724ac38a2000#post_54c20d986368724ac38a2000\r\n[spoiler]!stream1.gifsoup.com/view/800524/fat-bastard-o.gif!\r\n\r\nI also got ginger and Scottish apparently[/spoiler]","author":"500b587e7f123b1f230014a9"}]}