{"topics":[{"id":"54c4a6426368723e6f6c0300","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/54c4a4cf63687214bdf80f00#post_54c4a4cf63687214bdf80f00\r\n[bq=\"uc9\"]\r\n!http://th06.deviantart.net/fs71/PRE/i/2014/154/5/a/godzilla_by_gamerag3-d7kw08c.jpg!\r\n(yes that is a humanized godzilla if you're wondering)[/bq]\r\nNow I want that to face off against Charles Barkley Earth's Greatest Warrior\r\n!http://stream1.gifsoup.com/view2/1346992/barkley-vs-godzilla-o.gif!","author":"505696b47f123b37e800effa"},{"id":"54c4a6546368727dc1890800","topic_id":"5161dd617f123bd25900013d","body":"Okay. \"One more pic of Lance\":http://www.zerochan.net/1481832 (He's so adorable that I could die.)\r\n\r\nOff to bed for real.","author":"5062d6f17f123b3e16001184"},{"id":"54c4a7a96368721ad82c0700","topic_id":"5161dd617f123bd25900013d","body":"[spoiler]Snow White just straight up murdered Shere Khan.[/spoiler]","author":"4fde4618945b700aa0002fff"},{"id":"54c4a7c16368727dc1270900","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/54c4a4cf63687214bdf80f00#post_54c4a4cf63687214bdf80f00\r\nI LOVE IT \r\nDAT GODZILLA\r\n\r\nUGH\r\nAND KIRYU!!!! <3\r\n*Dead*\r\n","author":"51a2815b7f123be59500049b"},{"id":"54c4a8136368720ac2a50100","topic_id":"5161dd617f123bd25900013d","body":"Jotaro is considering just hitting Dan of Steel so hard he dies so quickly he won't even feel the pain\r\nand I think\r\nif you had a shotgun, a headshot would do the trick","author":"4fe3df367f123b517900066a"},{"id":"54c4a84a63687232808a0200","topic_id":"5161dd617f123bd25900013d","body":"\"@mariomarc\":/dis/the-time-wasting-thread/post/54c4a8136368720ac2a50100#post_54c4a8136368720ac2a50100\r\nOh don't worry.\r\nYou're gona looooooove what happens.","author":"4fde4618945b700aa0002fff"},{"id":"54c4a89963687206036a0600","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/54c4a84a63687232808a0200#post_54c4a84a63687232808a0200\r\nomg they are going to shrink their stands\r\nawesome","author":"4fe3df367f123b517900066a"},{"id":"54c4a8de6368726828170b00","topic_id":"5161dd617f123bd25900013d","body":"\"@mariomarc\":/dis/the-time-wasting-thread/post/54c4a89963687206036a0600#post_54c4a89963687206036a0600\r\nIt's gonna get better!","author":"4fde4618945b700aa0002fff"},{"id":"54c4a9646368720603b90600","topic_id":"5161dd617f123bd25900013d","body":"[spoiler]So the residents of The Farm have gone full-on terrorist.[/spoiler]","author":"4fde4618945b700aa0002fff"},{"id":"54c4abe0636872211dd60900","topic_id":"5161dd617f123bd25900013d","body":"I just took a bath. So, what'd I miss?","author":"52f0834d63687261cba90300"},{"id":"54c4acdc6368720e51420200","topic_id":"5161dd617f123bd25900013d","body":"Speaking of artist and deviantart; you know what's utter bullshit?  Deviantart's rules are completely batshit insane when it comes to adult artists.\r\n\r\nWhat I mean by this is you're obviously not allowed to link to porn, but what is bullshit is that let's say you link to your tumblr and your tumblr links to a porn account; that could be construed as linking to porn and still get you banned.\r\n\r\nWhat's double bullshit, for those of you that haven't been paying attention to gamergate/sjw bullshit, one of the big things that people haven't really noticed is that lately they've been changing their rhetoric to expand it into sexuality.  Basically sjw have always been anti-porn and anti-sexuality they just go \"we're not against sexuality; we're just against things that are 'problematic'\".  The reason why this is important is that the last couple of games that they've been trying to get rid of have been because of sexuality in them and they're trying to expand into other forms of media and other websites.  I know it's rude, but I totally 100% called that this was going to eventually happen because once they eventually realized that they couldn't win against geeks they would go after the next thing they find \"problematic\".  Side note: yes sjw are slowly taking over the anti-sexuality movement.\r\n\r\nThe reason why I've heard so much about this shit on DA is that deviantart *REALLY REALLY REALLY* fucking hates monster girls.  There is a reason why the monster girl fandom has next to no presence on deviantart even though the fandom is popular cause there's a very real possibility that unless you're popular you can wind up one morning with all your shit deleted or you banned or such.\r\n\r\nIf you ever wonder \"why is uc9 so giddy about all the drama going on?\" or \"if monster girls are so popular why don't they have a larger internet presence?\" well now you have answers to both; the monster girl fandom is one of the fandoms sjw have constantly pursued to try to get rid of cause it's a fandom that originated around sexualization.  Sjw truly are the final boss of the internet for geeks at least because the current thing inhibiting geek fandoms from growing is them trying to push new fandoms off the internet and such.\r\n\r\nTl:dr; Deviantart's rules are batshit insane.  I keep bringing up the drama cause with all the fandoms sjw have tried to chase off the internet will finally stop getting shat all over.\r\n\r\n\r\nIf you wonder how bad sjw's censorship is imagine how shit youtube's copyright system is and now imagine it for art and now imagine it for anything the system finds \"problematic\".","author":"38b55cdf63616403d7560600"},{"id":"54c4ad0063687241ff2e1500","topic_id":"5161dd617f123bd25900013d","body":"\"@Albus Fahrenheits\":/dis/the-time-wasting-thread/post/54c4abe0636872211dd60900#post_54c4abe0636872211dd60900\r\nNothing much Trash and Sepphy retired for the night,\r\nMarc's watching Jojo and I'm reading Fables.","author":"4fde4618945b700aa0002fff"},{"id":"54c4ad9763687244bb980200","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/54c4acdc6368720e51420200#post_54c4acdc6368720e51420200\r\nEven I know not to mess with uc9's monster waifus.","author":"4fde4618945b700aa0002fff"},{"id":"54c4aed46368723e6fd40500","topic_id":"5161dd617f123bd25900013d","body":"\"Here's your receipt\"","author":"4fe3df367f123b517900066a"},{"id":"54c4b07663687246e9c60700","topic_id":"5161dd617f123bd25900013d","body":"\"I'm gonna watch One Piece.\":https://www.youtube.com/watch?v=RSe8D2wfGKI \r\n\r\n","author":"505696b47f123b37e800effa"},{"id":"54c4b1316368721ad8b70800","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/54c4acdc6368720e51420200#post_54c4acdc6368720e51420200\r\nSo they consider sex is a bad thing?\r\n\r\n\r\n\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/54c4ad0063687241ff2e1500#post_54c4ad0063687241ff2e1500\r\nAlso, I got Metro 2033 Redux but will not play until I complete the book.","author":"52f0834d63687261cba90300"},{"id":"54c4b2096368723c8fc70000","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/54c4ad9763687244bb980200#post_54c4ad9763687244bb980200\r\nNot even for that, but for how much sjw pose a threat alone to geek culture in general they must be wiped out completely.\r\n\r\n\r\nWhat do I mean by this?  I'll illustrate a point of how much of a threat they are.  Let's ignore how I don't like shonen for a second to look at the numbers; I'm not bringing in any personal opinions or anything into and merely looking at it from a sales view, if you want to discuss it with me then another time.  The reason why I bring this up is according to forbes when daily life with monster girl volume 1 came out on the same date a volume of one piece came out in the usa it beat out one piece in usa sales wise for two weeks. . . Don't you think there's something really weird about how a manga that sold that well has next to no western fanart anywhere on western sites?  \"Well it's a new franchise that potentially hasn't gained traction\"  What happened when the manga came out could only be described as a artistic purge across every site that sjw control.  It didn't matter if you drew porn or just the characters completely safe for work in sunday attire; your ass was gone buddy for \"illicit content\".  Fortunately shit's chilled out but that's mainly because gg is going on and their tens of millions of dollars is getting poured into that.\r\n\r\nThat's why I want the sjw movement dead cause if you break it down all the new geek fandoms appearing fall into the category of they couldn't be stopped cause they were gaining too much popularity too fast and that they couldn't be assimilated into sjw mindset.  It's also probably why almost every geek fandom is getting in on the action to some degree at this point cause everyone to some degree understands how much of a threat they are.\r\n\"@Albus Fahrenheits\":/dis/the-time-wasting-thread/post/54c4b1316368721ad8b70800#post_54c4b1316368721ad8b70800\r\nYes; they hate any form of porn or sexuality and the mainstream sjw movement.  They also consider being a gay male or trans woman a form of discriminatory against women and belief trans men are \"traitors\". . . Oh; don't forget the extreme amounts of racist beliefs they hold.","author":"38b55cdf63616403d7560600"},{"id":"54c4b3e163687258b77f1800","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/54c4b2096368723c8fc70000#post_54c4b2096368723c8fc70000\r\nSuddenly, I'm reminded of Pol Pot and the Khmer Rouge. By killing off anyone who knows too much and basically making everyone else believe in their lies. \r\n\r\nWhat exactly are they trying to build here? What's their grand master plan? or are they just out to destroy things that get in their way?","author":"52f0834d63687261cba90300"},{"id":"54c4b4af6368720da1f43000","topic_id":"5161dd617f123bd25900013d","body":"\"@Albus Fahrenheits\":/dis/the-time-wasting-thread/post/54c4b3e163687258b77f1800#post_54c4b3e163687258b77f1800\r\n!http://obeygiant.com/images/2009/01/poster_1984_lrg.jpg!","author":"38b55cdf63616403d7560600"},{"id":"54c4b55d63687212b8a80e00","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/54c4b4af6368720da1f43000#post_54c4b4af6368720da1f43000\r\nBIG BROTHER IS WATCHING YOU","author":"505696b47f123b37e800effa"},{"id":"54c4b6ab6368725b24400a00","topic_id":"5161dd617f123bd25900013d","body":"\"@uc9\":/dis/the-time-wasting-thread/post/54c4b4af6368720da1f43000#post_54c4b4af6368720da1f43000\r\nThe thing with SJWs is that their not even warriors at all. Their worriers more like. Put then in a dire situation and they'd just pee their pants.","author":"52f0834d63687261cba90300"},{"id":"54c4b7b663687212b8441000","topic_id":"5161dd617f123bd25900013d","body":"[spoiler]So Jack just swindled a Bag of Holding out of SATAN in a game of poker.[/spoiler]","author":"4fde4618945b700aa0002fff"},{"id":"54c4b88263687258b7761a00","topic_id":"5161dd617f123bd25900013d","body":"\"@SquiggyBomb\":/dis/the-time-wasting-thread/post/54c4b7b663687212b8441000#post_54c4b7b663687212b8441000\r\nWait, so it's like Grimm Bros. fairy tales in modern times?","author":"52f0834d63687261cba90300"},{"id":"54c4b8c96368722175410c00","topic_id":"5161dd617f123bd25900013d","body":"\"@Albus Fahrenheits\":/dis/the-time-wasting-thread/post/54c4b88263687258b7761a00#post_54c4b88263687258b7761a00\r\nPretty much. Bluebeard is here too.\r\nHe's an asshole.","author":"4fde4618945b700aa0002fff"},{"id":"54c4b8cf636872602c570800","topic_id":"5161dd617f123bd25900013d","body":"It's oddly satisfying to build small houses out of matches and light them on fire.\r\n\r\nSometimes i build small villages out of matches. I imagine tiny people living in them, going about their daily lives in their tiny world.\r\n\r\nThen i burn them all.","author":"5007bbdf7f123b112f00023a"}]}